[{"_id":"BOS017","_updatedAt":"2025-05-14T13:43:39.747Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Apoorva Joshi, Senior AI Developer Advocate | MongoDB\nPrerequisites/Links:\n\n2025 is widely touted to be the year of AI agents, and we don’t want you to miss out! With the ability to observe, plan, and act autonomously, AI agents are driving transformation across industries—automating business processes, driving data insights, and augmenting human potential like never before.\n\nIn this tutorial, you will learn the foundational concepts of AI agents, such as reasoning, memory, and tool use. We will also cover a few different agent architectures and explore real-world applications of AI agents. Finally, you will see a live code walkthrough of how to build an AI agent end-to-end. The tutorial code and detailed documentation will be shared so you can build the AI agent after the fact at your own pace.\n\nPart 1: Core Concepts and Use Cases\nThis module will cover core concepts of building agentic systems, use cases for AI agents, and a few different agent architectures.\n\nPart 2: Build an AI Agent\nIn this module, we will actually build an AI agent for a technical documentation website using LangGraph, MongoDB, Claude 3.5 Sonnet from Anthropic, and open-source embedding models from Hugging Face. This involves the following:\n- Create agent tools\nCreate two tools for the AI agent, one for Q&A and another for summarization.\n- Create the agent \nOrchestrate the agent as a graph using LangGraph.\n- Add memory to the agent\nAdd short-term memory to the AI agent so it can have multi-turn conversations with users.","detailLink":"","difficulty":"Advanced","displayStartTime":"11:35 AM - 12:35 PM ET","duration":"60","endTime":"12:35 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.58dtb3cl6hlm","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-apoorva-joshi-the-a-to-z-of-building-ai-agents","speakerCompany":"MongoDB","speakerName":"Apoorva Joshi","speakerTitle":"Senior AI Developer Advocate","subtrack":"Tutorial","talkTitle":"The A to Z of Building AI Agents","target":"","timeZone":"America/New_York","timerStartTime":"11:35:00","topicTag1":"","topicTag2":"AI Agents ","topicTag3":"AI Engineering, Generative AI","topicTag4":"Advanced","track":"May 14","uniqueId":"BOS017","webinarLink":"https://streamyard.com/watch/bbNWQw9EG5Sy"},{"_id":"BOS019","_updatedAt":"2025-05-14T13:43:39.700Z","access":"General","active":"yes","date":"2025-05-14","description":"Maxime Labonne, PhD, Head of Post-Training |  Liquid AI\nPrerequisites/Links:\n\nIn this talk, we will cover the fundamentals of modern LLM post-training at various scales with concrete examples. High-quality data generation is at the core of this process, focusing on the accuracy, diversity, and complexity of the training samples. We will explore key training techniques, including supervised fine-tuning and preference alignment. The presentation will delve into evaluation frameworks with their pros and cons for measuring model performance. We will conclude with an overview of emerging trends in post-training methodologies and their implications for the future of LLM development.\n\nLearning Objectives and Tools:\nHow to generate data for post-training, how to train LLMs and which libraries to use, and how to evaluate them.","detailLink":"","difficulty":"Intermediate","displayStartTime":"10:00 AM - 10:25 AM ET","duration":"25","endTime":"10:25 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-maxime-labonne-introduction-to-llm-post-training","speakerCompany":" Liquid AI","speakerName":"Maxime Labonne, PhD","speakerTitle":"Head of Post-Training","subtrack":"Talk","talkTitle":"Introduction to LLM Post-Training","target":"","timeZone":"America/New_York","timerStartTime":"10:00:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"Generative AI","topicTag4":"Intermediate","track":"May 14","uniqueId":"BOS019","webinarLink":"https://streamyard.com/watch/PrAmUpZGHzjQ"},{"_id":"BOS125","_updatedAt":"2025-05-14T13:43:39.703Z","access":"General","active":"yes","date":"2025-05-14","description":"Eric Xing, PhD, Professor at CMU | President at MBZUAI\n\nAbsrtact:\nThe success of large language models (LLM) like OpenAI’s GPTs has fascinated us, with their astounding capabilities in a wide range of tasks such as genius-level standard test performance, IMO-level math reasoning, encyclopedic-like question-answering, and human-like ability in conversation and writing. However, how such systems are produced and where they go next remain a subject not very accessible to the broader academic and industrial community. \n\nIn this talk, I will first share our recent experience on producing industrial-scale LLMs from scratch: introduce a collection of state-of-the-art LLMs we produced such as the K2, Jais (Arabic), and vicuna; discuss a few system and algorithm issues regarding how to scale up, out, and down LLM training/inference; and present an open source initiative called LLM360 that we hope to stand next to the open-API (like GPT) and open-weight (like Llama) families as the third paradigm of LLM R&D suitable for communities such as the academia that value and demand full transparency and reproducibility.  Then I will discuss limitation of current LLMs in capabilities such as embodied reasoning, physical reasoning, social reasoning, strategic planning, and a pathway toward such capabilities through next generation systems such as World Models capable of steerable creation (of any next-world resultant from agentic action) and simulative reasoning (thought experiments over alternative next-worlds) in a virtual universe; and Agent Models capable of living, acting, and strategizing in such a universe.  Finally, I will briefly share an outlook of how new advancements in AI can help to decode biology via the next generation Bio foundation model AIDO (AI-driven Digital Organism). My newly sparked attention to philosophy may also land us on some fun debate about what is “AGI” and what is “agency”, which may help to invite new ideas from audience. ","detailLink":"","difficulty":"All Levels","displayStartTime":"09:30 AM - 09:55 AM ET","duration":"25","endTime":"09:55 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"","speakerCompany":"CMU | MBZUAI","speakerName":"Eric Xing, PhD","speakerTitle":"Professor | President ","subtrack":"Keynote","talkTitle":"Toward General and Purposeful Reasoning in Real World Beyond Lingual Intelligence","target":"","timeZone":"America/New_York","timerStartTime":"09:30:00","topicTag1":"","topicTag2":"Generative AI","topicTag3":"LLMs, AI for Biotech and Pharma","topicTag4":"All Levels","track":"May 14","uniqueId":"BOS125","webinarLink":"https://streamyard.com/watch/PrAmUpZGHzjQ"},{"_id":"BOS008","_updatedAt":"2025-05-14T13:43:39.705Z","access":"General","active":"yes","date":"2025-05-13","description":"Carlos Trujillo, Principal Data Scientist | Wise\nPrerequisites/Links:\n\nIn the era of data-driven decision-making, understanding causal relationships is crucial for effective marketing strategies. This talk delves into the underexplored connection between Bayesian causal thinking and media mix modeling, linking Directed Acyclic Graphs (DAGs), Structural Causal Models (SCMs), and the Data Generation Process (DGP). By navigating through these key concepts, we will demonstrate how we can build models that not only predict outcomes but also represent causal mechanisms within the marketing ecosystem.\n\nStarting from foundational principles, we will explore how DAGs serve as a formal language for encoding causal assumptions, how Structural Causal Modeling define relationships in media mix models, and how we implement those in the Bayesian framework through the famous DGP. We will further illustrate how media mix models can be employed as causal inference tools to estimate counterfactuals and causal effects, providing actionable insights into the effectiveness of media investments.\n\nFinally, we’ll show how Bayesian inference enables us to update these causal beliefs in light of data. This synthesis of causal reasoning and probabilistic modeling is not only theoretically rich but practically powerful—offering a robust framework for constructing media mix models that more accurately reflect the complexities of real-world marketing dynamics.\n\nAttendees will leave with an understanding of how to apply Bayesian causal discovery (guided by an example in an IPython notebook) to develop causally valid models that can be applied to real-world marketing data. They will learn how to use Media Mix Models as causal inference tools to estimate counterfactual scenarios and causal effects, unlocking deeper insights into the effectiveness of media investments. This presentation aims to reveal a new pathway for marketers, data scientists, and researchers to harness the potential of these powerful methodologies together, empowering them to drive more informed, causally grounded decisions.","detailLink":"","difficulty":"Intermediate","displayStartTime":"10:35 AM - 11:05 AM ET","duration":"30","endTime":"11:05 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-carlos-trujillo-bridging-causal-thinking-and-media-mix-modeling","speakerCompany":"Wise","speakerName":"Carlos Trujillo","speakerTitle":"Principal Data Scientist","subtrack":"Talk","talkTitle":"Bridging Causal thinking and Media Mix Modeling","target":"","timeZone":"America/New_York","timerStartTime":"10:35:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"Data Visualization & Analytics","topicTag4":"Intermediate","track":"May 13","uniqueId":"BOS008","webinarLink":"https://streamyard.com/watch/qGTBtBcAj2ht"},{"_id":"BOS009","_updatedAt":"2025-05-14T13:43:39.708Z","access":"General","active":"yes","date":"2025-05-13","description":"Nadieh Bremer, Data Visualization Designer | Visual Cinnamon\nPrerequisites/Links:\n\nSome data visualizations are meant to be understood in seconds; the cleaner and clearer the data is conveyed, the better. Other times, it’s more important to capture the audience’s eye, draw their attention, and evoke a feeling or emotion, rather than presenting the data in precise values. And what if you want both? Explaining the data while maintaining a strong focus on visual aesthetics?\n\nIn this presentation, Nadieh will take you on a journey through her client and personal projects, inspiring you on what's possible in visualizing data, and sharing her favorite lessons on making a visual more effective, beautiful and memorable. She’ll demonstrate how to navigate the spectrum between straightforward data visualizations and data art, or land somewhere beautifully in between. While her work is created using JavaScript and d3.js, the lessons she shares will be practical and tool-agnostic, offering valuable insights for both data visualization beginners and seasoned practitioners alike.\n\nIt’s time to move beyond pre-programmed defaults, to think outside the chart. It’s time to unlock the full potential of data through innovative design and produce visuals that resonate long after the numbers have been crunched.\n\nThis presentation is split into several practical lessons that I distilled from my decade of experience working in the field of data visualization. The tools used are vanilla JavaScript, combined with d3.js. By the end, the audience will have learned several ways to move between making a no-nonsense dataviz and data art, and making their data visualizations more effective, memorable and creative along the way.","detailLink":"","difficulty":"All Levels","displayStartTime":"10:00 AM - 10:30 AM ET","duration":"30","endTime":"10:30 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-nadieh-bremer-amidst-the-visualization-and-art-of-data","speakerCompany":"Visual Cinnamon","speakerName":"Nadieh Bremer","speakerTitle":"Data Visualization Designer","subtrack":"Talk","talkTitle":"Amidst the Visualization and Art of Data","target":"","timeZone":"America/New_York","timerStartTime":"10:00:00","topicTag1":"","topicTag2":"Data Visualization & Data Analysis","topicTag3":"","topicTag4":"All Levels","track":"May 13","uniqueId":"BOS009","webinarLink":"https://streamyard.com/watch/qGTBtBcAj2ht"},{"_id":"BOS018","_updatedAt":"2025-05-14T13:43:39.750Z","access":"Premium","active":"yes","date":"2025-05-15","description":"Ivan Lourenço Gomes, Front-End Engineer & Technology Instructor | Daweb Schools\nPrerequisites/Links:\n\nThe latest DeepSeek V3 and R1 models have demonstrated superiority in many AI industry benchmarks, particularly in Math and Coding. Their enhanced contextual understanding, speed, and cost-efficiency have gained the attention of businesses and experts in the field, making them an essential area of knowledge for all tech professionals.\n\nThis tutorial provides a comprehensive introduction to DeepSeek, highlighting its strengths in code generation, reasoning, and automation workflows.\n\nAttendees will gain insights into:\n\n- How DeepSeek V3 and R1 compare to other LLMs in terms of performance, efficiency, and capabilities.\n- Advanced prompt engineering techniques to enhance the accuracy of AI-generated responses.\n- No-code automation using Make.com workflows to integrate AI into business operations.\n- Use cases of DeepSeek models across various industries:\n   • Finance & Business Intelligence: Automating financial analysis & report generation.\n   • Product Engineering: Assisting in software development by generating, debugging, and optimizing code, reducing time-to-market for new products.\n   • Sales & Marketing: Enhancing customer interactions with AI chatbots, creating personalized marketing content, and automating lead generation.\n   • Customer Support & Operations: Automating responses, summarizing customer queries, and improving service efficiency through AI-powered workflows.\n\nBy the end of this session, attendees will understand how to integrate DeepSeek into their projects, create AI-assisted automation, and master prompt engineering for real-world applications.\n\nTarget Audience:\nThis session is ideal for developers, AI enthusiasts, data scientists, and automation specialists looking to enhance their AI implementation skills without requiring deep machine learning or coding knowledge.\n\n1. Introduction to DeepSeek V3 & R1\n- Overview of their architecture and key improvements\n- How they compare to other AI models in different benchmarks, like AIME 2024, MATH-500 and LiveCodeBench\n- Real-world use cases in coding, reasoning, and automation\n- Running DeepSeek and other AI models locally with Ollama for increased privacy\n\n2. Advanced Prompt Engineering\n- How different prompt structures impact responses\n- The 6 strategies to effectively communicate with AI models\n\n3. Automating Workflows with Make.com & DeepSeek\n- Overview of Make.com as a no-code automation tool\n- How to connect DeepSeek to workflows for free using Open Router.\n- Use cases: Integration with the most popular Apps in the market: Gmail, Google Drive, Spreadsheets & Docs, Youtube, Social Media Platforms, Jira, Trello, SQL Databases, CMS Systems & more.\n\nWhat attendees will learn\n- How to use DeepSeek V3 & R1 for more efficient AI interactions\n- Advanced prompt engineering strategies for improved accuracy\n- How to create AI automation with Make.com\n\nTools used in the session:\n- DeepSeek V3 & R1 models\n- Ollama\n- Make.com","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"11:35 AM - 12:35 PM ET","duration":"60","endTime":"12:35 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.u5zfvlcaz1ev","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-ivan-lourenco-gomes-mastering-deepseek-v3-r1-advanced-prompt-engineering-ai-automation","speakerCompany":"Daweb Schools","speakerName":"Ivan Lourenço Gomes","speakerTitle":"Front-End Engineer & Technology Instructor","subtrack":"Tutorial","talkTitle":"Mastering DeepSeek V3 & R1: Advanced Prompt Engineering & AI Automation","target":"","timeZone":"America/New_York","timerStartTime":"11:35:00","topicTag1":"","topicTag2":"Generative AI","topicTag3":"LLMs&RAG, AI Engineering, AI Agents","topicTag4":"Beginner-Intermediate","track":"May 15","uniqueId":"BOS018","webinarLink":"https://streamyard.com/watch/HeyppKwfsydH"},{"_id":"BOS010","_updatedAt":"2025-05-14T13:43:39.711Z","access":"Premium","active":"yes","date":"2025-05-13","description":"Hugo Bowne-Anderson, PhD, Independent Data and AI Consultant | \nPrerequisites/Links:\n\nAbstract: Large language models (LLMs) enable powerful data-driven applications, but many projects get stuck in “proof-of-concept purgatory”—where flashy demos fail to translate into reliable, production-ready software. This talk introduces the LLM software development lifecycle (SDLC)—a structured approach to moving beyond early-stage prototypes. Using first principles from software engineering, observability, and iterative evaluation, we’ll cover common pitfalls, techniques for structured output extraction, and methods for improving reliability in real-world data applications. Attendees will leave with concrete strategies for integrating AI into software—ensuring LLMs generate value beyond the prototype stage.\n\nLLMs have transformed the landscape of data-driven software, enabling applications in information retrieval, automated summarization, and intelligent assistants. However, many teams struggle to move beyond early-stage demos—where models appear to work well in controlled environments but fail in production due to hallucinations, non-determinism, and poor evaluation practices.\n\nThis talk addresses that gap. It presents a structured framework for incorporating LLMs into real-world applications, grounded in software engineering best practices and scientific computing principles. Rather than focusing solely on model performance, we’ll emphasize how to design, evaluate, and iterate on AI-powered systems effectively.\n\nAttendees will gain insights into:\n\nThe LLM software development lifecycle (SDLC)—how it differs from traditional ML and software workflows.\nEvaluating business and scientific value—ensuring LLM outputs align with real-world needs.\nHandling non-determinism and hallucinations—logging, monitoring, and structured output techniques.\nBeyond conversations: Automating structured workflows—using LLMs for knowledge extraction, document processing, and decision support.\nIntended Audience\nThis talk is for data scientists, software engineers, and AI/ML practitioners looking to:\n\nMove beyond toy LLM demos and build production-ready systems.\nUnderstand how software engineering principles apply to AI-driven applications.\nLearn how to evaluate and iterate on LLM outputs to ensure robustness and reliability.\n\nAttendees don’t need prior LLM expertise—this talk focuses on software and systems principles applicable across AI applications.\nKey Takeaways\nBy the end of this talk, attendees will understand:\n\nWhy many LLM projects stall in proof-of-concept purgatory.\nThe key differences between LLM development and traditional software engineering.\nHow to design an iterative LLM SDLC, incorporating monitoring, evaluation, and structured outputs.\nStrategies for handling non-determinism and ensuring AI models work reliably in production.","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"12:55 PM - 1:25 PM ET","duration":"30","endTime":"1:25 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-hugo-bowne-anderson-escaping-proof-of-concept-purgatory-building-robust-llm-powered-applications","speakerCompany":"","speakerName":"Hugo Bowne-Anderson, PhD","speakerTitle":"Independent Data and AI Consultant","subtrack":"Talk","talkTitle":"Escaping Proof-of-Concept Purgatory: Building Robust LLM-Powered Applications","target":"","timeZone":"America/New_York","timerStartTime":"12:55:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"","topicTag4":"Beginner-Intermediate","track":"May 13","uniqueId":"BOS010","webinarLink":"https://streamyard.com/watch/qGTBtBcAj2ht"},{"_id":"BOS006","_updatedAt":"2025-05-14T13:43:39.714Z","access":"Platinum","active":"yes","date":"2025-05-13","description":"Sanyam Bhutani, Partner Engineer | Meta\nPrerequisites/Links:\n\nAbstract: In this 2-hour workshop, we will learn the best practices of building with Llama-4. We will get to the learn the best practices of using these models in application by learning the best practices of generating synthetic datasets and fine-tuning.\n\nOutline:\n5 min: Intro and outline\n15 min: Llama-4 new developments\n5 min: Break to setup Collab and coding environments\n20 min: Hands on: Prompt-Engineer, RAG best practices, multi-image chat and long context experience.\n10 min: Q&A\n\n \n\nSecond half: Best Practices of Generating Synthetic Datasets and Prompt Migration\n15 min: Intro to current challenges of prompt-engineering and synthetic-data generation, fine-tuning. Followed by best practices of these topics.\n10 min: Hands on understanding prompt migration\n20 min: Hands on synthetic data generation and best practices for fine-tuning.\n10 min: Q&A and discussing case studies from latest research","detailLink":"","difficulty":"Intermediate","displayStartTime":"01:45 PM - 03:45 PM ET","duration":"120","endTime":"3:45 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.sry2jm3m2zvp","slackUrl":"https://live.odsc.com/channel/tue-sanyam-bhutani-practical-llm-development-with-llama-4","speakerCompany":"Meta","speakerName":"Sanyam Bhutani","speakerTitle":"Partner Engineer","subtrack":"Training","talkTitle":"Practical LLM Development with Llama-4","target":"","timeZone":"America/New_York","timerStartTime":"13:45:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"","topicTag4":"Intermediate","track":"May 13","uniqueId":"BOS006","unlockable":true},{"_id":"BOS020","_updatedAt":"2025-05-14T13:43:39.752Z","access":"Platinum","active":"yes","date":"2025-05-15","description":"Chris Alexiuk, Co-Founder & CTO | DL | aI Makerspace | NVIDIA\nPrerequisites/Links:\n\nAbstract: \n\"How do I know if what comes out of my agentic LLM application is correct?”\n\n“What does a good output look like?”\n\n“How can I avoid hallucinations and wrong answers?”\n\nJust as in 2024, everyone working to develop production LLM applications is asking these questions, and rightly so!\n\nThis year, however, agents are on the rise, as are the number of companies building, shipping, and sharing LLM application prototypes.\n\nIn this event, we’ll explore the latest on agent evaluation from the leading LLM application evaluation framework: RAG ASsessment (RAGAS).\n\nJoin us live to learn about best practices for evaluating agentic workflows, including Topic Adherence, Tool call Accuracy, and Agent Goal accuracy.\n\nJoin us live to dig into the details, from concepts to code!\n\n📚 You’ll learn:\n- How to think about assessing your agent applications quantitatively, with leading best-practice metrics\n- How agentic workflows are being assessed at the LLM edge\n\n🤓 Who should attend the event:\n- Aspiring AI Engineers who want to build and evaluate production-grade agent applications\n- AI Engineering leaders who want to instrument their agent deployments with leading evaluators\n\nLearning Objectives and Tools:\nRagas, OpenAI, LangChain/LangGraph\n\nBackground Knowledge:\nPython, LangGraph","detailLink":"","difficulty":"Intermediate-Advanced","displayStartTime":"02:00 PM - 04:00 PM ET","duration":"120","endTime":"4:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.xrz47b2j4gdl","slackUrl":"","speakerCompany":"AI Makerspace | NVIDIA","speakerName":"Chris Alexiuk","speakerTitle":"Co-Founder & CTO | DL","subtrack":"Training","talkTitle":"RAG & Agent Evaluation with RAGAS in 2025","target":"","timeZone":"America/New_York","timerStartTime":"14:00:00","topicTag1":"","topicTag2":"LLMs&RAG","topicTag3":"","topicTag4":"Intermediate-Advanced","track":"May 15","uniqueId":"BOS020","unlockable":true},{"_id":"BOS002","_updatedAt":"2025-05-14T13:43:39.716Z","access":"Premium","active":"yes","date":"2025-05-13","description":"Freddy Boulton, Software Engineer | Hugging Face\nPrerequisites/Links:\n\nAudio and Video Streaming are revolutionizing AI applications right now.\nChatGPT and Gemini can listen and respond in real-time audio conversations.\nThe latest Text-to-Speech models and APIs make it easier than ever to generate lifelike audio.\n\nBut here's the challenge: building real-time voice and video applications in Python has been painfully complex... until now.\n\n**Enter FastRTC: Your Gateway to Voice & Video AI**\n\nIn this hands-on workshop, you'll build a voice assistant that can listen, speak, and understand you in real-time - with just a fraction of the code you'd expect. We'll demystify WebRTC and Websockets and show you how to create Siri-like experiences in pure Python.","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"10:00 AM - 11:00 AM ET","duration":"60","endTime":"11:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.i7iljr61sqjz","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-freddy-boulton-unlock-the-future-of-ai-real-time-voice-video","speakerCompany":"Hugging Face","speakerName":"Freddy Boulton","speakerTitle":"Software Engineer","subtrack":"Workshop","talkTitle":"Unlock the Future of AI: Real-Time Voice & Video","target":"","timeZone":"America/New_York","timerStartTime":"10:00:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"","topicTag4":"Beginner-Intermediate","track":"May 13","uniqueId":"BOS002","webinarLink":"https://streamyard.com/watch/5HcGGAsgssVp"},{"_id":"BOS003","_updatedAt":"2025-05-14T13:43:39.719Z","access":"Platinum","active":"yes","date":"2025-05-12","description":"Michael Galarnyk, Learning Instructor | PhD Student | Linkedin | Georgia Tech\nPrerequisites/Links:\n1. Python Basics (strings, integers, conditionals, for loops, dictionaries)\n2.Numpy, Pandas, Matplotlib\n3. Jupyter Notebooks\n\nTools/Languages utilized: Python\n\nCode Notebooks: https://github.com/mGalarnyk/MLModelsScikit-Learn/tree/main/04_Scikit_Learn\n\nNo need to login to anything or need credits. \n\nAbstract:\nScikit-learn is a popular open-source Python library that offers user-friendly and efficient versions of common machine learning algorithms. In this training, PhD student and machine learning instructor Michael Galarnyk will go over the various strengths and weaknesses of different supervised and unsupervised machine learning algorithms and then how to apply them to real-world situations (healthcare, finance, etc). Topics of the session include how to input and process data for machine learning, model validation strategies, choosing a model, linear regression, logistic regression, feature selection, support vector machines, decision trees, random forests, gradient boosting, visualizing decision trees, k-means clustering, hierarchical clustering, clustering metrics, dimensionality reduction, hyperparameter tuning, and regularization. Additionally, we will go over the use cases where scikit-learn is not the ideal tool such as in modern deep learning and natural language processing. By the end of the session, participants will understand the strengths and weaknesses of machine learning algorithms and learn how to quickly build better, more efficient machine learning models for various domains.\n\nLesson 1 Introduction to Scikit-Learn and Preprocessing Data for Machine Learning\nWhy should you use scikit-learn? We will cover the advantages of using the library which includes how it works well with other Python libraries (NumPy, Pandas, Matplotlib, etc),  contains a large number of machine learning algorithms, and how it works relatively well out of the box. However, before you fit a model using scikit-learn, your data has to be in a recognizable format. This includes dealing with missing data and arranging data into features and targets. \n\nLesson 2 Model Validation\nThe goal of machine learning is to build a model that performs well on new data. If you have new data, you need to see how well your model performs on it. The problem is that you may not have new data, but you can simulate this experience with model validation procedures like train test split and cross validation which we will cover. \n\nLesson 3 Supervised Learning\nWhat is supervised learning? We will start by going over how supervised machine learning algorithms learn the relationship between features and targets as well as various algorithms for regression (predict continuous value) and classification tasks (assign a label or category). We will spend the majority of our time practicing various supervised learning algorithms across various domains.\n\nLesson 4 Unsupervised Learning\nIn machine learning, you aren't always trying to predict the value. Sometimes your goal is to find some structure in your dataset. Unsupervised learning is when you train an algorithm without giving it the answers for examples in your dataset. We will go over dimensionality reduction and clustering techniques as well as some real life use cases. We will end the workshop by going over what to do when Scikit-Learn is not an ideal tool for machine learning.\n\nLearning Objectives and Tools:\n\nStudents will learn the theory behind several machine learning algorithms, how to use scikit-learn to tune models to understand and better predict unseen data as well as learn about the strengths and weaknesses of each algorithm. Open source libraries include NumPy, Pandas, Matplotlib, and scikit-learn.","detailLink":"","difficulty":"Beginner","displayStartTime":"10:00 AM - 12:00 PM ET","duration":"120","endTime":"12:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.r83fai2ebqze","slackUrl":"https://live.odsc.com/channel/mon-michael-galarnyk-building-machine-learning-models-with-scikit-learn-a-practical-introduction","speakerCompany":"Linkedin | Georgia Tech","speakerName":"Michael Galarnyk","speakerTitle":"Learning Instructor | PhD Student","subtrack":"Bootcamp","talkTitle":"Building Machine Learning Models with Scikit-Learn: A Practical Introduction","target":"","timeZone":"America/New_York","timerStartTime":"10:00:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"","topicTag4":"Beginner","track":"May 12","uniqueId":"BOS003","unlockable":true},{"_id":"BOS021","_updatedAt":"2025-05-14T13:43:39.755Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Joshua Brindley, Manager: Corporate & Commercial Analytics | GEMS Education\nPrerequisites/Links:\n\nWe’re surrounded by data, but numbers alone don’t drive action—stories do. This session will show you how to turn data into clear, compelling narratives that help people understand and make decisions.\n\nYou'll learn how to:\n\n- Structure a data story in a way that makes sense and keeps people engaged\n- Adjust your message depending on who you’re talking to\n- Design visuals that highlight key insights instead of overwhelming your audience\n- Make sure your data doesn’t just inform but actually drives action\n\nThis session is perfect for data professionals, business analysts, and decision-makers who want to go beyond just making reports and dashboards. Whether you're presenting to executives, sharing insights with your team, or creating content for a wider audience, you'll walk away with practical skills to communicate data in a way that truly matters.\n\nModule 1: Introduction to Data Storytelling\n- Why it matters\n- The gap between data and decision\n- Examples\n\nModule 2: Components of a Data Story\n- Narrative\n- Visuals\n- Context\n\nModule 3: Data Storytelling Framework\n- Hook\n- Context\n- Insight\n- Action\n\nModule 4: Data Visualization Techniques\n- Visual Design and Language\n- Effective Formatting","detailLink":"","difficulty":"All Levels","displayStartTime":"12:15 PM - 01:15 PM ET","duration":"60","endTime":"1:15 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.jse2daf4zai0","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-joshua-brindley-unlocking-the-power-of-data-storytelling-turning-insights-into-impact","speakerCompany":"GEMS Education","speakerName":"Joshua Brindley","speakerTitle":"Manager: Corporate & Commercial Analytics","subtrack":"Tutorial","talkTitle":"Unlocking the Power of Data Storytelling: Turning Insights into Impact","target":"","timeZone":"America/New_York","timerStartTime":"12:15:00","topicTag1":"","topicTag2":"Data Visualization & Data Analysis","topicTag3":"","topicTag4":"All Levels","track":"May 14","uniqueId":"BOS021","webinarLink":"https://streamyard.com/watch/gi57DNcyFusG"},{"_id":"BOS004","_updatedAt":"2025-05-14T13:43:39.722Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Valentina Alto, Technical Architect, AI & App | Microsoft\nPrerequisites/Links:\n\nAI multi-agent systems are revolutionizing the way intelligent applications operate, enabling autonomous agents to collaborate, communicate, and solve complex tasks. This session provides a hands-on introduction to AI agents, their evolution, and how to build multi-agent applications. Participants will start by exploring the fundamental anatomy of an AI agent, understanding its core components and the transition from traditional rule-based systems to modern LLM-powered agents. The session then delves into the design and implementation of multi-agent systems, covering key architectural principles, degrees of autonomy, and workflow coordination strategies that enhance collaboration between agents. Attendees will gain insights into different design patterns and practical considerations for building scalable and efficient agent-based solutions. The workshop concludes with a hands-on experience where participants will develop their own multi-agent application using leading AI orchestration frameworks. By the end of the session, attendees will have a strong conceptual foundation and practical experience in designing and deploying AI-powered multi-agent systems.\n\nLesson 1: Anatomy of an AI agent and agents evolution\nFamiliarize yourself with the concept of AI agents and its main components, understanding the evolution from pure rule-based agents to LLM-powered agents.\n\nLesson 2: Design and Implementation of Multi-Agents systems\n\nUnderstand the architecture and characteristics of multi-agent systems, including different workflows design and degree of autonomy.\n\nLesson 3: Build your multi-agent app\n\nHands-on! Build your multi-agent application leveraging some of the most popular AI orchestrators frameworks. \n\nUnderstand the fundamental components of an AI agent and its evolution from rule-based systems to LLM-powered agents.\nAnalyze the architecture and characteristics of multi-agent systems, including different design patterns and degrees of autonomy.\nExplore workflows for multi-agent collaboration and communication in AI-driven applications.\nLearn best practices for designing and implementing scalable multi-agent applications.\nGain hands-on experience in building a multi-agent system using AI orchestration frameworks.\nIdentify real-world use cases where AI multi-agents enhance efficiency and automation.","detailLink":"","difficulty":"Intermediate","displayStartTime":"10:30 AM - 11:30 AM ET","duration":"60","endTime":"11:30 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.mxzlbh9srfm7","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-valentina-alto-getting-started-with-multi-agents-applications","speakerCompany":"Microsoft","speakerName":"Valentina Alto","speakerTitle":"Technical Architect, AI & App","subtrack":"Workshop","talkTitle":"Getting Started with Multi-Agents applications","target":"","timeZone":"America/New_York","timerStartTime":"10:30:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"RAG","topicTag4":"Intermediate","track":"May 14","uniqueId":"BOS004","webinarLink":"https://streamyard.com/watch/bbNWQw9EG5Sy"},{"_id":"BOS022","_updatedAt":"2025-05-14T13:43:39.763Z","access":"Platinum","active":"yes","date":"2025-05-12","description":"Brian Kulis, PhD, Associate Professor | Boston University\nPrerequisites/Links:\nCode Notebooks: https://colab.research.google.com/drive/1IiONCYjDZgT2pOILr8X6bJqqKJsJ-NfE#scrollTo=auUVnYJLEVsM\n\n\nIn this bootcamp session, aimed at those new to the field, we will cover an overview of the rapidly-growing field of deep learning.  We will discuss the history of deep learning, the design of architectures for deep learning, training methods, the use of frameworks such as PyTorch for building deep learning models, and applications including audio, vision, and text.  No specific prerequisites are required, though familiarity with coding in languages such as Python is helpful.\n\nAttendees will learn how to build simple deep learning architectures in PyTorch.  They will also get an overview of different types of architectures and applications, and learn the basics about training these models.","detailLink":"","difficulty":"Beginner","displayStartTime":"12:30 PM - 02:30 PM ET","duration":"120","endTime":"2:30 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.320bu7awnvgj","slackUrl":"https://live.odsc.com/channel/mon-brian-kulis-introduction-to-deep-learning","speakerCompany":"Boston University","speakerName":"Brian Kulis, PhD","speakerTitle":"Associate Professor","subtrack":"Bootcamp","talkTitle":"Introduction to Deep Learning","target":"","timeZone":"America/New_York","timerStartTime":"12:30:00","topicTag1":"","topicTag2":"Multimodal & Deep Learning","topicTag3":"","topicTag4":"Beginner","track":"May 12","uniqueId":"BOS022","unlockable":true},{"_id":"BOS005","_updatedAt":"2025-05-14T13:43:39.725Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Aditya Palnitkar, Staff Software Engineer | Meta\nPrerequisites/Links:\n\nYou wouldn’t dream of deploying software without monitoring or unit testing. However, this is what regularly happens with LLM applications, even though their fickleness and fragility are well known problems.\nWhile testing is often seen as a drag on a software team’s productivity, especially in fast moving organisations, the exact opposite is true for LLMs and AI agents. \nGreat monitoring and eval can supercharge your development velocity. A good eval system can help you find the best ROI items to work on, and put together positive feedback loops in your iteration cycle.\nJoin me as I talk about how to put a world class eval system to work towards your LLM application. I’ll talk about intricacies and pitfalls involved in many parts of this process: \n\nGenerating human labelled high quality eval dataset, scaling this by using LLMs as a judge, using LLMs to simulate users for testing multi-turn scenarios for LLMs, creating benchmark datasets, creating eval systems for catching hallucinations through LLM judges, selecting metrics that closely align with your business goals, and monitoring failure modes in your AI agent through specialised datasets.","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"02:00 PM - 02:30 PM ET","duration":"30","endTime":"2:30 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-aditya-palnitkar-evals-for-supercharging-your-ai-agents ","speakerCompany":"Meta","speakerName":"Aditya Palnitkar","speakerTitle":"Staff Software Engineer","subtrack":"Talk","talkTitle":"Evals for Supercharging Your AI Agents","target":"","timeZone":"America/New_York","timerStartTime":"14:00:00","topicTag1":"","topicTag2":"AI Agents","topicTag3":"LLMs","topicTag4":"Beginner-Intermediate","track":"May 14","uniqueId":"BOS005","webinarLink":"https://streamyard.com/watch/bb7RHbRaENaM"},{"_id":"BOS023","_updatedAt":"2025-05-14T13:43:39.766Z","access":"General","active":"yes","date":"2025-05-14","description":"Sara Zanzottera, Senior Developer | BNP Paribas\nPrerequisites/Links:\n\nThe ability to perform complex reasoning is one of the basic requirements for truly intelligent AI models. A new generation of LLMs, such as the o1 and o3 family of models from OpenAI or DeepSeek’s new models, defied many experts’ expectations by smashing reasoning benchmarks designed with AGI in mind. However, these new models are still traditional LLMs at their core. \nWhat makes these models so different? How do they “reason”? What are the best usecases for them, and when is better to use a regular LLM such as GPT 4o or Llama? In this talk we will look beyond the hype, get an intuitive understanding of the way they work, and understand the pros and cons of this new crop of models.","detailLink":"","difficulty":"Intermediate","displayStartTime":"10:30 AM - 11:00 AM ET","duration":"30","endTime":"11:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-sara-zanzottera-llms-that-think-demystifying-reasoning-models","speakerCompany":"BNP Paribas","speakerName":"Sara Zanzottera","speakerTitle":"Senior Developer","subtrack":"Talk","talkTitle":"LLMs That Think: Demystifying Reasoning Models","target":"","timeZone":"America/New_York","timerStartTime":"10:30:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"Generative AI","topicTag4":"Intermediate","track":"May 14","uniqueId":"BOS023","webinarLink":"https://streamyard.com/watch/PrAmUpZGHzjQ"},{"_id":"BOS007","_updatedAt":"2025-05-14T13:43:39.727Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Laurie Voss, VP, Developer Relations | LlamaIndex\nPrerequisites/Links:\n\nAbstract: Agents are all the rage in 2025: they are the way to go beyond basic LLM question-and-answer patterns into an entirely new programming paradigm in which software is given an objective and a set of tools and figures out on its own how to achieve that goal. Agents can not only produce dramatically better, more accurate results in response to queries, but they can be integrated directly into software to accept structured input and take action \"\"\"\"under the hood\"\"\"\", without needing a \"\"\"\"chat\"\"\"\" interface at all.\n\nLlamaIndex is at the forefront of building real-world agentic applications, and in this session we'll show you how that's done. We'll start by running you through the most common design patterns for agentic applications including chaining, routing, parallelization, orchestrator-workers and evaluator-optimizers. We'll show you how these patterns can be implemented in LlamaIndex.\n\nYou'll learn how these patterns can be combined into larger agents and then into complex, multi-agent systems using LlamaIndex's built-in support for these systems. Then we'll dive deeper into one specific tool used by agents, Retrieval-Augmented Generation (RAG), and how it can be used to provide your agents with the real-time information they need to achieve the goals you set.\n\nBy the end of this session, you'll know:\n* how to build agents in LlamaIndex\n* how to combine agents into multi-agent systems\n* how to create arbitrarily powerful tools for use by your agents\n* how to provide real-time context to your agents with retrieval-augumented generation","detailLink":"","difficulty":"All Levels","displayStartTime":"02:35 PM - 03:05 PM ET","duration":"30","endTime":"3:05 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-laurie-voss-building-real-world-agentic-applications-with-llamaindex","speakerCompany":"LlamaIndex","speakerName":"Laurie Voss","speakerTitle":"VP, Developer Relations","subtrack":"Talk","talkTitle":"Building Real-World Agentic Applications with LlamaIndex","target":"","timeZone":"America/New_York","timerStartTime":"14:35:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"","topicTag4":"All Levels","track":"May 14","uniqueId":"BOS007","webinarLink":"https://streamyard.com/watch/bb7RHbRaENaM"},{"_id":"BOS024","_updatedAt":"2025-05-14T13:43:39.768Z","access":"General","active":"yes","date":"2025-05-15","description":"Patrick Staples, Principal Data Scientist and Engineer | COMPASS Pathways LLC\nPrerequisites/Links:\n\nWe present a framework for developing “virtual patients” to augment training for Mental Health Professionals (MHPs) with a process that is more scalable and systematic than current practice which relies on human role-play for the training and evaluation of patient interaction. We show how to combine large language models, retrieval-augmented personification (a novel variant of retrieval-augmented generation), and custom code-based logic to create a psychology engine that simulates realistic patient responses by emulating several key psychological mechanisms: short- and long-term memory, varying levels of conscious awareness about topics (as well as modulation of such awareness), and dynamic mood states where attitudes toward topics of conversation evolve over the course of the dialogue. We also describe algorithms for creating realistic patients with coherent symptom profiles and backstories. Taken together, these tools produce a realistic training partner for an MHP, enabling both training-at-scale as well as automated evaluation of specific skill sets. We discuss how our psychology engine framework makes training qualified MHPs more efficient and scalable, facilitates the continuing education needed as potential new treatments such as psychedelics emerge from clinical trials, and how the framework could be generalized to applications beyond MHP training. We also introduce an evaluation framework, in which generated transcripts demonstrate the enhanced capabilities of virtual patients as compared to approaches using system prompts alone. These comparisons comprise consistency of personas, coherence of memory across conversations, conversational realism, and compute efficiency.","detailLink":"","difficulty":"Intermediate","displayStartTime":"11:05 AM - 11:35 AM ET","duration":"30","endTime":"11:35 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-patrick-staples-building-virtual-patients-for-training-mental-health-professionals","speakerCompany":"COMPASS Pathways LLC","speakerName":"Patrick Staples","speakerTitle":"Principal Data Scientist and Engineer","subtrack":"Talk","talkTitle":"Building Virtual Patients for Training Mental Health Professionals","target":"","timeZone":"America/New_York","timerStartTime":"11:05:00","topicTag1":"","topicTag2":"AI for Biotech and Pharma","topicTag3":"Generative AI, LLMs, RAG, AI Agents","topicTag4":"Intermediate","track":"May 15","uniqueId":"BOS024","webinarLink":"https://streamyard.com/watch/rM9BUaHxJRXW"},{"_id":"BOS011","_updatedAt":"2025-05-14T13:43:39.730Z","access":"Premium","active":"yes","date":"2025-05-13","description":"Hugo Bowne-Anderson, PhD, Independent Data and AI Consultant | \nPrerequisites/Links:\n\nAbstract: This workshop is designed to equip software engineers with the skills to build and iterate on generative AI-powered applications. Participants will explore key components of the AI software development lifecycle through first principles thinking, including prompt engineering, monitoring, evaluations, and handling non-determinism. The session focuses on using multimodal AI models to build applications, such as querying PDFs, while providing insights into the engineering challenges unique to AI systems. By the end of the workshop, participants will know how to build a PDF-querying app, but all techniques learned will be generalizable for building a variety of generative AI applications.\n\nIf you're a data scientist, machine learning practitioner, or AI enthusiast, this workshop can also be valuable for learning about the software engineering aspects of AI applications, such as lifecycle management, iterative development, and monitoring, which are critical for production-level AI systems.\n\nThis workshop is designed to equip software engineers with the skills to build and iterate on generative AI-powered applications. Participants will explore key components of the AI software development lifecycle through first principles thinking, including prompt engineering, monitoring, evaluations, and handling non-determinism. The session focuses on using LLMs to build applications, such as querying PDFs, while providing insights into the engineering challenges unique to AI systems. By the end of the workshop, participants will know how to build a PDF-querying app, but all techniques learned will be generalizable for building a variety of generative AI applications.\n\nIf you're a data scientist, machine learning practitioner, or AI enthusiast, this workshop can also be valuable for learning about the software engineering aspects of AI applications, such as lifecycle management, iterative development, and monitoring, which are critical for production-level AI systems.\n\nWhat You'll Learn:\n\nHow to integrate AI models and APIs into a practical application.\nTechniques to manage non-determinism and optimize outputs through prompt engineering.\nHow to monitor, log, and evaluate AI systems to ensure reliability.\nThe importance of handling structured outputs and using function calling in AI models.\nThe software engineering side of building AI systems, including iterative development, debugging, and performance monitoring.\nPractical experience in building an app to query PDFs using multimodal models.\n\nWhat is Unique About This Session:\n\nThis workshop uniquely bridges the gap between software engineering and generative AI development. While most AI workshops focus solely on model usage or tuning, this session emphasizes the entire AI software lifecycle — from prompt engineering to monitoring and tracing. Participants will learn how to manage non-determinism and create production-ready AI applications, giving them the knowledge to tackle the software engineering challenges of AI-powered apps. The hands-on approach ensures that attendees walk away with practical skills and a functional app.\n\nWorkshop Prerequisite Knowledge:\n\nBasic programming knowledge in Python.\nFamiliarity with REST APIs.\nExperience working with Jupyter Notebooks or similar environments (preferred but not required).\nNo prior experience with AI or machine learning is required.\nMost importantly, a sense of curiosity and a desire to learn!\n\nIf you have a background in data science, ML, or AI, this workshop will help you understand the software engineering side of building AI applications.\n\nWe will introduce you to certain modern frameworks in the workshop but the emphasis be on first principles and using vanilla Python and LLM calls to build AI-powered systems.","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"10:00 AM - 12:00 PM ET","duration":"120","endTime":"12:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.g0zjmhjngyq4 ","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-hugo-bowne-anderson-building-llm-powered-applications-for-data-scientists-and-software-engineers","speakerCompany":"","speakerName":"Hugo Bowne-Anderson, PhD","speakerTitle":"Independent Data and AI Consultant","subtrack":"Workshop","talkTitle":"Building LLM-Powered Applications for Data Scientists and Software Engineers","target":"","timeZone":"America/New_York","timerStartTime":"10:00:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"","topicTag4":"Beginner-Intermediate","track":"May 13","uniqueId":"BOS011","webinarLink":"https://streamyard.com/watch/F6xy8FmUMmXi"},{"_id":"BOS025","_updatedAt":"2025-05-14T13:43:39.771Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Jay Sen, Director, Data Engineering | PayPal\nPrerequisites/Links:\n\nAbstract: As data volumes and business demands grows, traditional centralized data architectures are unable to scale for agility and speed. Data Mesh is a modern architectural paradigm that redefines how organizations produce, share, and consume data—by aligning data ownership with domain teams, treating data as a product, and enabling scalable self-service platforms under federated governance.\n\nThis 1-hour workshop is designed for data engineers looking to move beyond monolithic data platforms and explore the principles and practices of Data Mesh in real-world scenarios. Participants will gain a deep understanding of the four core principles—domain-oriented ownership, data as a product, self-serve infrastructure, and federated computational governance—and how they apply to designing and operating modern data platforms.\n\nThrough a mix of technical presentations and hands-on exercises, attendees will:\n1. Model domain-specific data model with ownership boundaries.\n2. Design and document and implement data products with real consumer needs using domain business events.\n3. Map out requirements for a self-serve data platform.\n4. Explore governance trade-offs and automation strategies.\n\nWhether you're building the next-gen data platform or modernizing existing pipelines, this workshop will help you apply Data Mesh patterns to increase autonomy, scalability, and data quality across your organization.","detailLink":"","difficulty":"Intermediate","displayStartTime":"03:05 PM - 04:05 PM ET","duration":"60","endTime":"4:05 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.xseg7i6bsyw7","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-jay-sen-applied-data-mesh-workshop-for-scalable-data-platforms","speakerCompany":"PayPal","speakerName":"Jay Sen","speakerTitle":"Director, Data Engineering","subtrack":"Workshop","talkTitle":"Applied Data Mesh Workshop for Scalable Data Platforms","target":"","timeZone":"America/New_York","timerStartTime":"15:05:00","topicTag1":"","topicTag2":"Data Engineering","topicTag3":"","topicTag4":"Intermediate","track":"May 14","uniqueId":"BOS025","webinarLink":"https://streamyard.com/watch/rDDbKnmgyRS6"},{"_id":"BOS012","_updatedAt":"2025-05-14T13:43:39.733Z","access":"General","active":"yes","date":"2025-05-13","description":"Yu Yu, PhD, Director of Data Science | BlackRock\nPrerequisites/Links:\n\nAs Gen AI technology improves in its performance and versatility, the industry practitioners are actively evaluating and building Gen AI solutions. In this talk, I will discuss the high-level use cases I observe in asset management industry, the approach business leaders use to make buy vs build decisions, as well as first-hand experience developing a co-pilot use case in a scalable fashion.","detailLink":"","difficulty":"All Levels","displayStartTime":"12:20 PM - 12:50 PM ET","duration":"30","endTime":"12:50 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-yu-yu-gen-ai-in-asset-management-use-cases-and-lessons-from-building-an-industry-specific-copilot","speakerCompany":"BlackRock","speakerName":"Yu Yu, PhD","speakerTitle":"Director of Data Science","subtrack":"Talk","talkTitle":"Gen AI in Asset Management: Use Cases and Lessons from Building an Industry-Specific Copilot","target":"","timeZone":"America/New_York","timerStartTime":"12:20:00","topicTag1":"","topicTag2":"Generative AI","topicTag3":"AI Engineering","topicTag4":"All Levels","track":"May 13","uniqueId":"BOS012","webinarLink":"https://streamyard.com/watch/qGTBtBcAj2ht"},{"_id":"BOS026","_updatedAt":"2025-05-14T13:43:39.774Z","access":"General","active":"yes","date":"2025-05-15","description":"Michelle Yi, Board Member | Women In Data\nPrerequisites/Links:\n\nThe increasing deployment of generative AI models in production environments introduces new security challenges, particularly in the realm of adversarial attacks. While visually or textually subtle, these attacks can manipulate generative models, leading to harmful consequences such as medical misdiagnoses from tampered images or the spread of misinformation through compromised chatbots. This talk examines the vulnerabilities of generative models in production settings and explores potential defenses against adversarial attacks. Drawing on insights from attacks against Vision-Language Pre-training (VLP) models, which are a key component in text-to-image and text-to-video models, this talk highlights the importance of understanding cross-modal interactions and leveraging diverse data for crafting robust defenses.","detailLink":"","difficulty":"All Levels","displayStartTime":"11:40 AM - 12:10 PM ET","duration":"30","endTime":"12:10 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-michelle-yi-introduction-to-adversarial-attack-and-defense","speakerCompany":"Women In Data","speakerName":"Michelle Yi","speakerTitle":"Board Member","subtrack":"Talk","talkTitle":"Introduction to Adversarial Attack and Defense","target":"","timeZone":"America/New_York","timerStartTime":"11:40:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"","topicTag4":"All Levels","track":"May 15","uniqueId":"BOS026","webinarLink":"https://streamyard.com/watch/rM9BUaHxJRXW"},{"_id":"BOS013","_updatedAt":"2025-05-14T13:43:39.735Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Chi Wang, PhD, Founder of AutoGen (Now AG2) | Senior Staff Research Scientist | Google DeepMind\nPrerequisites/Links:\n\nSession Objective: 1. Use practical implementations to demonstrate AI agents in action; 2. Illustrate cutting-edge AI agent applications that seamlessly integrate multiple agents powered by models from OpenAI, Anthropic, Gemini, and open-weight providers, and a diverse range of tools; 3. Explain how to contribute to the thriving AI agent ecosystem.\n\nLearning Outcomes: 1. Understand the agent-oriented programming concepts; 2. Able to construct effective multi-agent systems to solve complex tasks. 3. Reach production-readiness 10x faster.\n\nTarget Industry: 1. Industries that require deep research, such as finance, healthcare, science & engineering. 2. Industries involving customer support, such as e-commerce, education, social media; 3. Industries involving heavy software design & development, such as gaming, web, data engineering.\n\nResearch/Analysis/Science use cases: Deep Research Agent, SciAgents, Financial Analysis\nCustomer-oriented use cases: Travel Planner, Order Management, Realtime ToDo Assistant, Social Media Management, Youth Helper.\nSoftware-oriented use cases: Game Design Agents, Web Agent, Software Testing Agent\n\nLearn basic and advanced agentic design patterns in AG2: 1. Customized GroupChat; 2. Code execution; 3. Deep Research Agent; 4. Swarm; 5. Tool using; 6. Async chats; 7. Dynamic instructions; 8. Realtime Agent; 9. GraphRAG; 10. Structured Output","detailLink":"","difficulty":"All Levels","displayStartTime":"12:40 PM - 1:40 PM ET","duration":"60","endTime":"1:40 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.xzqohmofs54q","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-chi-wang-build-with-ag2-open-source-agentos","speakerCompany":"Google DeepMind","speakerName":"Chi Wang, PhD","speakerTitle":"Founder of AutoGen (Now AG2) | Senior Staff Research Scientist","subtrack":"Tutorial","talkTitle":"Build with AG2: Open-Source AgentOS","target":"","timeZone":"America/New_York","timerStartTime":"12:40:00","topicTag1":"","topicTag2":"AI Agents","topicTag3":"AI Engineering","topicTag4":"All Levels","track":"May 14","uniqueId":"BOS013","webinarLink":"https://streamyard.com/watch/bbNWQw9EG5Sy"},{"_id":"BOS027","_updatedAt":"2025-05-14T13:43:39.776Z","access":"Platinum","active":"yes","date":"2025-05-12","description":"Martin Musiol, Founder, CEO | GenerativeAI.net\nPrerequisites/Links:\n\nJump into AI product creation with this 2-hour hands-on workshop! We'll guide you through a straightforward two-step process. First, we'll quickly build a basic working version (think: rough draft) of an AI product using handy tools like Bolt.new, ChatGPT, Anthropic, Vercel, and Lovable. Next, we'll refine and polish that initial version using AI-assisted coding tools like Cursor to make it even better. You'll get to build a functional AI product – maybe a chatbot or a content generator – right from the beginning, using some of the latest AI tools. This session is great for developers and innovators wanting practical experience. You'll walk away with not just a working AI prototype, but also real skills and ideas you can use immediately in the world of AI.\n\nOutline:\n1. Getting Started & Basic Ideas (40 minutes)\n\nWhat We're Doing & Why (10 min): Briefly cover how AI is changing product development and introduce our simple two-step building approach.\nMeet the Tools (20 min): We'll introduce the tools for the first build step (Bolt.new, ChatGPT, Anthropic, Vercel, Lovable) and the tool for the polishing step (Cursor). We’ll explain what each is good for and how they fit into our plan.\nOur Game Plan (10 min): Clearly outline the 'build a rough version first, then polish it' method. Set the stage for what you'll see in the live demos.\n2. Step 1: Building the First Draft (Live Demo) (40 minutes)\n\nWatch & Learn - Building (35 min): Follow along as we build a basic AI product (like a simple chatbot) using tools like Bolt.new, ChatGPT/Anthropic, and Vercel/Lovable. We’ll explain the choices made along the way. Feel free to follow along on your own machine, but it's optional!\nQuick Questions (5 min): Address immediate questions about this first building step. (Note: We'll keep the pace moving, no long pauses for everyone to catch up on building).\n3. Step 2: Polishing the Product (Live Demo) (30 minutes)\n\nWatch & Learn - Refining (25 min): Now, we take that basic product and use Cursor to improve it – maybe tweaking the AI's responses, adding small features, or making it run better. The focus is on showing how to refine. Optional follow-along again.\nQuick Questions (5 min): Time for brief questions specifically about the polishing process.\n4. Wrapping Up (10 minutes)\n\nKey Things to Remember (7 min): Recap the two-step process (basic build -> polish), remind everyone what the main tools are good for, and suggest next steps for continuing to build AI products.\nFinal Words (3 min): Share some useful resources and encourage everyone to keep experimenting after the workshop.\n\nBy the end of this 2-hour session, participants will be able to:  \nUnderstand the Role of AI in Product Development: Grasp how AI agents, specifically ChatGPT, and deployment platforms like Vercel, transform modern product creation.  \n\nMaster a Two-Step Development Process: Comprehend the coarse-grained development approach using ChatGPT for rapid AI prototyping, followed by fine-tuning and deployment with Vercel for polished, functional products.  \n\nExplore ChatGPT’s Capabilities: Learn how to leverage ChatGPT for generating intelligent features (e.g., conversational logic, content creation) through detailed demonstrations and practical insights.  \n\nUtilize Vercel for AI Integration: Gain knowledge of Vercel’s deployment tools to host, scale, and refine ChatGPT-powered applications, with a focus on streamlined workflows.  \n\nApply Techniques Independently: Acquire actionable strategies and best practices to experiment with ChatGPT and Vercel post-workshop, inspired by in-depth live examples.","detailLink":"","difficulty":"All Levels","displayStartTime":"10:00 AM - 12:00 PM ET","duration":"120","endTime":"12:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.rv334p6thb77","slackUrl":"https://live.odsc.com/channel/mon-martin-muisol-the-age-of-ai-agents-and-product-development","speakerCompany":"GenerativeAI.net","speakerName":"Martin Musiol","speakerTitle":"Founder, CEO","subtrack":"Bootcamp","talkTitle":"The Age of AI Agents and Product Development","target":"","timeZone":"America/New_York","timerStartTime":"10:00:00","topicTag1":"","topicTag2":"AI Agents","topicTag3":"Generative AI, LLMs&RAG, Multimodal Learning, AI Engineering","topicTag4":"All Levels","track":"May 12","uniqueId":"BOS027","unlockable":true},{"_id":"BOS014","_updatedAt":"2025-05-14T13:43:39.738Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Dr. Guillaume Lajoie, Associate Professor  | Core Member | Université de Montréal | Mila, the Québec AI Institute\nPrerequisites/Links:\n\nIn this talk, I will present recent progress toward building AI foundation models for neuroscience. Much like large language models have done for text, neuro-foundation models aim to capture general and universal patterns of neural activity from different acquisition modalities, across brain regions, tasks, and even species. The learned representations can then be used to fine tune for varied tasks from diagnostic assistance, to machine learning tools for neuro-technology. I will discuss how such foundation models are poised to assist various area of healthcare.","detailLink":"","difficulty":"Intermediate","displayStartTime":"03:10 PM - 03:40 PM ET","duration":"30","endTime":"3:40 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-guillaume-lajoie-foundation-models-for-neuroscience-uncovering-universal-neural-patterns-for-many-uses","speakerCompany":"Université de Montréal | Mila, the Québec AI Institute","speakerName":"Dr. Guillaume Lajoie","speakerTitle":"Associate Professor  | Core Member","subtrack":"Talk","talkTitle":"Foundation Models For Neuroscience: Uncovering Universal Neural Patterns for Many Uses","target":"","timeZone":"America/New_York","timerStartTime":"15:10:00","topicTag1":"","topicTag2":"AI for Biotech and Pharma","topicTag3":"LLMs","topicTag4":"Intermediate","track":"May 14","uniqueId":"BOS014","webinarLink":"https://streamyard.com/watch/bb7RHbRaENaM"},{"_id":"BOS028","_updatedAt":"2025-05-14T13:43:39.779Z","access":"General","active":"yes","date":"2025-05-15","description":"Vincent Granville, Co-founder & AI Lead | BondingAI.io\nPrerequisites/Links:\n\nI discuss why and how to build from scratch a RAG/LLM system for enterprise, without GPU or deep neural networks. Topics include accuracy, security, speed, scalability, no hallucination, exhaustivity in the prompt results, model evaluation issues, as well as real-time fine-tuning with intuitive parameters, self-tuning, efficient crawling to retrieve and leverage the underlying contextual elements, hierarchical chunking, token types, un-stemming, problems and workarounds when using Python libraries. The case study features the Nvidia corpus of public financial reports available as PDFs. Finally, I show how to design a great UI far more useful than a prompt box, an efficient backend database architecture, how to deal with various corpuses (Web, database, PDFs), multimodality, back-end agents that the user can select from the UI, sub-LLMs, and how to design your LLM to minimize prompt engineering.\n\nKey components in the next generation of LLMs for enterprise: understand their roles and how they interact, and how to build them. ","detailLink":"","difficulty":"All Levels","displayStartTime":"10:30 AM - 11:00 AM ET","duration":"30","endTime":"11:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-vincent-granville-from-10-terabytes-to-zero-parameter-the-llm-2-revolution","speakerCompany":"BondingAI.io","speakerName":"Vincent Granville","speakerTitle":"Co-founder & AI Lead","subtrack":"Talk","talkTitle":"From 10 Terabytes to Zero Parameter: The LLM 2.0 Revolution","target":"","timeZone":"America/New_York","timerStartTime":"10:30:00","topicTag1":"","topicTag2":"LLMs&RAG","topicTag3":"","topicTag4":"All Levels","track":"May 15","uniqueId":"BOS028","webinarLink":"https://streamyard.com/watch/rM9BUaHxJRXW"},{"_id":"BOS029","_updatedAt":"2025-05-14T13:43:39.781Z","access":"Premium","active":"yes","date":"2025-05-15","description":"Rami Krispin, Senior Manager - Data Science and Engineering  | Apple\nPrerequisites/Links:\n\nThe rapid development of natural language models, especially Large Language Models (LLMs), has presented numerous possibilities for various fields. One of the most common applications is using LLMs for coding. For instance, OpenAI’s chatGPT, Anthropic Claude, Meta’s Code LLAMA, and Google Gemini are LLMs that offer state-of-the-art natural language to code generators. \n\nOne potential use case is a natural language to SQL code generator, which could assist non-technical professionals with simple data requests and enable the data teams to focus on more data-intensive tasks. This tutorial focuses on setting up a language to SQL code generator using the LLM API.\n\nIn this workshop, we will review the steps of setting up a system that enables users to interact with databases and ask questions using natural language. We will start with system design and implement this process with Python.\n\nBy the end of this session, you will:\n- Understand how LLMs can be used to bridge the gap between natural language and structured data queries\n- Learn how to set up prompts for creating SQL code\n- Learn how to functionalize and connect the code generator with an SQL database\n\n(1) Problem statement - we will start with the motivation for setting up a SQL code generator, review different use cases, and introduce a general system design.\nLearning objectives:\n- Learners will understand the use cases of using LLMs to create language to SQL code generator\n- Learners will review the general system design \n(2) Prompt engineering - review the foundation of prompt engineering and how to set templates for creating SQL code\nLearning objectives:\n- Learners will understand how to interact with LLM using prompt\n- Learners will learn the level of prompt context required to improve the quality of the results\n(3) Functionlize the process - connect all the dots and set up a Python function that receives questions, sets up prompts, and sends a GET request to the LLM to generate SQL code and use the code to query the database.\n- Learning objectives:\n- Learners will understand how to functionalize the process and see a real-life example\n\nThis workshop is based on the following repository:\nhttps://github.com/RamiKrispin/lang2sql","detailLink":"","difficulty":"All Levels","displayStartTime":"02:00 PM - 03:00 PM ET","duration":"60","endTime":"3:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.y3vzai8wth2j","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-rami-krispin-using-llm-to-query-data","speakerCompany":"Apple","speakerName":"Rami Krispin","speakerTitle":"Senior Manager - Data Science and Engineering ","subtrack":"Workshop","talkTitle":"Using LLM to Query Data","target":"","timeZone":"America/New_York","timerStartTime":"14:00:00","topicTag1":"","topicTag2":"LLMs&RAG","topicTag3":"Generative AI , LLMOps & MLOps, Data Engineering","topicTag4":"All Levels","track":"May 15","uniqueId":"BOS029","webinarLink":"https://streamyard.com/watch/ne2DwZyR3ZEP"},{"_id":"BOS015","_updatedAt":"2025-05-14T13:43:39.741Z","access":"Premium","active":"yes","date":"2025-05-13","description":"Abi Aryan, Founder | Abide AI\nPrerequisites/Links:\n\nIn this session, we will explore best practices for monitoring and debugging LLM pipelines for high-quality and trustworthy outputs. We will break down key observability components, including data drift detection, prompt response monitoring, latency tracking, and model performance evaluation. Attendees will gain insights into implementing structured logging, distributed tracing, and anomaly detection tailored to LLM architectures.\n\nBy the end of this session, attendees will be able to:\n\n1. Identify common failure modes in LLM pipelines and how to mitigate them.\n2. Implement monitoring strategies to detect hallucinations, degraded performance, and ethical risks.\n3. Use observability toolsand custom logging frameworks to improve model reliability.\n4. Design feedback loops for continuous evaluation and improvement in production environments.\n\nThis talk is ideal for ML/AI engineers and LLMOps practitioners working with LLMs in production. Whether you're building chatbots, retrieval-augmented generation (RAG) systems, or enterprise AI applications, this session will equip you with the right observability techniques to maintain trustworthy and high-performing models at scale.\nTools used:-\n\nLangSmith – for prompt debugging, dataset evaluation, and model tracing.\nMLflow – for experiment tracking and model performance comparison.\nPrometheus & Grafana – for real-time monitoring and alerting on model performance metrics.","detailLink":"","difficulty":"Intermediate-Advanced","displayStartTime":"11:05 AM - 12:05 PM ET","duration":"60","endTime":"12:05 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.ej4mmz5pduox","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-abi-aryan-debugging-and-monitoring-llms-in-production","speakerCompany":"Abide AI","speakerName":"Abi Aryan","speakerTitle":"Founder","subtrack":"Workshop","talkTitle":"Debugging and Monitoring LLMs in Production","target":"","timeZone":"America/New_York","timerStartTime":"11:05:00","topicTag1":"","topicTag2":"LLMOPs& MLOPs","topicTag3":"","topicTag4":"Intermediate-Advanced","track":"May 13","uniqueId":"BOS015","webinarLink":"https://streamyard.com/watch/5HcGGAsgssVp"},{"_id":"BOS030","_updatedAt":"2025-05-14T13:43:39.784Z","access":"Premium","active":"yes","date":"2025-05-15","description":"Jun He, Staff Software Engineer | Netflix\nPrerequisites/Links:\n\nAt Netflix, Data/ML pipelines are essential to our business and are widely used for diverse use cases beyond recommendations, experimentation, predictions, and data transformations. As big data and ML have become more prevalent and impactful, the scalability, reliability, and usability of the orchestration ecosystem have increasingly become more important for our data engineers, analysts, scientists, and the company. To better serve various business needs at Netflix, we developed Maestro, a new workflow orchestrator that greatly improves the usability and scalability of the orchestration system and boosts the productivity of the engineers working with data. \n\nMaestro, now publicly available at https://github.com/Netflix/maestro, provides end users with a consistent way to define, execute, and monitor data pipelines and ML workflows to process data and train ML/AI models. Unlike traditional workflow orchestrators that only support Directed Acyclic Graphs (DAGs), Maestro supports both acyclic and cyclic workflows and also includes multiple reusable patterns, including foreach loops, subworkflows, and conditional branches, etc.\n\nIn this tutorial, we will dive deep into the publicly available features of Maestro. We will share how we built our distributed orchestration system to support running super-large-scale workflows, consisting of hundreds of thousands of jobs with nested structures. We will go over the patterns that our data engineers have built using Maestro features and show examples of those maestro workflows. We will discuss how Maestro is designed to provide a loose coupling between user workflows and the data platform infrastructure. Additionally, we will demonstrate how extensible Maestro is to support new use cases using modern technologies, e.g., Docker containers, Jupyter notebooks, event-based scheduling, etc.\n\nModule 1: Introduction to Maestro\nModule 2: Review of Data and ML Workflow Patterns\nModule 3: Demo of Maestro Engine\n\nThe attendees will learn what Maestro is and what features it provides. They will also learn how to set up Maestro locally and be able to run workflows for the Maestro open-source project locally (https://github.com/Netflix/maestro).\n\nKnow the workflow orchestration. Better to take a look at the Maestro open-source project (https://github.com/Netflix/maestro) before the tutorial.","detailLink":"","difficulty":"Intermediate","displayStartTime":"03:05 PM - 04:05 PM ET","duration":"60","endTime":"4:05 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.ol1391nb30h0","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-jun-he-maestro-netflixs-dataml-workflow-orchestrator","speakerCompany":"Netflix","speakerName":"Jun He","speakerTitle":"Staff Software Engineer","subtrack":"Tutorial","talkTitle":"Maestro: Netflix’s Data/ML Workflow Orchestrator","target":"","timeZone":"America/New_York","timerStartTime":"15:05:00","topicTag1":"","topicTag2":"Data Engineering","topicTag3":"Machine Learning","topicTag4":"Intermediate","track":"May 15","uniqueId":"BOS030","webinarLink":"https://streamyard.com/watch/ne2DwZyR3ZEP"},{"_id":"BOS016","_updatedAt":"2025-05-14T13:43:39.744Z","access":"Premium","active":"yes","date":"2025-05-15","description":"Paul Iusztin, Senior AI Engineer / Founder | Decoding ML\nPrerequisites/Links:\n\nBuilding proof-of-concept LLM/RAG apps is easy—we know that. The next step, which consumes the most time and is the most challenging, is bringing the app to a production-ready level. You must increase accuracy, reduce latency and costs, and create reproducible results.\n\nYou must start optimizing your LLM and RAG layers to ensure compliance with all these requirements. You must begin digging into open-source LLMs, fine-tuning LLMs for your specialized tasks, optimizing them for inference, and so on.\n\nHowever, before optimizing anything, you must first determine what to optimize. Thus, you must quantify your system's key metrics (e.g., latency, costs, accuracy, recall, hallucinations, etc.).\n\nThus, as developing AI applications is an iterative process, the first critical step to getting to production is learning how to evaluate and monitor your LLM/RAG applications. The best strategy is to build something simple end-to-end, attach an evaluation layer on top of it, and then quickly iterate in the right direction by clearly indicating what needs improvement.\n\nThus, this workshop will focus on evaluating LLM/RAG apps. We will take a simple, predefined agentic RAG system built in LangGraph and understand how to evaluate and monitor it.\n\nTo do that, we will explore the following topics:\n\nAdd a prompt monitoring layer.\nVisualize the quality of the embeddings.\nEvaluate the context from the retrieval step used for RAG.\nCompute application-level metrics to expose hallucinations, moderation issues, and performance (using LLM-as-judges).\nLog the metrics to a prompt management tool to compare the experiments.","detailLink":"","difficulty":"Intermediate","displayStartTime":"10:30 AM - 11:30 AM ET","duration":"60","endTime":"11:30 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.ev4r2sctydki","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-paul-iusztin-llm-rag-evaluation-playbook-for-production-apps","speakerCompany":"Decoding ML","speakerName":"Paul Iusztin","speakerTitle":"Senior AI Engineer / Founder","subtrack":"Workshop","talkTitle":"LLM & RAG Evaluation Playbook for Production Apps","target":"","timeZone":"America/New_York","timerStartTime":"10:30:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"Generative AI","topicTag4":"Intermediate","track":"May 15","uniqueId":"BOS016","webinarLink":"https://streamyard.com/watch/HeyppKwfsydH"},{"_id":"BOS031","_updatedAt":"2025-05-14T13:43:39.786Z","access":"Premium","active":"yes","date":"2025-05-13","description":"Atul Kulkarni, Engineering Manager | Amazon\nLakshmithejaswi Narasannagari, Software Engineer | Amazon\nPrerequisites/Links:\n\nAs AI becomes prevalent and pervasive across the industry, retooling of existing workforce to leverage AI has become a challenge for organizations. In order to leverage AI in their day to day life, the workforce needs to understand the lay of the land and methodologies to build applications with AI. This hands-on workshop offers a comprehensive journey through the complete anatomy of an AI application, focusing on cutting-edge technologies Large Language Models (LLMs) and AI Agents. Participants will gain practical experience developing sophisticated AI solutions, from initial concept to final implementation, applied to real-world tasks. \n\nThe hands-on workshop will cover:\n\nSystem Overview: Understanding the entire lifecycle of AI application development\nAI Components: Exploring the core building blocks of advanced AI systems\nPrompt Engineering: Mastering basic and advanced techniques for effective AI interaction. Retrieval Augmented Generation (RAG): Implementing strategies to enhance AI output with external knowledge\nAgentic Architecture Basics: Designing and deploying AI agents for complex task execution\n\nThis workshop does not require AI proficiency and is ideal for data scientists, AI engineers, Developers, Product Managers, and Senior Executives seeking to expand their skills in the rapidly evolving field of AI application development. Participants will leave with practical knowledge and hands-on experience in building state-of-the-art AI solutions using the latest Generative AI, LLMs, and AI agent techniques. This workshop will lay solid foundations for the audience to explore various contours of AI backed application development.\n\nKey TakeAways:\n- Conceptualize and design AI applications addressing real-world challenges\n- Develop effective prompts for optimal AI performance\n- Integrate RAG techniques to improve AI responses \n- Create basic AI agents that are capable of problem-solving","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"01:45 PM - 02:45 PM ET","duration":"60","endTime":"2:45 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.6olw8lpx9st","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-atul-kulkarni-lakshmithejaswi-narasannagari-from-concept-to-creation-building-advanced-ai-applications-with-llms-and-ai-agents","speakerCompany":"Amazon","speakerName":"Atul Kulkarni\nLakshmithejaswi Narasannagari","speakerTitle":"Engineering Manager\nSoftware Engineer","subtrack":"Workshop","talkTitle":"From Concept to Creation: Building Advanced AI Applications with LLM’s and AI Agents","target":"","timeZone":"America/New_York","timerStartTime":"13:45:00","topicTag1":"","topicTag2":"AI Agents","topicTag3":"LLMs","topicTag4":"Beginner-Intermediate","track":"May 13","uniqueId":"BOS031","webinarLink":"https://streamyard.com/watch/jF8Q8UmKsGGv"},{"_id":"BOS032","_updatedAt":"2025-05-14T13:43:39.789Z","access":"General","active":"yes","date":"2025-05-13","description":"Sonam Saxena, Product Manager | Meta\nPrerequisites/Links:\n\nTraditional A/B testing methods can be resource-intensive, as each experiment requires its own control group. In this talk, we introduce the concept of shared control groups in A/B testing, which allows multiple experiments to share a common control group while preserving statistical power and confidence intervals. This approach can significantly boost experimentation throughput, enabling organizations to to test more ideas in less time. We present the theoretical framework for shared control groups and demonstrate how it has helped in dramatically increasing experimentation throughput at Meta.","detailLink":"","difficulty":"Intermediate","displayStartTime":"11:45 AM - 12:15 PM ET","duration":"30","endTime":"12:15 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-sonam-saxena-boosting-experimentation-throughput-efficiency","speakerCompany":"Meta","speakerName":"Sonam Saxena","speakerTitle":"Product Manager","subtrack":"Talk","talkTitle":"Boosting Experimentation Throughput & Efficiency","target":"","timeZone":"America/New_York","timerStartTime":"11:45:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"LLMOps & MLOps","topicTag4":"Intermediate","track":"May 13","uniqueId":"BOS032","webinarLink":"https://streamyard.com/watch/qGTBtBcAj2ht"},{"_id":"BOS033","_updatedAt":"2025-05-14T13:43:39.791Z","access":"General","active":"yes","date":"2025-05-13","description":"J. Doyne Farmer, PhD,  | \nPrerequisites/Links:\n\nAbstract: Amid all the hubbub about the advances in machine learning, agent-based modeling (ABM) has been making steady progress and is beginning to be used for more practical applications in economics and elsewhere.  ABM has some inherent advantages because it incorporates strong priors about the causal structure of the world, and therefore can work with less data, and it is more suited for situations where counterfactual analysis is needed (like examining proposed policies).  Modern ABM also uses AI in several different ways -- they make good partners.  I will present some successes of ABM in economics and mention some projects in motion, including a literal 1:1 scale model of global energy generation and a global macromodel built from the bottom up.","detailLink":"","difficulty":"All Levels","displayStartTime":"09:30 AM - 09:55 AM ET","duration":"25","endTime":"9:55 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-j-doyne-farmer-ai-and-abm-in-economics","speakerCompany":"University of Oxford","speakerName":"J. Doyne Farmer, PhD","speakerTitle":"Professor of Complex Systems Science","subtrack":"Keynote","talkTitle":"AI and Agent Based Models in Economics","target":"","timeZone":"America/New_York","timerStartTime":"09:30:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"All Levels","track":"May 13","uniqueId":"BOS033","webinarLink":"https://streamyard.com/watch/qGTBtBcAj2ht"},{"_id":"BOS034","_updatedAt":"2025-05-14T13:43:39.794Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\nPrerequisites/Links- \n\nRefer Slides for Exercise Links - https://bit.ly/3xF6gXo\n\nData Primer Course Excel Sheet - https://bit.ly/4aKYmuk\n\n\nData is the essential building block of Data Science, Machine Learning, and AI. This course is the first in the series and is designed to teach you the foundational skills and knowledge required to understand, work with, and analyze data. It covers topics such as data collection, organization, profiling, and transformation as well as basic analysis. This course is aimed at helping people begin their AI journey and gain valuable insights that we will build up in subsequent SQL, programming, and AI courses.\nContinuing the journey, the course covers essential topics such as Generative AI and Chat GPT definitions, prompting, and vectors. Participants will explore the principles and applications of generative models, gaining hands-on experience with prompting techniques and vector representations. \n\nDuration: ~ 2 hours 15 min","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.71i1fm5i3d14","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Data and Generative AI Literacy","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS034","unlockable":true},{"_id":"BOS035","_updatedAt":"2025-05-14T13:43:39.796Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\nPrerequisites/Links:\n\nSlides - https://bit.ly/3w3x3MQ\n\nExercise Links available on slides - \nKaggle - https://bit.ly/3W7FbGr\n\nOnline Server and Ciient - https://bit.ly/3U6fnrF\n\nHands-on Exercise-  https://bit.ly/3QaZTBN\n\nW3 TrySQL Client - https://bit.ly/3QaZTBN\n\nServer Postgres.app - https://bit.ly/3UaKqCU\n\nClient pgadmin4 - https://bit.ly/3U00w24\n\nGithub link to Data Wrangling with SQL - https://bit.ly/3w3xcjm\n\nNorthwind.sql - https://bit.ly/4b35Ng7\n\nWikipedia - https://bit.ly/4b4786l\n\n\nThis SQL coding course teaches students the basics of Structured Query Language, which is a standard programming language used for managing and manipulating data and an essential tool in AI.  The course covers topics such as database design and normalization, data wrangling, aggregate functions, subqueries, and join operations, and students will learn how to design and write SQL code to solve real-world problems. Upon completion, students will have a strong foundation in SQL and be able to use it effectively to extract insights from data.\n\nThe ability to effectively access, retrieve, and manipulate data using SQL is essential for data cleaning, pre-processing, and exploration, which are crucial steps in any data science or machine learning project. Additionally, SQL is widely used in industry, making it a valuable skill for professionals in the field. This course builds upon the earlier data course in the series.\n\nDuration: ~ 2 hours\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.9d2a7sbs3zi1","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Data Wrangling with SQL\n","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS035","unlockable":true},{"_id":"BOS036","_updatedAt":"2025-05-14T13:43:39.799Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\nPrerequisites: \n\nNotebooks for the session - https://bit.ly/4ddSufg \n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nSlides - https://bit.ly/4d7NUyU \n\n\nThe Python language is one of the most popular programming languages in data science and machine learning as it offers a number of powerful and accessible libraries and frameworks specifically designed for these fields. This programming course is designed to give participants a quick introduction to the basics of coding using the Python language.\nIt covers topics such as data structures, control structures, functions, modules, and file handling. This course aims to provide a basic foundation in Python and help participants develop the skills needed to progress in the field of data science and machine learning.\n\nDuration: ~ 2 Hrs","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.xl8b0ktcw5a4","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Programming with Python\n","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS036","unlockable":true},{"_id":"BOS037","_updatedAt":"2025-05-14T13:43:39.802Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\n\nRefer Slides for Embedded Links: https://bit.ly/44Az6qA \n\n\nThis Introduction to AI course is designed to introduce participants to the basics of artificial intelligence (AI) and machine learning. We will first explore the various types of AI and then progress to understand fundamental concepts such as algorithms, features, and models. We will study the machine learning workflow and how it is used to design, build, and deploy models that can learn from data to make predictions. This will cover model training and types of machine learning including supervised, and unsupervised learning, as well as some of the most common models such as regression and k-means clustering. \n\nUpon completion, individuals will have a foundational understanding of machine learning and its capabilities and be well-positioned to take advantage of introductory-level hands-on training in machine learning and data science such as ODSC Mini-Bootcamp.\n\nDuration ~ 2 Hours\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.5p79kx2qoolj","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Introduction to AI","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS037","unlockable":true},{"_id":"BOS038","_updatedAt":"2025-05-14T13:43:39.804Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Mary Moesta , ODSC Instructor\n\nWorkshop Assets\nThis course consists of an on-demand recording, course notebook, and course exercises. Before accessing the course code notebooks it is advisable to review the course prerequisites here.\n\nPrerequisites/Links:\n\nCourse Notebooks on Google Drive\n\nhttps://bit.ly/3Ju1zlU\n\nIf you have a google account just double click to run the notebook on Colab. Otherwise please download and run in your favorite Jupyter Notebook environment. Please see the guidelines below:\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n \n\nWelcome to the Introduction to NLP workshop! In this workshop, you will learn the fundamentals of Natural Language Processing. From tokenization and stop word removal to advanced topics like deep learning and large language models, you will explore techniques for text preprocessing, word embeddings, classic machine learning, and cutting-edge NLP methods. Get ready to dive into the exciting world of NLP and its applications! \n\nDuration ~ 97 min\n\n\nThis is a 7-part course and topics include\n\nTokenization and Stop Word Removal\nStemming and Lemmatization\nCounting-Based Embeddings\nNeural Network-Based Embeddings\nClassic Machine Learning in NLP\nDeep Learning for NLP\nLarge Language Models\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.o3zcjoaumqza","slackUrl":"","speakerCompany":"","speakerName":"Mary Moesta","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Introduction to NLP","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS038","unlockable":true},{"_id":"BOS039","_updatedAt":"2025-05-14T13:43:39.806Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\nPrerequisites/Links-\nThis is a hands-on course that utilizes Jupyter Notebooks. The link below will allow you to either download the notebooks or run them directly if you have a Google Colab account, which you can sign up for free (see Guidelines document below)\n\nThe Google Drive to run the notebooks on Colab is here:\nbit.ly/3EHzrNE \n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nSlides: https://bit.ly/433oii2 \n\nData prep is the cornerstone of any data-driven project, and Python stands as one of the most powerful tools in this domain. In preparation for the ODSC conference, our specially designed course on “Machine Learning Data Prep with Python” offers attendees a hands-on experience to master the essential techniques. From cleaning and transforming raw data to making it ready for analysis, this course will equip you with the skills needed to handle real-world data challenges.\n\nDuration ~ 2.5 Hours\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.ad8f9otvkcrk","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Machine Learning Data Prep with Python","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS039","unlockable":true},{"_id":"BOS040","_updatedAt":"2025-05-14T13:43:39.809Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\nPrerequisites/Links-\nThis is a hands-on course that utilizes Jupyter Notebooks. The link below will allow you to either download the notebooks or run them directly if you have a Google Colab account, which you can sign up for free (see Guidelines document below)\n\nThe Google Drive to run the notebooks on Colab is here:\nhttps://bit.ly/43lONAJ \n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nRefer slides for embedded links - https://bit.ly/3Su78Fp \nJoin us for a comprehensive session delving into the fundamental concepts of Machine Learning (ML). Designed for beginners, this course provides a solid introduction to essential ML principles, techniques, and best practices.\n\nKey Takeaways:\n\nGain a foundational understanding of ML concepts and techniques.\nLearn practical skills for data collection, profiling, and visualization.\nExplore different types of ML models and when to use them.\nUnderstand the importance of feature selection, target selection, and model evaluation in ML projects.\n\n\n\nDuration ~ 2.5 Hours\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.cwm8qktjc0v9","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Introduction to Machine Learning","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS040","unlockable":true},{"_id":"BOS041","_updatedAt":"2025-05-14T13:43:39.811Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\nPrerequisites/Links-\n\nThis is a hands-on course that utilizes Jupyter Notebooks. The link below will allow you to either download the notebooks or run them directly if you have a Google Colab account, which you can sign up for free (see Guidelines document below)\n\nNotebook for Intro to LLMs - https://bit.ly/3U9Ts2L\n\nNotebook for Intro to Prompt Engineering - https://bit.ly/3JtUQZk\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nRefer slides for embedded links - https://bit.ly/4b5o9gq\n\nIn this session, participants will embark on a journey into the architecture of Large Language Models, gaining insights into the intricate design and functionalities that enable these models to process and generate human-like text at scale. From understanding the underlying neural network architectures to exploring the training process and fine-tuning techniques, this course covers essential topics essential for grasping the core principles of LLMs.\n\n\nDuration ~ 2 Hours\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.l0cwfojv1lwz","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Introduction to Large Language Models (LLMs) Architecture","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS041","unlockable":true},{"_id":"BOS042","_updatedAt":"2025-05-14T13:43:39.814Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Lee Medoff , ODSC Instructor\n\nWorkshop Assets\nThis course consists of an on-demand recording, course notebook, and course exercises ( )\nBefore accessing the course code notebooks it is advisable to review the course prerequisites here.\n\nPrerequisites/Links-\n\nCode Notebooks on Google Colab Drive - https://bit.ly/44fKqpS\n\nIf you have a google account just double click to run the notebook on Colab. Otherwise please download and run in your favorite Jupyter Notebook environment. Please see the guidelines below:\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nDive into the world of R programming in this interactive workshop, designed to hone your data analysis and visualization skills. Begin with a walkthrough of the Colab interface, understanding cell manipulation and library utilization. Explore core R data structures like vectors, lists, and data frames, and learn data wrangling techniques to manipulate and analyze datasets. Grasp the basics of programming with iterations and function applications, transitioning into Exploratory Data Analysis (EDA) to derive insights from your data. Discover data visualization using ggplot2, unveiling the stories hidden within data. Lastly, get acquainted with RStudio, the robust Integrated Development Environment, enhancing your R programming journey. This workshop is your gateway to mastering R, catering to both novices and seasoned programmers.\n\n\nCourse Agenda:\nMeet the Instructor\nIntroduction to R\nData Structures\nData Munging and Data Wrangling\nProgramming basics - Functions and Iteration\nExploratory Data Analysis (EDA)\nRStudio\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.131b96y2jk01","slackUrl":"","speakerCompany":"","speakerName":"Lee Medoff","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Introduction to R","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS042","unlockable":true},{"_id":"BOS043","_updatedAt":"2025-05-14T13:43:39.816Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Mary Moesta , ODSC Instructor\n\nPrerquisites/Links:\n\nRun Code Notebooks on Google Colab \n\nhttps://bit.ly/3vY5ioT\n\nIf you have a google account just double click to run the notebook on Colab. Otherwise please download and run in your favorite Jupyter Notebook environment. Please see the guidelines below:\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nThis hands-on course serves as a comprehensive introduction to Large Language Models (LLMs), covering a spectrum of topics from their differentiation from other language models to their underlying architecture and practical applications. It delves into the technical aspects, such as the transformer architecture and the attention mechanism, which are the cornerstone of modern language models. The course also explores the applications of LLMs, focusing on zero-shot learning, few-shot learning, and fine-tuning, which showcase the models' ability to adapt and perform tasks with limited to no examples. Furthermore, it introduces the concept of flow chaining as a method to generate coherent and extended text, demonstrating its usefulness in tackling token limitations in real-world scenarios such as Q&A bots. Through practical examples and code snippets, participants are given a hands-on experience on how to utilize and harness the power of LLMs across various domains.\n\nBy utilizing  the code notebooks included in this course, participants can code  alongside the code instructor to ensure hand-on practice experience in LLMs\n\n\nCourse Agenda:\nIntroduction  \nWhy Are LLMs So Powerful \nThe Transformer Architecture\nThe Application of LLMs\nFlow Chaining \n\nWorkshop Assets\nThis course consists of an on-demand recording, course notebook, and course exercises ( )\nBefore accessing the course code notebooks it is advisable to review the course prerequisites here.\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.131b96y2jk01","slackUrl":"","speakerCompany":"","speakerName":"Mary Moesta","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"GenAI & LLMS: Introduction to Large Language Models","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS043","unlockable":true},{"_id":"BOS044","_updatedAt":"2025-05-14T13:43:39.819Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Mary Moesta , ODSC Instructor\n\nPrerquisites/Links:\n\nRun Code Notebooks on Google Colab \n\nhttps://bit.ly/3W7Ei0z\n\nIf you have a google account just double click to run the notebook on Colab. Otherwise please download and run in your favorite Jupyter Notebook environment. Please see the guidelines below:\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nThis workshop on Prompt Engineering explores the pivotal role of prompts in guiding Large Language Models (LLMs) like ChatGPT to generate desired responses. It emphasizes how prompts provide context, control output style and tone, aid in precise information retrieval, offer task-specific guidance, and ensure ethical AI usage. Through practical examples, participants learn how varying prompts can yield diverse responses, highlighting the importance of well-crafted prompts in achieving relevant and accurate text generation.\n\nAdditionally, the workshop introduces temperature control to balance creativity and coherence in model outputs, and showcases LangChain, a Python library, to simplify prompt construction. Participants are equipped with practical tools and techniques to harness the potential of prompt engineering effectively, enhancing their interaction with LLMs across various contexts and tasks.\n\nDuration ~ 20 min\n\nCourse Agenda:\nIntroduction to Prompt Engineering \nPrompt Tuning as a Mechanism for Fine Tuning  \nGuardrails for Prompt Responses  \nTemperature as a Means for Model Control    \nMemorization\nTool For Prompt Engineering\n\nWorkshop Assets\nThis course consists of an on-demand recording, course notebook, and course exercises ( )\nBefore accessing the course code notebooks it is advisable to review the course prerequisites here.\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.131b96y2jk01","slackUrl":"","speakerCompany":"","speakerName":"Mary Moesta","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"GenAI & LLMS: Introduction to Prompt Engineering","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS044","unlockable":true},{"_id":"BOS045","_updatedAt":"2025-05-14T13:43:39.822Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Mary Moesta , ODSC Instructor\n\nPrerequisites/Links:\n\nCode Notebook on Google Colab Drive\n\nhttps://bit.ly/4b4lsMo\n\nIf you have a google account just double click to run the notebook on Colab. Otherwise please download and run in your favorite Jupyter Notebook environment. Please see the guidelines below:\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nThis workshop on prompt engineering with OpenAI discussed best practices for utilizing OpenAI models. We will review how to separate instructions and context using special characters to help improve instruction clarity, context isolation, and enhances control over the generation process.  The workshop also included code for installing the langchain library and demonstrated how to create prompts effectively, emphasizing the importance of clarity, specificity, and precision in prompts. Additionally, the workshop showed how to craft prompts for specific tasks, such as extracting entities from text. It provided templates for prompts and highlighted the significance of specifying the desired output format through examples for improved consistency and customization.\n\nLastly, the workshop addressed the importance of using prompts as safety guardrails. It introduced prompts to mitigate hallucination and jailbreaking risks by instructing the model to generate well-supported and verifiable information, thereby promoting responsible and ethical use of language models.\n\nDuration ~ 15 min\n\nCourse Agenda:\nBest Practices for Prompting OpenAI\nPrompting Safety Guardrails\n\nWorkshop Assets\nThis course consists of an on-demand recording, course notebook, and course exercises ( )\nBefore accessing the course code notebooks it is advisable to review the course prerequisites here.\n\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.cultlbya2l6y","slackUrl":"","speakerCompany":"","speakerName":"Mary Moesta","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"GenAI & LLMS: Prompting with OpenAI and Prompting Safety Guardrails","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS045","unlockable":true},{"_id":"BOS046","_updatedAt":"2025-05-14T13:43:39.824Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Mary Moesta , ODSC Instructor\n\nPrerequisites/Links:\n\nCode Notebook on Google Colab Drive\n\nhttps://bit.ly/3W7DeKo\n\nhttps://bit.ly/3xCC535\n\nIf you have a google account just double click to run the notebook on Colab. Otherwise please download and run in your favorite Jupyter Notebook environment. Please see the guidelines below:\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nThis workshop  explores the importance of fine-tuning Language and Embedding Models (LLMs). It highlights how embedding models are used to map natural language to vectors, crucial for pipelines with multiple models to adapt to specific data nuances. An example demonstrates fine-tuning an embedding model for legal text. The notebook discusses existing solutions and the hardware considerations, emphasizing GPU usage for large data.\n\nThe practical part of the notebook shows the fine-tuning process of the \"\"\"\"distilroberta-base\"\"\"\" model from the SentenceTransformer library. It utilizes the QQP_triplets dataset from Quora for training, designed around semantic meaning. The notebook prepares the data, sets up a DataLoader, and employs Triplet Loss to encourage the model to map similar data points closely while distancing dissimilar ones. It concludes by mentioning the training duration and resources needed for further improvements.\n\nDuration ~ 24 min\n\n\nCourse Agenda:\nFine Tuning Embedding Models\nFine Tuning a Large Language Model\n\nWorkshop Assets\nThis course consists of an on-demand recording, course notebook, and course exercises ( )\nBefore accessing the course code notebooks it is advisable to review the course prerequisites here.\n\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.rx94kjuwh3t9","slackUrl":"","speakerCompany":"","speakerName":"Mary Moesta","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"GenAI & LLMS: Fine Tuning Existing LLMs and Embedding Models","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS046","unlockable":true},{"_id":"BOS047","_updatedAt":"2025-05-14T13:43:39.827Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Mary Moesta , ODSC Instructor\n\nPrerequisites/Links:\n\nRun Code Notebooks on Google Colab\n\nhttps://bit.ly/3QzuxVJ\n\nIf you have a google account just double click to run the notebook on Colab. Otherwise please download and run in your favorite Jupyter Notebook environment. Please see the guidelines below:\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nThe workshop notebook delves into building a Question and Answering Bot based on a fixed knowledge base, covering the integration of concepts discussed in earlier notebooks about LLMs (Large Language Models) and prompting. Initially, it introduces a high-level architecture focusing on vector search—a method to retrieve similar items based on vector representations. The notebook explains the steps involved in vector search including vector representation, indexing, querying, similarity measurement, and retrieval, detailing various technologies used for vector search such as vector libraries, vector databases, and vector plugins. The example utilizes an Open Source vector database, Chroma, to index data and uses state of the union text data for the exercise.\n\nThe notebook then transitions into the practical implementation, illustrating how text data is loaded, chunked into smaller pieces for effective vector search, and mapped into numeric vectors using the MPNetModel from the SentenceTransformer library via HuggingFace. Following this, the focus shifts to text generation where Langchain Chains are introduced. Chains, as described, allow for more complex applications by chaining several steps and models together into pipelines. A RetrievalQA chain is used to build a Q&A Bot application which utilizes an OpenAI chat model for text generation.\n\nDuration ~ 15 min\n\nCourse Agenda:\nBuilding a Q&A Bot\nVector Search Technologies \nLangChain Chains\n\nWorkshop Assets\nThis course consists of an on-demand recording, course notebook, and course exercises ( )\nBefore accessing the course code notebooks it is advisable to review the course prerequisites here.\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.7nw9k55oei8z","slackUrl":"","speakerCompany":"","speakerName":"Mary Moesta","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"GenAI & LLMS: Building a Q&A Bot with LLMs, Vector Search, and LangChain","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS047","unlockable":true},{"_id":"BOS048","_updatedAt":"2025-05-14T13:43:39.830Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Mary Moesta , ODSC Instructor\n\nPrerequisites/Links:\n\nCode Notebooks on Google Colab Drive - https://bit.ly/3xHdTN7\n\nIf you have a google account just double click to run the notebook on Colab. Otherwise please download and run in your favorite Jupyter Notebook environment. Please see the guidelines below:\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nThe workshop explores advanced topics in Large Language Models (LLMs) across three detailed sections. The first segment delves into LangChain Agents, showcasing the integration of LLMs with external systems to execute complex actions. The second part, \"\"\"\"Parameterized Fine-Tuning,\"\"\"\" explores fine-tuning LLMs for specific tasks. In the final section, participants dive into \"\"\"\"Retrieval-Augmented Generation (RAG),\"\"\"\" understanding how it merges retrieval and generation models to enhance language processing tasks. The section also elaborates on indexing content in a Retrieval Question-Answering chain for efficient information retrieval and showcases the use of Chroma, a vector database, for storing and managing high-dimensional vector data. Practical exercises, such as working with the CNN/DailyMail dataset, configuring chains, and prompt engineering, are peppered throughout, providing a hands-on learning experience on utilizing OpenAI and LangChain frameworks to tackle real-world problems. This workshop is a rich blend of theoretical knowledge and practical skills, aimed at harnessing the power of LLMs for varied applications.\n\nDuration ~ 24 min\n\nCourse Agenda:\nLangChain Agents\nParameter Efficient Fine-Tuning\nRetrieval-augmented generation\n\nWorkshop Assets\nThis course consists of an on-demand recording, course notebook, and course exercises ( )\nBefore accessing the course code notebooks it is advisable to review the course prerequisites here.\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.es5xt72t409u","slackUrl":"","speakerCompany":"","speakerName":"Mary Moesta","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"GenAI & LLMS: Advance LLMs - Agents, Parameter Efficient Fine-Tuning, and RAG","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS048","unlockable":true},{"_id":"BOS049","_updatedAt":"2025-05-14T13:43:39.832Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Mona Khalil , Senior Data Scientist | Greenhouse Software\n\nPrerequisites/Links:\n\nFamiliarity with data in Excel/CSV formats is helpful, but not required.\n\nTo start the training, please set up downloads:\n\nPython - https://www.python.org/\n\nAnaconda - https://www.anaconda.com/download\n\nJupyter - https://jupyter.org/install\n\nCourse Materials\n\nThe course materials are a set of Jupyter Notebooks.  Each notebook is listed in the course\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nCourse Notebooks - https://bit.ly/49NxbOi\n\nPython is the most popular programming language in the world of data science. It has an incredible range of applications in software, analytics, business intelligence, and other areas. If you’re new to Python (or programming in general) and are looking for a resource to hit the ground running, then this course is for you. Discover a breakthrough in your ability to leverage this versatile language with this fundamentals course designed to take you from zero experience to a powerful, practical user of this language.\n\nAcross this 3 hour class, you will build a solid foundation in key Python skills across 4 topic areas:\n\nLesson 1: Foundations of Python Usage (45 minutes)\n\nLearn to navigate the basics of Python and available tools for utilizing this programming language in your work. You will use Jupyter Notebooks to practice Python syntax, troubleshooting errors, and familiarizing yourself with the data types that serve as the building blocks for your work.\n\nLesson 2: Control Flow (45 minutes)\n\nDevelop an understanding of the order in which your program executes, and the necessary steps needed to complete a series of tasks. In this lesson, you’ll learn how to apply if/else statements, for loops, and while loops to evaluate and process information.\n\nLesson 3: Writing Functions (45 minutes)\n\nAn effective workflow in Python reuses code you define within functions. In this lesson, you’ll learn when and how to write functions in Python, and utilize Python’s lambda functions & list comprehensions to manipulate and process a wide array of information you may encounter.\n\nLesson 4: Manipulating Data (45 minutes)\n\nIn this last lesson, you’ll learn how to interact with files brought into your Python environment. You’ll learn Python’s native methods for reading, manipulating, and writing to files in different formats. You’ll also learn how the pandas library sets you up for success when interacting with files in Python.\n\nDuration ~ 3 Hours\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.df3njycz4gyq","slackUrl":"","speakerCompany":"Greenhouse Software","speakerName":"Mona Khalil","speakerTitle":"Senior Data Scientist","subtrack":"Training","talkTitle":"Complete Python Fundamentals\n","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS049","unlockable":true},{"_id":"BOS050","_updatedAt":"2025-05-14T13:43:39.835Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Dr. Jon Krohn, Chief Data Scientist | Nebula.io\n\nPrerequisites/Links:\nProgramming: All code demos will be in Python so experience with it or another object-oriented programming language would be helpful for following along with the code examples.\n\nMathematics: Familiarity with secondary school-level mathematics will make the class easier to follow along with. If you are comfortable dealing with quantitative information -- such as understanding charts and rearranging simple equations -- then you should be well-prepared to follow along with all of the mathematics.\n\nGithub repository for the original Notebook - https://bit.ly/4aG8559\n\nLinear Algebra Colab 1 - https://bit.ly/3U6TQzg\n\nLinear Algebra Colab 2 - https://bit.ly/3xIPeIb\n\nGoogle Drive to Files - https://bit.ly/447UqRO\n\nJupyter Notebooks Guide - https://bit.ly/3JtLSv8\n\nIt is essential because linear algebra lies at the heart of most machine learning approaches and is especially predominant in deep learning, the branch of ML at the forefront of today’s artificial intelligence advances. Through the measured exposition of theory paired with interactive examples, you’ll develop an understanding of how linear algebra is used to solve for unknown values in high-dimensional spaces, thereby enabling machines to recognize patterns and make predictions.\n\nThe content covered in Intro to Linear Algebra is itself foundational for all the other topics in the Machine Learning Foundations series and it is especially relevant to Linear Algebra II.\n\nOver the course of studying this topic, you'll:\n\nUnderstand the fundamentals of linear algebra, a ubiquitous approach for solving for unknowns within high-dimensional spaces.\n\nDevelop a geometric intuition of what’s going on beneath the hood of machine learning algorithms, including those used for deep learning.\n\nBe able to more intimately grasp the details of machine learning papers as well as all of the other subjects that underlie ML, including calculus, statistics, and optimization algorithms.\n","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.emqp0sw4swha","slackUrl":"","speakerCompany":"Nebula.io","speakerName":"Dr. Jon Krohn","speakerTitle":"Chief Data Scientist","subtrack":"Training","talkTitle":"Machine Learning Foundations: Linear Algebra","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS050","unlockable":true},{"_id":"BOS051","_updatedAt":"2025-05-14T13:43:39.837Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\nThis intro to AI Agents & RAG is a comprehensive course designed to equip students with the foundational knowledge and practical skills needed to build and implement AI agents. This course explores the core concepts of AI agents, including their types, key components, and tools, as well as advanced topics like agent chains and Retrieval-Augmented Generation (RAG).","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.8ewst6bxxuzm","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Introduction to AI Agents & RAG","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS051","unlockable":true},{"_id":"BOS052","_updatedAt":"2025-05-14T13:43:39.840Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Thomas Nield , Instructor | Founder | University of Southern California | Nield Consulting Group and Yawman Flight \nPrerequisites/Links:\n\nTools/Languages utilized: Python 3 if you want to try examples\n\nGithub: https://github.com/thomasnield/thomasnield_odsc2023\n\nWith the availability of data, there is a growing demand for talent who can analyze and make sense of it. This makes practical math all the more important because it helps infer insights from data. However, mathematics comprises many topics, and it is hard to identify which ones are applicable and relevant for a data science career. Knowing these essential math topics is key to integrating knowledge across data science, statistics, and machine learning. It has become even more important with the prevalance of libraries like PyTorch and scikit-learn, which can create \"\"\"\"black box\"\"\"\" approaches where data science professionals use these libraries but do not fully understand how they work. \n \n In this training, Thomas Nield (author of O'Reilly book \"\"\"\"Essential Math for Data Science\"\"\"\") will provide a crash-course of carefully curated topics to jumpstart proficiency in key areas of mathematics. This includes probability, statistics, hypothesis testing, and linear algebra. Along the way you’ll integrate what you’ve learned and see practical applications for real-world problems. These examples include how statistical concepts apply to machine learning, and how linear algebra is used to fit a linear regression. We will also use Python to explore ideas in calculus and model-fitting, using a combination of libraries and from-scratch approaches.","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.21bs8ppr82ds","slackUrl":"","speakerCompany":"University of Southern California | Nield Consulting Group and Yawman Flight","speakerName":"Thomas Nield","speakerTitle":"Instructor | Founder","subtrack":"Training","talkTitle":"Introduction to Math for Data Science","target":"","timeZone":"America/New_York","timerStartTime":"15:00:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS052","unlockable":true},{"_id":"BOS073","_updatedAt":"2025-05-14T13:43:39.842Z","access":"Platinum","active":"yes","date":"2025-05-14","description":"Sheamus McGovern, ODSC Instructor\n\nPrerequisites: \n\nSlides - https://drive.google.com/file/d/1s63BO-IMY522mfms_5ijhr8Bx2udgvcw/view?usp=sharing \n\nAdditional materials - https://drive.google.com/drive/folders/1wlhuI1cEQvWT4Lzw1ex_4ls6Nk7qXJR1\n\n\nThis lightning lesson will introduce you to the fundamentals of structured prompting, showing you how small changes in how you prompt can lead to dramatically better results. You’ll learn how to optimize your prompts for clarity, specificity, and control, ensuring the AI delivers responses that truly meet your needs.\n\nWhat you'll learn:\n\n📌 Recognize the limitations of basic prompting\n📌 Use key prompting techniques for better control and accuracy\n📌 Understand the shift from manual prompt. to programmatic PE\n📌 Powering Retrieval-Augmented Generation (RAG) and Agentic AI\n📌 Enhance reasoning and decision-making with better prompts\n\n\nDuration: ~ 1Hr","detailLink":"","difficulty":"Beginner","displayStartTime":"03:00 PM - 12:00 AM ET","duration":"540","endTime":"12:00 AM","event":"ODSC East 2027","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.rb6wuk6lxck7","slackUrl":"","speakerCompany":"","speakerName":"Sheamus McGovern","speakerTitle":"ODSC Instructor","subtrack":"Training","talkTitle":"Beyond Basic Prompting: Unlocking Prompt Engineering","target":"","timeZone":"America/New_York","timerStartTime":"15:00:02","topicTag1":"","topicTag2":"All Tracks","topicTag3":"","topicTag4":"Beginner","track":"Self Paced","uniqueId":"BOS073","unlockable":true},{"_id":"BOS074","_updatedAt":"2025-05-14T13:43:39.844Z","access":"General","active":"yes","date":"2025-05-15","description":"Paul Iusztin, Senior AI Engineer / Founder | Decoding ML\nPrerequisites/Links:\n\nEngage actively and meaningfully in the chat for a chance to win a free ebook! We'll be looking for insightful questions and thoughtful contributions. As a thank you to everyone for joining, all other attendees will receive a 20% discount on print books and a fantastic 50% off ebooks, valid until the end of May.","detailLink":"","difficulty":"All Levels","displayStartTime":"01:30 PM - 02:00 PM ET","duration":"30","endTime":"2:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"","speakerCompany":"Decoding ML","speakerName":"Paul Iusztin","speakerTitle":"Senior AI Engineer / Founder","subtrack":"Book Signing","talkTitle":"Book Author: LLM Engineer's Handbook: Master the art of engineering large language models from concept to production","target":"","timeZone":"America/New_York","timerStartTime":"13:30:00","topicTag1":"","topicTag2":"","topicTag3":"","topicTag4":"All Levels","track":"May 15","uniqueId":"BOS074","webinarLink":"https://streamyard.com/watch/rM9BUaHxJRXW"},{"_id":"BOS075","_updatedAt":"2025-05-14T13:43:39.847Z","access":"General","active":"yes","date":"2025-05-12","description":"David Hoyle, PhD, Research Data Science Specialist | dunnhumby\nPrerequisites/Links:\n\nMachine Learning and AI are ever growing fields, with the techniques and algorithms available to Data Scientists continuing to increase in sophistication and complexity. Knowing which algorithm to use and why becomes essential for any Data Scientist wishing to succeed, or more importantly for any Data Scientist wishing to avoid making a poor choice of algorithm and negatively impacting their organization. Selecting the right technique or algorithm requires understanding the language in which those algorithms are written, and that language is mathematics. Having even just a basic grasp of the mathematical concepts behind core Data Science algorithms can help a Data Scientist stand out in a crowded employment market.   \n\nIn this training, David Hoyle (author of the Packt book \"\"\"\"15 Math Concepts Every Data Scientist Should Know\"\"\"\") will provide a basic introduction to the most important mathematical concepts needed in data science. The training will focus on differential calculus and linear algebra. The training will introduce the key concepts in the first lesson and then integrate the concepts together in the second lesson, where attendees will learn how to train a simple linear model using real examples in Python using the NumPy library.\n\nLesson 1: Differential calculus and linear algebra basics \n\nWe’ll start with learning the basic concepts of differential calculus, such as calculating the first and second derivatives of a function and how to use them to find the maximum and minimum of a function. Then we’ll move onto learning to use vectors to represent data, and matrices to represent linear transformations of that data. We finish the lesson by learning some basic matrix operations such as calculating the inverse of a square matrix. We demonstrate these vector and matrix operations in Python using the NumPy library.\n\nLesson 2: Loss functions and basic model training\n\nIn the second lesson we’ll use everything we learnt in Lesson 1 when we train a simple linear model. We’ll show how finding the optimal model parameters can be done by finding the minimum of a loss function. We’ll show how to represent and minimize the loss function in closed-form using  the basic calculus and matrix calculations from Lesson 1. We’ll finish the lesson by learning about gradient descent as a general method for minimizing loss functions and hence as a general method for training any machine learning model such as neural networks. Throughout the lesson we’ll demonstrate the concepts with examples in Python using the NumPy library.\n\nLearning Objective:\n\nAfter this session, attendees will understand the most important mathematical concepts in data science. They will understand how to represent data using vectors, how to perform linear transformations on data using matrices, and how to use differential calculus to analyse more general functions of data. They will understand how those mathematical concepts are combined when training a machine learning model, and how to perform that model training in Python.","detailLink":"","difficulty":"Beginner","displayStartTime":"12:30 PM - 02:30 PM ET","duration":"120","endTime":"2:30 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.lo0qh5tyq42x","replayLink":"","slackUrl":"https://live.odsc.com/channel/mon-david-hoyle-phd-introduction-to-math-for-data-science","speakerCompany":"dunnhumby","speakerName":"David Hoyle, PhD","speakerTitle":"Research Data Science Specialist","subtrack":"Bootcamp","talkTitle":"Introduction to Math for Data Science","target":"","timeZone":"America/New_York","timerStartTime":"12:30:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"","topicTag4":"Beginner","track":"May 12","uniqueId":"BOS075","webinarLink":"https://streamyard.com/watch/ekZ898TqPjGu"},{"_id":"BOS076","_updatedAt":"2025-05-14T13:43:39.849Z","access":"General","active":"yes","date":"2025-05-13","description":"Andrew Jones, Principal Engineer\nPrerequisites/Links:\n\nAbstract: Many organizations are moving towards a data mesh architecture, but are struggling to implement it.\n\n- How do you enable domains to own their data products?\n- How do you federate governance?\n- And how do you implement a truly self-serve data platform?\n\nIt turns out, all of this can be implemented with data contracts.\n\nData contracts simply describe the data, but that becomes so powerful. You can use data contracts to promote autonomy, ensure accountability, and enable automation.\n\nAfter introducing data contracts I'll show you exactly how data contracts can be used to implement a data mesh, covering:\n\n- How to define data products\n- How to enable domain ownership of those data products\n- How to ensure standardisation through a self-serve data platform\n- How to federate and automate data governance across your organization\n\nYou'll leave the session with a good understanding of data contracts and practical examples of how you can use them to solve the problems you have implementing data mesh in your organization.\n\nWe'll cover Bitol, an open standard for defining data contracts and data products.","detailLink":"","difficulty":"Intermediate-Advanced","displayStartTime":"11:10 AM - 11:40 AM ET","duration":"30","endTime":"11:40 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/tue-andrew-jones-why-data-contracts-are-foundational-to-a-successful-data-mesh","speakerCompany":"","speakerName":"Andrew Jones","speakerTitle":"Principal Engineer","subtrack":"Talk","talkTitle":"Why Data Contracts Are Foundational to a Successful Data Mesh","target":"","timeZone":"America/New_York","timerStartTime":"11:10:00","topicTag1":"","topicTag2":"Data Engineering","topicTag3":"","topicTag4":"Intermediate-Advanced","track":"May 13","uniqueId":"BOS076","webinarLink":"https://streamyard.com/watch/qGTBtBcAj2ht"},{"_id":"BOS077","_updatedAt":"2025-05-14T13:43:39.852Z","access":"General","active":"yes","date":"2025-05-15","description":"Guy Korland, PhD, CEO & Co-founder | FalkorDB\nPrerequisites/Links:\n\nAbstract: This session explores practical applications of graph databases in machine learning, designed for data scientists familiar with graph theory and ML workflows. \n\nWe'll go into how graph databases address challenges related to knowledge representation. The talk highlights the use of graph databases, offering insights into real-world use cases involving fraud detection and personalized recommendations. \n\nBy attending, you'll gain an insider’s perspective, including strategies for building effective graph-enhanced ML pipelines and tips for overcoming common performance bottlenecks.","detailLink":"","difficulty":"Intermediate","displayStartTime":"12:15 PM - 12:45 PM ET","duration":"30","endTime":"12:45 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-guy-korland-graph-databases-for-ml-an-insiders-perspective","speakerCompany":"FalkorDB","speakerName":"Guy Korland, PhD","speakerTitle":"CEO & Co-founder","subtrack":"Talk","talkTitle":"Graph Databases for ML: An Insider's Perspective","target":"","timeZone":"America/New_York","timerStartTime":"12:15:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"Data Engineering","topicTag4":"Intermediate","track":"May 15","uniqueId":"BOS077","webinarLink":"https://streamyard.com/watch/rM9BUaHxJRXW"},{"_id":"BOS078","_updatedAt":"2025-05-14T13:43:39.854Z","access":"General","active":"yes","date":"2025-05-15","description":"Ryan O'Neil, PhD, CTO | Nextmv\nPrerequisites/Links:\n\nAbstract: Data scientists are increasingly turning to mathematical optimization solvers to improve business outcomes for a variety of problems: which driver delivers your burrito, how to price avocados, who works the late shift, and if the blue sweater gets included in your subscription box. \n\nBut many of the most popular mathematical optimization solvers are deterministic, and can’t by themselves account for uncertainty inherent in business logistics and operations. They are also extremely sensitive to input data and they only know what we tell them about the world. And (as machine learning models tell us) the world is often fuzzy and uncertain: rain produces a traffic jam, avocado demand skyrockets, and blue sweaters are so not in right now. \n\nEveryday business decisions are inextricably linked to uncertainty and randomness. Combining these disciplines often results in what is known as the \"\"knife's edge\"\": brittle solutions to problems that respond poorly when circumstances don't go exactly as planned. So how can we leverage optimization in these kinds of environments?\n\nRecent developments are yielding exciting emulsifications of predictions from machine learning models with prescriptions and plans from decision models powered by optimization solvers. This talk will show how to fit machine learning models for optimization inputs, plug machine learning models into open source and commercial optimization solution formulations, and simple techniques for managing uncertainty in these models. We will also show examples of real-world models and show how to interpret results.","detailLink":"","difficulty":"Intermediate","displayStartTime":"12:50 PM - 01:20 PM ET","duration":"30","endTime":"1:20 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-ryan-oneil-predict-prescribe-combining-forecasts-with-optimized-plans","speakerCompany":"Nextmv","speakerName":"Ryan O'Neil, PhD","speakerTitle":"CTO","subtrack":"Talk","talkTitle":"Predict & Prescribe: Combining Forecasts with Optimized Plans","target":"","timeZone":"America/New_York","timerStartTime":"12:50:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"AI Engineering","topicTag4":"Intermediate","track":"May 15","uniqueId":"BOS078","webinarLink":"https://streamyard.com/watch/rM9BUaHxJRXW"},{"_id":"BOS079","_updatedAt":"2025-05-14T13:43:39.856Z","access":"General","active":"yes","date":"2025-05-14","description":"Ivan Lee, CEO | Datasaur\n\nAbstract: Manual data annotation for NLP tasks is increasingly being augmented by intelligent techniques. This presentation delves into several key approaches for enhancing annotation workflows, including LLM-powered labeling, data programming strategies, and automated error correction. Drawing on 15 years of experience in the field, we share best practices and lessons learned, demonstrating how these intelligent approaches can boost annotation efficiency and quality by up to 75%.","detailLink":"","difficulty":"All Levels","displayStartTime":"11:40 AM - 12:10 PM ET","duration":"30","endTime":"12:10 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-ivan-lee-intelligent-nlp-data-annotation-boosting-efficiency-and-quality-with-advanced-techniques","speakerCompany":"Datasaur","speakerName":"Ivan Lee\n","speakerTitle":"CEO","subtrack":"Solution Showcase","talkTitle":"Intelligent NLP Data Annotation: Boosting Efficiency and Quality with Advanced Techniques","target":"","timeZone":"America/New_York","timerStartTime":"11:40:00","topicTag1":"","topicTag2":"","topicTag3":"","topicTag4":"All Levels","track":"May 14","uniqueId":"BOS079","webinarLink":"https://streamyard.com/watch/g6kb3VHJFGnr"},{"_id":"BOS080","_updatedAt":"2025-05-14T13:43:39.859Z","access":"General","active":"yes","date":"2025-05-14","description":"Parham Parvizi, Founding Data Architect | Prospective\n\nAbbstract:\nModern data workloads demand fast, interactive, and scalable visualization—without the cost and complexity of server-side rendering. The local-first approach leverages modern browser capabilities, WebAssembly, and in-browser computation to achieve high-performance analytics while reducing cloud costs.\nIn this workshop, we’ll explore:\nWhy Local-First? The benefits of running everything client-side for cost-efficient, scalable visualization across thousands of users.\nWebAssembly (WASM) for Data Apps: How Perspective harnesses WASM to power ultra-fast, browser-native analytics and even replace traditional Docker-based containers for data workloads.\nPerspective + DuckDB: A full in-browser analytics stack that enables high-speed querying and visualization without a backend.\nStreaming Data with InfluxDB: How to visualize high-frequency, real-time IoT and log data with sub-second latency.\nDatabricks + Perspective: Enhancing large-scale analytics with interactive dashboards inside Jupyter notebooks.\nThrough live coding and guided exercises, attendees will build their own browser-native analytics dashboards, connect to real-time data streams, and learn Perspective’s API in Python, Node.js, and Rust.","detailLink":"","difficulty":"All Levels","displayStartTime":"11:05 AM - 11:35 AM ET","duration":"30","endTime":"11:35 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-parham-parvizi-a-local-first-approach-to-extremely-fast-streaming-visualization","speakerCompany":"Prospective","speakerName":"Parham Parvizi","speakerTitle":"Founding Data Architect","subtrack":"Solution Showcase","talkTitle":"A Local-First Approach to Extremely Fast Streaming Visualization","target":"","timeZone":"America/New_York","timerStartTime":"11:05:00","topicTag1":"","topicTag2":"","topicTag3":"","topicTag4":"All Levels","track":"May 14","uniqueId":"BOS080","webinarLink":"https://streamyard.com/watch/Hu6wtyxgHkx6"},{"_id":"BOS081","_updatedAt":"2025-05-14T13:43:39.861Z","access":"Premium","active":"yes","date":"2025-05-15","description":"Jayeeta Putatunda, Lead Data Scientist, Director - AI CoE | Fitch Group\nPrerequisites/Links:\n\nAbstract: AI agents are transforming industries by automating complex processes and delivering insights at scale. In financial services, AI agents can streamline decision-making, reduce manual effort, and improve the accuracy of report analysis can informs various downstream tasks like market research, credit scoring, report generation, etc. Designing and building such agents requires a strong understanding of their architecture, the data they rely on, and how to use AI to automate repetitive tasks effectively.\n\nIn this hands-on code-along session, Jayeeta Putatunda, a Lead Data Scientist & Director at Fitch Group, will guide you through creating an AI agent tailored for financial report analysis. You’ll learn how to design and architect AI agents, explore their applications in finance, and identify the key data needed for these systems. The session will also cover how AI agents can automate repetitive tasks to enhance efficiency. This webinar is ideal for data scientists and machine learning scientists looking to build practical AI solutions for financial applications.\n\nKey Takeaways:\n\n1.Learn how to design, architect, and create an AI agent for financial report analysis\n2.Discover techniques and open-source tools that can be leveraged for building these solutions\n3.Understand the data requirements for building AI agents in financial applications.","detailLink":"","difficulty":"Intermediate","displayStartTime":"12:40 PM - 01:40 PM ET","duration":"60","endTime":"1:40 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/thu-jayeeta-putatunda-building-agents-for-financial-services","speakerCompany":"Fitch Group","speakerName":"Jayeeta Putatunda","speakerTitle":"Lead Data Scientist, Director - AI CoE","subtrack":"Workshop","talkTitle":"Building Agents for Financial Services","target":"","timeZone":"America/New_York","timerStartTime":"12:40:00","topicTag1":"","topicTag2":"AI Agents","topicTag3":"","topicTag4":"Intermediate","track":"May 15","uniqueId":"BOS081","webinarLink":"https://streamyard.com/watch/HeyppKwfsydH"},{"_id":"BOS082","_updatedAt":"2025-05-14T13:43:39.863Z","access":"Premium","active":"yes","date":"2025-05-14","description":"Jacob Matson, Developer Advocate | MotherDuck\nPrerequisites/Links:\n1. duckdb \n2. an AI powered IDE (cursor, windsurf, cline…)\n3. FSQ OS Places Data Set\n4. uv & python\n\nTools/Languages utilized: SQL, Python\nCode Notebooks: https://github.com/matsonj/cursor_eda\n\nAbstract: In this hands-on workshop, we will demonstrate how AI can empower you to \"vibe code\"—using AI to write accurate SQL, enabled only by the magic of DuckDB. Participants will work with a real life spatial data set to tackle real-world challenges and see firsthand how AI-Driven DuckDB SQL can transform data handling into a rapid, low-risk, interactive process.\n\nKey Components of the Workshop:\n\nDataset Handling:\nParticipants will work with a spatial dataset to evaluate potential locations for opening a new BBQ restaurant. Thanks to DuckDB, the dataset is easily brought down locally in a highly compressed format, ensuring a quick and safe environment for experimentation.\n\nLive AI-Assisted Coding:\nThe workshop will feature a live demonstration where an AI tool iteratively generates SQL queries. Rather than pre-defining metrics, the AI assists in exploring and defining the spatial parameters necessary to identify the optimal restaurant location—a process that mirrors real-world, dynamic decision-making.\n\nReal-Time Data Visualization:\nAs queries are refined and executed, Python will be used to chart the results on the fly. Utilizing uv for environment management alongside visualization libraries such as Seaborn and Matplotlib, participants will see how spatial insights are translated into clear, actionable charts.\n\nIterative, Low-Risk Workflow:\nThe session emphasizes a low-risk, experimental approach. If the AI-generated code isn't perfect, no harm is done—files can be quickly deleted or corrected, encouraging a creative, hands-on learning environment where trial and error lead to deeper understanding.\n\nBy the end of the workshop, participants will have experienced an end-to-end workflow: from ingesting and querying spatial data with DuckDB/MotherDuck, to refining query results with AI, and finally presenting insights through Python visualizations. This session is designed to empower you to confidently incorporate AI in your coding processes, transforming how you approach data analysis and decision making in real-world business scenarios.","detailLink":"","difficulty":"Intermediate","displayStartTime":"02:00 PM - 03:00 PM ET","duration":"60","endTime":"3:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-jacob-matson-ai-driven-sql-workflows-beyond-the-hype","speakerCompany":"MotherDuck","speakerName":"Jacob Matson","speakerTitle":"Developer Advocate","subtrack":"Workshop","talkTitle":"AI-Driven SQL Workflows: Beyond the Hype","target":"","timeZone":"America/New_York","timerStartTime":"14:00:00","topicTag1":"","topicTag2":"Data Engineering","topicTag3":"","topicTag4":"Intermediate","track":"May 14","uniqueId":"BOS082","webinarLink":"https://streamyard.com/watch/Rjc9FfuXGbZ8"},{"_id":"BOS083","_updatedAt":"2025-05-14T13:43:39.866Z","access":"Platinum","active":"yes","date":"2025-05-13","description":"Freddy Boulton, Software Engineer | Hugging Face\nPrerequisites/Links:\n\nAudio and Video Streaming are revolutionizing AI applications right now.\nChatGPT and Gemini can listen and respond in real-time audio conversations.\nThe latest Text-to-Speech models and APIs make it easier than ever to generate lifelike audio.\n\nBut here's the challenge: building real-time voice and video applications in Python has been painfully complex... until now.\n\n**Enter FastRTC: Your Gateway to Voice & Video AI**\n\nIn this hands-on workshop, you'll build a voice assistant that can listen, speak, and understand you in real-time - with just a fraction of the code you'd expect. We'll demystify WebRTC and Websockets and show you how to create Siri-like experiences in pure Python.","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"10:00 AM - 11:00 AM ET","duration":"60","endTime":"11:00 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.i7iljr61sqjz","slackUrl":"https://live.odsc.com/channel/tue-freddy-boulton-unlock-the-future-of-ai-real-time-voice-video","speakerCompany":"Hugging Face","speakerName":"Freddy Boulton","speakerTitle":"Software Engineer","subtrack":"Bootcamp","talkTitle":"Unlock the Future of AI: Real-Time Voice & Video","target":"","timeZone":"America/New_York","timerStartTime":"10:00:00","topicTag1":"","topicTag2":"Machine Learning","topicTag3":"","topicTag4":"Beginner-Intermediate","track":"May 13","uniqueId":"BOS083","unlockable":true},{"_id":"BOS084","_updatedAt":"2025-05-14T13:43:39.868Z","access":"Platinum","active":"yes","date":"2025-05-13","description":"Hugo Bowne-Anderson, PhD, Independent Data and AI Consultant | \nPrerequisites/Links:\n\nAbstract: This workshop is designed to equip software engineers with the skills to build and iterate on generative AI-powered applications. Participants will explore key components of the AI software development lifecycle through first principles thinking, including prompt engineering, monitoring, evaluations, and handling non-determinism. The session focuses on using multimodal AI models to build applications, such as querying PDFs, while providing insights into the engineering challenges unique to AI systems. By the end of the workshop, participants will know how to build a PDF-querying app, but all techniques learned will be generalizable for building a variety of generative AI applications.\n\nIf you're a data scientist, machine learning practitioner, or AI enthusiast, this workshop can also be valuable for learning about the software engineering aspects of AI applications, such as lifecycle management, iterative development, and monitoring, which are critical for production-level AI systems.\n\nThis workshop is designed to equip software engineers with the skills to build and iterate on generative AI-powered applications. Participants will explore key components of the AI software development lifecycle through first principles thinking, including prompt engineering, monitoring, evaluations, and handling non-determinism. The session focuses on using LLMs to build applications, such as querying PDFs, while providing insights into the engineering challenges unique to AI systems. By the end of the workshop, participants will know how to build a PDF-querying app, but all techniques learned will be generalizable for building a variety of generative AI applications.\n\nIf you're a data scientist, machine learning practitioner, or AI enthusiast, this workshop can also be valuable for learning about the software engineering aspects of AI applications, such as lifecycle management, iterative development, and monitoring, which are critical for production-level AI systems.\n\nWhat You'll Learn:\n\nHow to integrate AI models and APIs into a practical application.\nTechniques to manage non-determinism and optimize outputs through prompt engineering.\nHow to monitor, log, and evaluate AI systems to ensure reliability.\nThe importance of handling structured outputs and using function calling in AI models.\nThe software engineering side of building AI systems, including iterative development, debugging, and performance monitoring.\nPractical experience in building an app to query PDFs using multimodal models.\n\nWhat is Unique About This Session:\n\nThis workshop uniquely bridges the gap between software engineering and generative AI development. While most AI workshops focus solely on model usage or tuning, this session emphasizes the entire AI software lifecycle — from prompt engineering to monitoring and tracing. Participants will learn how to manage non-determinism and create production-ready AI applications, giving them the knowledge to tackle the software engineering challenges of AI-powered apps. The hands-on approach ensures that attendees walk away with practical skills and a functional app.\n\nWorkshop Prerequisite Knowledge:\n\nBasic programming knowledge in Python.\nFamiliarity with REST APIs.\nExperience working with Jupyter Notebooks or similar environments (preferred but not required).\nNo prior experience with AI or machine learning is required.\nMost importantly, a sense of curiosity and a desire to learn!\n\nIf you have a background in data science, ML, or AI, this workshop will help you understand the software engineering side of building AI applications.\n\nWe will introduce you to certain modern frameworks in the workshop but the emphasis be on first principles and using vanilla Python and LLM calls to build AI-powered systems.","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"10:00 AM - 12:00 PM ET","duration":"120","endTime":"12:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.g0zjmhjngyq4","slackUrl":"https://live.odsc.com/channel/tue-hugo-bowne-anderson-building-llm-powered-applications-for-data-scientists-and-software-engineers","speakerCompany":"","speakerName":"Hugo Bowne-Anderson, PhD","speakerTitle":"Independent Data and AI Consultant","subtrack":"Bootcamp","talkTitle":"Building LLM-Powered Applications for Data Scientists and Software Engineers","target":"","timeZone":"America/New_York","timerStartTime":"10:00:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"","topicTag4":"Beginner-Intermediate","track":"May 13","uniqueId":"BOS084","unlockable":true},{"_id":"BOS085","_updatedAt":"2025-05-14T13:43:39.870Z","access":"Platinum","active":"yes","date":"2025-05-13","description":"Atul Kulkarni, Engineering Manager | Amazon\nLakshmithejaswi Narasannagari, Software Engineer | Amazon\nPrerequisites/Links:\n\nAs AI becomes prevalent and pervasive across the industry, retooling of existing workforce to leverage AI has become a challenge for organizations. In order to leverage AI in their day to day life, the workforce needs to understand the lay of the land and methodologies to build applications with AI. This hands-on workshop offers a comprehensive journey through the complete anatomy of an AI application, focusing on cutting-edge technologies Large Language Models (LLMs) and AI Agents. Participants will gain practical experience developing sophisticated AI solutions, from initial concept to final implementation, applied to real-world tasks. \n\nThe hands-on workshop will cover:\n\nSystem Overview: Understanding the entire lifecycle of AI application development\nAI Components: Exploring the core building blocks of advanced AI systems\nPrompt Engineering: Mastering basic and advanced techniques for effective AI interaction. Retrieval Augmented Generation (RAG): Implementing strategies to enhance AI output with external knowledge\nAgentic Architecture Basics: Designing and deploying AI agents for complex task execution\n\nThis workshop does not require AI proficiency and is ideal for data scientists, AI engineers, Developers, Product Managers, and Senior Executives seeking to expand their skills in the rapidly evolving field of AI application development. Participants will leave with practical knowledge and hands-on experience in building state-of-the-art AI solutions using the latest Generative AI, LLMs, and AI agent techniques. This workshop will lay solid foundations for the audience to explore various contours of AI backed application development.\n\nKey TakeAways:\n- Conceptualize and design AI applications addressing real-world challenges\n- Develop effective prompts for optimal AI performance\n- Integrate RAG techniques to improve AI responses \n- Create basic AI agents that are capable of problem-solving","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"01:45 PM - 02:45 PM ET","duration":"60","endTime":"2:45 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.6olw8lpx9st","slackUrl":"https://live.odsc.com/channel/tue-atul-kulkarni-lakshmithejaswi-narasannagari-from-concept-to-creation-building-advanced-ai-applications-with-llms-and-ai-agents","speakerCompany":"Amazon","speakerName":"Atul Kulkarni\nLakshmithejaswi Narasannagari","speakerTitle":"Engineering Manager\nSoftware Engineer","subtrack":"Bootcamp","talkTitle":"From Concept to Creation: Building Advanced AI Applications with LLM’s and AI Agents","target":"","timeZone":"America/New_York","timerStartTime":"13:45:00","topicTag1":"","topicTag2":"AI Agents","topicTag3":"LLMs","topicTag4":"Beginner-Intermediate","track":"May 13","uniqueId":"BOS085","unlockable":true},{"_id":"BOS086","_updatedAt":"2025-05-14T13:43:39.873Z","access":"Platinum","active":"yes","date":"2025-05-15","description":"Ivan Lourenço Gomes, Front-End Engineer & Technology Instructor | Daweb Schools\nPrerequisites/Links:\n\nThe latest DeepSeek V3 and R1 models have demonstrated superiority in many AI industry benchmarks, particularly in Math and Coding. Their enhanced contextual understanding, speed, and cost-efficiency have gained the attention of businesses and experts in the field, making them an essential area of knowledge for all tech professionals.\n\nThis tutorial provides a comprehensive introduction to DeepSeek, highlighting its strengths in code generation, reasoning, and automation workflows.\n\nAttendees will gain insights into:\n\n- How DeepSeek V3 and R1 compare to other LLMs in terms of performance, efficiency, and capabilities.\n- Advanced prompt engineering techniques to enhance the accuracy of AI-generated responses.\n- No-code automation using Make.com workflows to integrate AI into business operations.\n- Use cases of DeepSeek models across various industries:\n   • Finance & Business Intelligence: Automating financial analysis & report generation.\n   • Product Engineering: Assisting in software development by generating, debugging, and optimizing code, reducing time-to-market for new products.\n   • Sales & Marketing: Enhancing customer interactions with AI chatbots, creating personalized marketing content, and automating lead generation.\n   • Customer Support & Operations: Automating responses, summarizing customer queries, and improving service efficiency through AI-powered workflows.\n\nBy the end of this session, attendees will understand how to integrate DeepSeek into their projects, create AI-assisted automation, and master prompt engineering for real-world applications.\n\nTarget Audience:\nThis session is ideal for developers, AI enthusiasts, data scientists, and automation specialists looking to enhance their AI implementation skills without requiring deep machine learning or coding knowledge.\n\n1. Introduction to DeepSeek V3 & R1\n- Overview of their architecture and key improvements\n- How they compare to other AI models in different benchmarks, like AIME 2024, MATH-500 and LiveCodeBench\n- Real-world use cases in coding, reasoning, and automation\n- Running DeepSeek and other AI models locally with Ollama for increased privacy\n\n2. Advanced Prompt Engineering\n- How different prompt structures impact responses\n- The 6 strategies to effectively communicate with AI models\n\n3. Automating Workflows with Make.com & DeepSeek\n- Overview of Make.com as a no-code automation tool\n- How to connect DeepSeek to workflows for free using Open Router.\n- Use cases: Integration with the most popular Apps in the market: Gmail, Google Drive, Spreadsheets & Docs, Youtube, Social Media Platforms, Jira, Trello, SQL Databases, CMS Systems & more.\n\nWhat attendees will learn\n- How to use DeepSeek V3 & R1 for more efficient AI interactions\n- Advanced prompt engineering strategies for improved accuracy\n- How to create AI automation with Make.com\n\nTools used in the session:\n- DeepSeek V3 & R1 models\n- Ollama\n- Make.com","detailLink":"","difficulty":"Beginner-Intermediate","displayStartTime":"11:35 AM - 12:35 PM ET","duration":"60","endTime":"12:35 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.u5zfvlcaz1ev","slackUrl":"https://live.odsc.com/channel/thu-ivan-lourenco-gomes-mastering-deepseek-v3-r1-advanced-prompt-engineering-ai-automation","speakerCompany":"Daweb Schools","speakerName":"Ivan Lourenço Gomes","speakerTitle":"Front-End Engineer & Technology Instructor","subtrack":"Bootcamp","talkTitle":"Mastering DeepSeek V3 & R1: Advanced Prompt Engineering & AI Automation","target":"","timeZone":"America/New_York","timerStartTime":"11:35:00","topicTag1":"","topicTag2":"Generative AI","topicTag3":"LLMs&RAG, AI Engineering, AI Agents","topicTag4":"Beginner-Intermediate","track":"May 15","uniqueId":"BOS086","unlockable":true},{"_id":"BOS087","_updatedAt":"2025-05-14T13:43:39.875Z","access":"Platinum","active":"yes","date":"2025-05-15","description":"Rami Krispin, Senior Manager - Data Science and Engineering  | Apple\nPrerequisites/Links:\n\nIt requires to clone the following repo:\nhttps://github.com/RamiKrispin/osdc-2025-llm-workshop\n\nI will add instractions to the repo README about how to set the Python environment.\n\nThroughout the workshop we will download the dataset from an API and it is approximately 150Mb \n\nWe will use the OpenAI API, it requires paid subscription. \n\nTools/Languages utilized:\nRequires to install the python dependencies as state in the requirements.txt file:\nhttps://github.com/RamiKrispin/osdc-2025-llm-workshop/blob/main/docker/requirements.txt\nVScode (or any other Python IDE), Python, and the OpenAI API\n\nCode Notebooks:\nThe workshop repository:\nhttps://github.com/RamiKrispin/osdc-2025-llm-workshop\n\n\nThe rapid development of natural language models, especially Large Language Models (LLMs), has presented numerous possibilities for various fields. One of the most common applications is using LLMs for coding. For instance, OpenAI’s chatGPT, Anthropic Claude, Meta’s Code LLAMA, and Google Gemini are LLMs that offer state-of-the-art natural language to code generators. \n\nOne potential use case is a natural language to SQL code generator, which could assist non-technical professionals with simple data requests and enable the data teams to focus on more data-intensive tasks. This tutorial focuses on setting up a language to SQL code generator using the LLM API.\n\nIn this workshop, we will review the steps of setting up a system that enables users to interact with databases and ask questions using natural language. We will start with system design and implement this process with Python.\n\nBy the end of this session, you will:\n- Understand how LLMs can be used to bridge the gap between natural language and structured data queries\n- Learn how to set up prompts for creating SQL code\n- Learn how to functionalize and connect the code generator with an SQL database\n\n(1) Problem statement - we will start with the motivation for setting up a SQL code generator, review different use cases, and introduce a general system design.\nLearning objectives:\n- Learners will understand the use cases of using LLMs to create language to SQL code generator\n- Learners will review the general system design \n(2) Prompt engineering - review the foundation of prompt engineering and how to set templates for creating SQL code\nLearning objectives:\n- Learners will understand how to interact with LLM using prompt\n- Learners will learn the level of prompt context required to improve the quality of the results\n(3) Functionlize the process - connect all the dots and set up a Python function that receives questions, sets up prompts, and sends a GET request to the LLM to generate SQL code and use the code to query the database.\n- Learning objectives:\n- Learners will understand how to functionalize the process and see a real-life example\n\nThis workshop is based on the following repository:\nhttps://github.com/RamiKrispin/lang2sql","detailLink":"","difficulty":"All Levels","displayStartTime":"02:00 PM - 03:00 PM ET","duration":"60","endTime":"3:00 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.y3vzai8wth2j","slackUrl":"https://live.odsc.com/channel/thu-rami-krispin-using-llm-to-query-data","speakerCompany":"Apple","speakerName":"Rami Krispin","speakerTitle":"Senior Manager - Data Science and Engineering ","subtrack":"Bootcamp","talkTitle":"Using LLM to Query Data","target":"","timeZone":"America/New_York","timerStartTime":"14:00:00","topicTag1":"","topicTag2":"LLMs&RAG","topicTag3":"Generative AI , LLMOps & MLOps, Data Engineering","topicTag4":"All Levels","track":"May 15","uniqueId":"BOS087","unlockable":true},{"_id":"BOS088","_updatedAt":"2025-05-14T13:43:39.878Z","access":"Platinum","active":"yes","date":"2025-05-13","description":"Abi Aryan, Founder | Abide AI\nPrerequisites/Links:\n\nIn this session, we will explore best practices for monitoring and debugging LLM pipelines for high-quality and trustworthy outputs. We will break down key observability components, including data drift detection, prompt response monitoring, latency tracking, and model performance evaluation. Attendees will gain insights into implementing structured logging, distributed tracing, and anomaly detection tailored to LLM architectures.\n\nBy the end of this session, attendees will be able to:\n\n1. Identify common failure modes in LLM pipelines and how to mitigate them.\n2. Implement monitoring strategies to detect hallucinations, degraded performance, and ethical risks.\n3. Use observability toolsand custom logging frameworks to improve model reliability.\n4. Design feedback loops for continuous evaluation and improvement in production environments.\n\nThis talk is ideal for ML/AI engineers and LLMOps practitioners working with LLMs in production. Whether you're building chatbots, retrieval-augmented generation (RAG) systems, or enterprise AI applications, this session will equip you with the right observability techniques to maintain trustworthy and high-performing models at scale.\nTools used:-\n\nLangSmith – for prompt debugging, dataset evaluation, and model tracing.\nMLflow – for experiment tracking and model performance comparison.\nPrometheus & Grafana – for real-time monitoring and alerting on model performance metrics.","detailLink":"","difficulty":"Intermediate-Advanced","displayStartTime":"11:05 AM - 12:05 PM ET","duration":"60","endTime":"12:05 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.ej4mmz5pduox","slackUrl":"https://live.odsc.com/channel/tue-abi-aryan-debugging-and-monitoring-llms-in-production","speakerCompany":"Abide AI","speakerName":"Abi Aryan","speakerTitle":"Founder","subtrack":"Bootcamp","talkTitle":"Debugging and Monitoring LLMs in Production","target":"","timeZone":"America/New_York","timerStartTime":"11:05:00","topicTag1":"","topicTag2":"LLMOPs& MLOPs","topicTag3":"","topicTag4":"Intermediate-Advanced","track":"May 13","uniqueId":"BOS088","unlockable":true},{"_id":"BOS089","_updatedAt":"2025-05-14T13:43:39.880Z","access":"Platinum","active":"yes","date":"2025-05-15","description":"Paul Iusztin, Senior AI Engineer / Founder | Decoding ML\nPrerequisites/Links:\n\nBuilding proof-of-concept LLM/RAG apps is easy—we know that. The next step, which consumes the most time and is the most challenging, is bringing the app to a production-ready level. You must increase accuracy, reduce latency and costs, and create reproducible results.\n\nYou must start optimizing your LLM and RAG layers to ensure compliance with all these requirements. You must begin digging into open-source LLMs, fine-tuning LLMs for your specialized tasks, optimizing them for inference, and so on.\n\nHowever, before optimizing anything, you must first determine what to optimize. Thus, you must quantify your system's key metrics (e.g., latency, costs, accuracy, recall, hallucinations, etc.).\n\nThus, as developing AI applications is an iterative process, the first critical step to getting to production is learning how to evaluate and monitor your LLM/RAG applications. The best strategy is to build something simple end-to-end, attach an evaluation layer on top of it, and then quickly iterate in the right direction by clearly indicating what needs improvement.\n\nThus, this workshop will focus on evaluating LLM/RAG apps. We will take a simple, predefined agentic RAG system built in LangGraph and understand how to evaluate and monitor it.\n\nTo do that, we will explore the following topics:\n\nAdd a prompt monitoring layer.\nVisualize the quality of the embeddings.\nEvaluate the context from the retrieval step used for RAG.\nCompute application-level metrics to expose hallucinations, moderation issues, and performance (using LLM-as-judges).\nLog the metrics to a prompt management tool to compare the experiments.","detailLink":"","difficulty":"Intermediate","displayStartTime":"10:30 AM - 11:30 AM ET","duration":"60","endTime":"11:30 AM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#heading=h.ev4r2sctydki","slackUrl":"https://live.odsc.com/channel/thu-paul-iusztin-llm-rag-evaluation-playbook-for-production-apps","speakerCompany":"Decoding ML","speakerName":"Paul Iusztin","speakerTitle":"Senior AI Engineer / Founder","subtrack":"Bootcamp","talkTitle":"LLM & RAG Evaluation Playbook for Production Apps","target":"","timeZone":"America/New_York","timerStartTime":"10:30:00","topicTag1":"","topicTag2":"LLMs","topicTag3":"Generative AI","topicTag4":"Intermediate","track":"May 15","uniqueId":"BOS089","unlockable":true},{"_id":"BOS090","_updatedAt":"2025-05-14T13:43:39.883Z","access":"Platinum","active":"yes","date":"2025-05-15","description":"Jun He, Staff Software Engineer | Netflix\nPrerequisites/Links:\n\nAt Netflix, Data/ML pipelines are essential to our business and are widely used for diverse use cases beyond recommendations, experimentation, predictions, and data transformations. As big data and ML have become more prevalent and impactful, the scalability, reliability, and usability of the orchestration ecosystem have increasingly become more important for our data engineers, analysts, scientists, and the company. To better serve various business needs at Netflix, we developed Maestro, a new workflow orchestrator that greatly improves the usability and scalability of the orchestration system and boosts the productivity of the engineers working with data. \n\nMaestro, now publicly available at https://github.com/Netflix/maestro, provides end users with a consistent way to define, execute, and monitor data pipelines and ML workflows to process data and train ML/AI models. Unlike traditional workflow orchestrators that only support Directed Acyclic Graphs (DAGs), Maestro supports both acyclic and cyclic workflows and also includes multiple reusable patterns, including foreach loops, subworkflows, and conditional branches, etc.\n\nIn this tutorial, we will dive deep into the publicly available features of Maestro. We will share how we built our distributed orchestration system to support running super-large-scale workflows, consisting of hundreds of thousands of jobs with nested structures. We will go over the patterns that our data engineers have built using Maestro features and show examples of those maestro workflows. We will discuss how Maestro is designed to provide a loose coupling between user workflows and the data platform infrastructure. Additionally, we will demonstrate how extensible Maestro is to support new use cases using modern technologies, e.g., Docker containers, Jupyter notebooks, event-based scheduling, etc.\n\nModule 1: Introduction to Maestro\nModule 2: Review of Data and ML Workflow Patterns\nModule 3: Demo of Maestro Engine\n\nThe attendees will learn what Maestro is and what features it provides. They will also learn how to set up Maestro locally and be able to run workflows for the Maestro open-source project locally (https://github.com/Netflix/maestro).\n\nKnow the workflow orchestration. Better to take a look at the Maestro open-source project (https://github.com/Netflix/maestro) before the tutorial.","detailLink":"","difficulty":"Intermediate","displayStartTime":"03:05 PM - 04:05 PM ET","duration":"60","endTime":"4:05 PM","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"https://docs.google.com/document/d/1xACJtFWZWFRLppRpnpDpKXbCv7equA-Yb8fR3ROmDR0/edit?tab=t.0#bookmark=id.ol1391nb30h0","slackUrl":"https://live.odsc.com/channel/thu-jun-he-maestro-netflixs-dataml-workflow-orchestrator","speakerCompany":"Netflix","speakerName":"Jun He","speakerTitle":"Staff Software Engineer","subtrack":"Bootcamp","talkTitle":"Maestro: Netflix’s Data/ML Workflow Orchestrator","target":"","timeZone":"America/New_York","timerStartTime":"15:05:00","topicTag1":"","topicTag2":"Data Engineering","topicTag3":"Machine Learning","topicTag4":"Intermediate","track":"May 15","uniqueId":"BOS090","unlockable":true},{"_id":"BOS091","_updatedAt":"2025-05-14T13:43:39.885Z","access":"General","active":"yes","date":"2025-05-14","description":"Dr. Greg Michaelson, Chief Product Officer & Co-Founder | Zerve AI\n\nAbstract:","detailLink":"","difficulty":"All Levels","displayStartTime":"03:45 PM - 04:15 PM ET","duration":"30","endTime":"04:15","event":"ODSC East 2025","language":"English","pictureUrl":"","preJoinTime":"5","prerequisite":"","replayLink":"","slackUrl":"https://live.odsc.com/channel/wed-greg-michaelson-saving-lives-with-data-science-how-data-science-shortened-the-covid-19-pandemic-by-2-months","speakerCompany":"Zerve AI","speakerName":"Dr. Greg Michaelson","speakerTitle":"Chief Product Officer & Co-Founder ","subtrack":"Solution Showcase","talkTitle":"Saving Lives with Data Science: How data science shortened the COVID-19 pandemic by 2 months","target":"","timeZone":"America/New_York","timerStartTime":"15:45:00","topicTag1":"","topicTag2":"","topicTag3":"","topicTag4":"All Levels","track":"May 14","uniqueId":"BOS091","webinarLink":"https://streamyard.com/watch/cb6Kmnfdp3y9"}]