{"success":true,"data":{"version":1747320147334,"sessions":[{"uniqueId":"DA1","key":"DA1","title":"GenAi X Keynote : Turning The AI Agent Future Into Reality","description":"AI agents are redefining how work gets done—but turning that promise into production reality requires more than just great models. In this keynote, I’ll explore a strategic framework for deploying AI agents that don’t just automate tasks, but fundamentally reshape workflows and decision-making. We’ll look at the patterns emerging across successful deployments, and what they tell us about the future of intelligent systems in the enterprise. From aligning agents with high-leverage business goals to designing for adaptability and trust, this talk will chart the path from prototype to transformative impact. The age of AI agents is here—this is how we make it real.","tags":["AI Agents","Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"9:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747141200000,"utcEndTimeMilliseconds":1747143000000,"displayStartTime":"9:00 AM","displayEndTime":"9:30 AM","location":"Room 204","sessionLevel":"All Levels","sessionType":"GenAi X Keynote","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"FtwSRecgh47hBeHSh","name":"Rob Bailey","linkedin":"","jobTitle":"COO & Co-Founder","company":"CrewAI","avatar":{"backgroundColor":"sienna","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/FtwSRecgh47hBeHSh/avatar/1745411024269.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA2","key":"DA2","title":"Ben Needs a Friend: Building a customized LLM-based assistant","description":"People say it’s difficult to make friends after college, impossible after grad school and just generally to give up after 30. Approaching 40 - I’ve decided to take matters into my own hands. Rather than go outside and meet people, I’ve decided, like many top-tier companies, to replace the manual work with AI. In this tutorial, I’ll show you how to make your own AI friend, powered by Large Language Models (LLMs).\n\nAlong the way, we’ll cover some of the essential topics in building LLM applications and fine-tuning them to purpose. First, we'll adjust our new friend to our preferences using in-context learning and supervised fine-tuning. Next, we will develop a “history” of the friendship using document embeddings and enable our friend to discuss that history (Retrieval-Augmented Generation). Finally, we will integrate a set of \"\"\"\"tools\"\"\"\" with our friend to enable them to provide services like inviting us to cool local events. We’ll be working with open source libraries (e.g. HuggingFace, Unsloth) and open-weight models (e.g. Llama 3), which will enable participants to build their own custom friends with minimal cost.\n\nBy the end of the tutorial, participants will have a basic familiarity with how to use the latest tools for LLM development and, for anything they’re not clear on, they can always ask their new AI friend for advice. We’ll conclude with a discussion of what our friend can and cannot do and why it may be better to just go outside more.","tags":["LLMs"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"9:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747141200000,"utcEndTimeMilliseconds":1747144800000,"displayStartTime":"9:00 AM","displayEndTime":"10:00 AM","location":"Room 206","sessionLevel":"Beginner","sessionType":"Tutorial","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"acjZqZ7WG55grcaEq","name":"Benjamin Batorsky","linkedin":"","jobTitle":"Lead Data Scientist","company":"GoGuardian","avatar":{"backgroundColor":"darkblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/acjZqZ7WG55grcaEq/avatar/1745411595068.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA3","key":"DA3","title":"Idiomatic Polars","description":"Polars can be tricky, and there is a lot of bad advice floating around. This tutorial will cut through some of the biggest issues I've seen with Pandas code after working with the library for a while and writing three books on it.\n \n We will discuss:\n \n * Proper types\n * Chaining\n * Aggregation\n * Debugging","tags":["Machine Learning"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"9:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747141200000,"utcEndTimeMilliseconds":1747144800000,"displayStartTime":"9:00 AM","displayEndTime":"10:00 AM","location":"Room 208","sessionLevel":"Intermediate","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"gXXmZokomgFSxxdYo","name":"Matt Harrison","linkedin":"","jobTitle":"Python & Data Science Corporate Trainer | Consultant","company":"MetaSnake","avatar":{"backgroundColor":"lightslategray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/gXXmZokomgFSxxdYo/avatar/1745410640425.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA4","key":"DA4","title":"Practical Explainability Techniques for Machine Learning Models","description":"Machine learning projects are rarely like a kaggle competition. It is thrilling to see your name jump up on the leaderboard which makes competitions exciting and dare I say addictive. However predictive power in real life is much less important than kaggle competitions would have you believe. Often it is just as important to understand why a model makes a certain prediction. The ‘why’ plays an important role during the model development phase as well as after deployment. Complex machine learning pipelines are difficult to debug and issues can go unnoticed. One way to help increase trust in the model during the development stage is to improve its interpretability. Subject matter experts usually can tell which features should be predictive in advance and if your model disagrees with their intuition, that’s a good reason to investigate further and it could point to mistakes in your pipeline. Explanations can be crucial after deployment too because often it is not enough to provide predictions only. If the model has significant impact (e.g., in finance or health care), explanations specific to each data point (e.g., a customer or a patient) are a must.\n\nWe will review a couple of methods and tools to calculate global and local explanations in this workshop. Global explanations provide an overview of your model and it answers questions like ‘Which features does my model rely on the most or least in general?’. Local explanations describe how much each feature contributes to the prediction of each data point. Local explanations are important if you need to measure the equity and fairness of your model.\n\nWe will start with linear models and we will discuss under what conditions the weights of linear models can be used as explanations. I will introduce the pros and cons of perturbation feature importance which is a model-agnostic approach to calculate global explanations. Some model-specific explanations will also be briefly discussed. And we will close with what might be the state of the art technique to calculate local feature importances: the Shapley Additive Explanations.\n\nWe will use python and packages like pandas, numpy, sklearn, XGBoost, and shap.","tags":["Machine Learning"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"9:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747141200000,"utcEndTimeMilliseconds":1747144800000,"displayStartTime":"9:00 AM","displayEndTime":"10:00 AM","location":"Room 207","sessionLevel":"Intermediate","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"WyR7m9Gb4Q9wqcJ3r","name":"Andras Zsom, PhD","linkedin":"","jobTitle":"Assistant Professor of the Practice, Director of Graduate Studies","company":"Data Science Institute, Brown University","avatar":{"backgroundColor":"ivory","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/WyR7m9Gb4Q9wqcJ3r/avatar/1745409407816.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA5","key":"DA5","title":"Mastering API Testing and Collaboration with AI Tools","description":"In this 60-minute workshop, join us to explore the essentials of API testing and collaboration, and discover how AI can enhance these processes. Designed for individuals and teams at all levels, this workshop offers a comprehensive introduction to Postman’s powerful API testing features, collaboration, plus an introduction to Postbot, Postman's AI assistant.\n\nAfter completing this workshop, attendees will be able to:\n\n    - Understand basic API testing concepts within Postman.\n\n    - Write and organize API test scripts.\n\n    - Master effective collaboration using different types of Postman workspaces—personal, team, partner, and public.\n\n  -   Fork, customize, and contribute to collections.\n\n   -  Gain hands-on experience by integrating Postbot into your API testing and documentation workflow.\n\nWhat You Should Know Beforehand\n\n   -  Basic understanding of APIs.\n\n    - Basic understanding of testing and documentation.\n\n    - Curiosity about how AI can help streamline API workflows.\n\nWho This Is For\n\nThis workshop is ideal for API developers, testers, AI enthusiasts, and leaders looking to enhance their team's skills in API testing and collaboration.","tags":["Generative AI","AI Engineering"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"9:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747141200000,"utcEndTimeMilliseconds":1747144800000,"displayStartTime":"9:00 AM","displayEndTime":"10:00 AM","location":"Room 209","sessionLevel":"All Levels","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"cx9AvFRZhGMrgGf8W","name":"Pooja Mistry\t","linkedin":"","jobTitle":"Developer Advocate \t","company":"Postman","avatar":{"backgroundColor":"peru","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/cx9AvFRZhGMrgGf8W/avatar/1746528128551.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA6","key":"DA6","title":"Building Trustworthy Agentic AI: Lessons from Real-World Deployments","description":"Many enterprises find themselves trapped in \"\"pilot purgatory,\"\" where AI projects stall before reaching full-scale deployment. How can IT leaders and decision-makers effectively move beyond proofs-of-concept to enterprise-wide adoption? What governance frameworks need to be in place for responsible scaling? This talk will uncover the key reasons AI initiatives fail to scale, the critical steps to break free, and the strategies needed to deploy trustworthy, high-impact AI at enterprise scale.\n\nThrough actionable frameworks, real-world case studies, and proven enterprise strategies, this session will equip AI leaders with the tools to successfully transition from pilots to production—ensuring AI delivers measurable business value, reliability, and long-term impact.","tags":["Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"9:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747143300000,"utcEndTimeMilliseconds":1747145100000,"displayStartTime":"9:35 AM","displayEndTime":"10:05 AM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"u33WsNhcj3jNCQ3co","name":"Manoj Saxena","linkedin":"","jobTitle":"Founder & CEO","company":"Trustwise","avatar":{"backgroundColor":"darkkhaki","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/u33WsNhcj3jNCQ3co/avatar/1745410356943.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA7","key":"DA7","title":"Building Effective AI Agents with AG2","description":"In this talk, Dr. Wu will explore the practical aspects of building effective AI agents using AG2 (formerly known as AutoGen), a powerful and versatile open-source Agent framework that supports the development of multi-agent systems. Drawing from real-world applications and research insights, she will demonstrate how AG2 enables developers to create sophisticated agent architectures that can handle complex tasks through structured collaboration. The session will cover key design principles, practical implementation strategies, and emerging patterns in AI agent development, providing attendees with actionable knowledge to enhance their own agent-based solutions.","tags":["AI Agents","AI Engineering"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"9:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747143300000,"utcEndTimeMilliseconds":1747145100000,"displayStartTime":"9:35 AM","displayEndTime":"10:05 AM","location":"Room 204","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"ZhmWb5SzF5rxLJu69","name":"Qingyun Wu, PhD","linkedin":"","jobTitle":"Founder","company":"AG2","avatar":{"backgroundColor":"mistyrose","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/ZhmWb5SzF5rxLJu69/avatar/1745410968939.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA8","key":"DA8","title":"Book Signing with Stefanie Molin , Author of Hands-On Data Analysis with Pandas","description":"Book Lovers Alert! Author Session with Free Giveaways!\nJoin us for an exciting session of talented author!  Discuss their work, gain insights into their creative process, and get a chance to get a free copy of their book (limited quantities available).","tags":["Book Signing"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747144800000,"utcEndTimeMilliseconds":1747146600000,"displayStartTime":"10:00 AM","displayEndTime":"10:30 AM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Book Signing","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"2GSyJ6JN5Bpx5zbxP","name":"Stefanie Molin","linkedin":"","jobTitle":"Data Scientist, Software Engineer, Author of Hands-On Data Analysis with Pandas","company":"Bloomberg","avatar":{"backgroundColor":"mediumaquamarine","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/2GSyJ6JN5Bpx5zbxP/avatar/1746528326317.png"}}],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA9","key":"DA9","title":"Practical Bayesian Modeling with PyMC","description":"In this tutorial, we explore Bayesian regression using PyMC -- the primary library for Bayesian sampling in Python -- focusing on survey data and other datasets with categorical outcomes. Starting with logistic regression, we’ll build up to categorical and ordered logistic regression, showcasing how Bayesian approaches provide versatile tools for developing and evaluating complex models. Participants will leave with practical skills for implementing Bayesian regression models in PyMC, along with a deeper appreciation for the power of Bayesian inference in real-world data analysis. Participants should be familiar with Python, the SciPy ecosystem, and basic statistics, but no experience with Bayesian methods is required.","tags":["Machine Learning"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:30:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747146600000,"utcEndTimeMilliseconds":1747153800000,"displayStartTime":"10:30 AM","displayEndTime":"12:30 PM","location":"Room 206","sessionLevel":"Intermediate-Advanced","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP"],"company":"","speakers":[{"key":"sCW7xkF9eosM2KMq4","name":"Allen Downey, PhD","linkedin":"","jobTitle":"Principal Data Scientist","company":"PyMC Labs","avatar":{"backgroundColor":"steelblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/sCW7xkF9eosM2KMq4/avatar/1745409283961.png"}},{"key":"zhdJtsEACGr45nmQr","name":"Alexander Fengler","linkedin":"","jobTitle":"Postdoctoral Researcher","company":"Brown University","avatar":{"backgroundColor":"greenyellow","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/zhdJtsEACGr45nmQr/avatar/1745409258236.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA10","key":"DA10","title":"Getting Started with Open Source Contributions","description":"The open source community is all about giving back and learning from one another. No matter how small, every contribution is valuable. And everyone can contribute something with a little bit of help. The hardest part is finding something to work on that fits your interests and skills.\n\nIn this talk, I will provide five ways that I used to get started contributing to different open source projects. I also share some guidance on selecting projects to contribute to and how to set yourself up for success. Get ready to start your open source journey!","tags":["Machine Learning"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747146600000,"utcEndTimeMilliseconds":1747148400000,"displayStartTime":"10:30 AM","displayEndTime":"11:00 AM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"2GSyJ6JN5Bpx5zbxP","name":"Stefanie Molin","linkedin":"","jobTitle":"Data Scientist, Software Engineer, Author of Hands-On Data Analysis with Pandas","company":"Bloomberg","avatar":{"backgroundColor":"mediumaquamarine","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/2GSyJ6JN5Bpx5zbxP/avatar/1746528326317.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA11","key":"DA11","title":"Building and Deploying LLM Application: Jupyter to Production in Streamlit and Beyond","description":"In this workshop, I will walk you through the process of building  Large Language Model (LLM) application, starting from Jupyter Notebook to deploying in production. \n\nThe workshop begins with a brief introduction on Large Language Model including it's use cases such as in content generation, question answering and many more. You'll then build a simple LLM application powered by models from OpenAI or Hugging Face. You'll first learn how to build a prototype in Jupyter notebook and then move to Visual Studio Code (VsCode) focusing on refactoring code for easy deployment. \n\nFor production, we'll leverage Github for storage and Streamlit for deployment creating an interactive web interface. Finally, we’ll explore alternative deployment options, including FastAPI for API development and Docker for containerization, covering best practices for performance and scalability in production.\n\nBy the end of this workshop, you’ll have the skills to develop, structure, and deploy LLM applications, making them ready for real-world use. This workshop is great for anyone who wants to understand what LLM is and how to develop and put the LLM powered application into production.","tags":["LLMOps & MLOps","Data Engineering"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:30:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747146600000,"utcEndTimeMilliseconds":1747153800000,"displayStartTime":"10:30 AM","displayEndTime":"12:30 PM","location":"Room 208","sessionLevel":"Beginner-Intermediate","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"BogXz39NtCB5T8X9v","name":"Sudip Shrestha, PhD","linkedin":"","jobTitle":"Data Science and AI Lead","company":"ASI Government","avatar":{"backgroundColor":"tan","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/BogXz39NtCB5T8X9v/avatar/1745411295303.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA12","key":"DA12","title":"Modular RAG Architectures: Integrating LLMs, Data Stores, and Prompt Engines","description":"Chatbots leveraging large language models (LLMs) are increasingly popular for their conversational and reasoning abilities. However, the lack of standardized frameworks hampers consistent development and integration. The Retrieval-Augmented Generation (RAG) architecture, combining a knowledge base (via a vector store) with generative models, is emerging as the standard to address issues like hallucinations and outdated responses. This talk showcases the implementation of an ecosystem orchestration framework using microservices, featuring composable building blocks for generative AI, including LLMs, data stores, and prompt engines. It provides architectural blueprints for the RAG stack, end-to-end workflows, and a four-step assessment for evaluating performance, features, trustworthiness, and enterprise readiness. The flexible design allows easy modification of components, accelerating GenAI adoption and delivering business value.","tags":["LLMs"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:30:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747146600000,"utcEndTimeMilliseconds":1747153800000,"displayStartTime":"10:30 AM","displayEndTime":"12:30 PM","location":"Room 209","sessionLevel":"Beginner-Intermediate","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"BpN652enyat5Fr4yu","name":"Ezequiel Lanza","linkedin":"","jobTitle":"Open Source AI Evangelist","company":"Intel","avatar":{"backgroundColor":"lightskyblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/BpN652enyat5Fr4yu/avatar/1745409950128.png"}},{"key":"L6tYR237bunwLsfdy","name":"Murilo Gustineli","linkedin":"","jobTitle":"Senior AI Software Solutions Engineer","company":"Intel","avatar":{"backgroundColor":"mediumslateblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/L6tYR237bunwLsfdy/avatar/1745410701638.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA13","key":"DA13","title":"Panel Discussion: AI and Data Democratization at Scale: How Synthetic Data Fuels the Future of Enterprise AI","description":"Leading enterprises are working toward AI democratization. A future, where every employee – not just data scientists and technical experts – is augmented by AI in their daily work. With the rise and advances of LLMs, self-service analytics, data exploration via natural language and even prototyping new ideas becomes a feasible reality even for non technical business users./at their fingertips of every business user\n\nBut here’s the challenge: off-the-shelf AI tools like ChatGPT, trained solely on public data, can’t deliver the contextual, proprietary insights that enterprises need to drive real business value. To fully realize the promise of AI democratization, businesses must bring their own enterprise data into the equation.\nYet doing so raises urgent questions: How can enterprises safely unlock sensitive, high-value data without jeopardizing privacy, security, or compliance? This is where synthetic data steps in — emerging as a new standard, privacy-safe data asset within modern enterprises’ data strategies.\n\nThis panel will explore how enterprises are moving toward AI democratization and how synthetic data–driven data democratization is enabling it at scale. We’ll share key considerations, real-world use cases, and lessons learned in overcoming common challenges, as well as how synthetic data helps in preparing for AI agents as the next frontier of enterprise AI.","tags":["GenAi X Panel"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:30:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747146600000,"utcEndTimeMilliseconds":1747150200000,"displayStartTime":"10:30 AM","displayEndTime":"11:30 AM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Panel","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"csSvcEApiwqsRHexf","name":"Dr. Jon Krohn","linkedin":"","jobTitle":"CEO","company":"Y Carrot","avatar":{"backgroundColor":"thistle","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/csSvcEApiwqsRHexf/avatar/1745409875484.png"}},{"key":"heLe7mtj8GHEZLudj","name":"Cal Al-Dhubaib","linkedin":"","jobTitle":"Head of AI and Data Science","company":"Further","avatar":{"backgroundColor":"mediumblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/heLe7mtj8GHEZLudj/avatar/1745409621622.png"}},{"key":"eB2uJz4n2uFzZhjFw","name":"Alexandra Ebert","linkedin":"https://www.linkedin.com/in/alexandraebert","jobTitle":"Chief AI & Data Democratization Officer at MOSTLY AI | OECD.AI Expert AI & Privacy | IEEE Synthetic Data Chair | Podcast Host","company":"MOSTLY AI","avatar":{"backgroundColor":"pink","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/eB2uJz4n2uFzZhjFw/avatar/1745409277504.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA14","key":"DA14","title":"From Prompts to Pipelines: Applying RAG in Real-World AI Workflows","description":"This strategic, hands-on session, will focus on  prompt engineering and seeing the Retrieval Augmented Generation (RAG) in action. Attendees will be expected to execute and write python Code in a python notebook. They will also be given a full week free trial of SAP Generative AI Hub to continue to explore and experiment at their own pace.","tags":["LLMs","RAG","Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:30:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747146600000,"utcEndTimeMilliseconds":1747150200000,"displayStartTime":"10:30 AM","displayEndTime":"11:30 AM","location":"Room 207","sessionLevel":"All Levels","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"MP7L4k4N9BWCTpjCr","name":"SK Balaji","linkedin":"","jobTitle":"Sr Director, Business Technology Platform Everywhere, COE","company":"SAP","avatar":{"backgroundColor":"brown","source":""}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA15","key":"DA15","title":"Unlock AI Potential with Metadata Knowledge","description":"As Artificial Intelligence (AI) evolves, integrating knowledge graphs into retrieval and reasoning processes has made metadata management more critical than ever. Metadata provides essential context, structure, lineage, and provenance, allowing AI systems to understand relationships between data points and avoid reliance on outdated or unverified sources. It optimizes navigation through massive graphs, reducing redundant computations and ensuring efficiency, accuracy, and scalability. Without proper metadata, AI can become confused, biased, or even hallucinate. Effective metadata management enhances data discoverability, mitigates biases, and prevents data drift by maintaining transparency and traceability throughout the AI lifecycle. This demonstration highlights how metadata management, semantic modeling, and connected technologies—powered by Affirma—advances AI systems, keeps them context aware, intelligent, compliant, and mostly out of trouble.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747146600000,"utcEndTimeMilliseconds":1747148400000,"displayStartTime":"10:30 AM","displayEndTime":"11:00 AM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"6cvWHRoarWopR4Zod","name":"Michael Covarrubias","linkedin":"","jobTitle":"VP of Digital Data Solutions and Services, Xtensible a SAM Company; Board of Director SemanticWorx\t","company":"Xtensible","avatar":{"backgroundColor":"ghostwhite","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/6cvWHRoarWopR4Zod/avatar/1747062171286.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA16","key":"DA16","title":"Demystifying Domain Specific Language in feature engineering: A deep dive","description":"Session Objective:\nThis session discusses the role of Domain Specific Language (DSL) in feature stores for machine learning. Feature engineering is the process of transforming raw data into insightful features. Feature stores help manage these features, ensuring consistency, reusability, and version control. However, traditional User Defined Functions (UDF) used for feature transformations can be complex, inconsistent, and inefficient. DSL offers a user-friendly alternative, streamlining feature creation, improving consistency, and potentially boosting performance.\n\nLearning Outcomes:\nBy the end of this session, attendees will be able to:\n1.Understand the concept and benefits of a Managed Feature Store in Azure ML. Feature stores offer a comprehensive solution for managing features in a complex machine learning environment.\n2.Learn how to use DSL to easily manage and define features programmatically. By simplifying the definition of common aggregations, DSL streamlines the feature creation process, improves consistency, and enhances performance.\n3.Gain insights into best practices for defining features by finding a balance between DSL and UDF, improving consistency and performance.\n\nTarget Industry:\nThe tools and techniques covered are relevant for any industry looking to scale feature engineering efforts and enhance collaboration among data scientists and engineers.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"10:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747146600000,"utcEndTimeMilliseconds":1747148400000,"displayStartTime":"10:30 AM","displayEndTime":"11:00 AM","location":"Demo B","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"v5xBsrmQs7Dmamdsg","name":"Bhala Ranganathan","linkedin":"","jobTitle":"Principal Software Engineer","company":"Microsoft","avatar":{"backgroundColor":"plum","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/v5xBsrmQs7Dmamdsg/avatar/1746790682433.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA17","key":"DA17","title":"Give Your AI the Keys to the Web","description":"Large language models excel at gleaning knowledge from static training data, but they lack the ability to discover and interact with live web content. This talk addresses that gap by presenting the building blocks that let AI seamlessly navigate websites, find relevant information, and perform complex tasks in real time. We’ll tackle common challenges—overcoming rate limits, parsing dynamic content, and orchestrating data pipelines—and share solutions that leverage search engines, remote browsers, and robust retrieval workflows. Attendees will walk away with proven strategies and open-source tools for extending AI capabilities deeper into the Web, unlocking new levels of intelligent automation.","tags":["LLMOps & MLOps","Data Engineering"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"11:05:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747148700000,"utcEndTimeMilliseconds":1747150500000,"displayStartTime":"11:05 AM","displayEndTime":"11:35 AM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"vtBsyJ7rxS3fuaiRE","name":"Ariel Shulman","linkedin":"","jobTitle":"CPO","company":"Bright Data","avatar":{"backgroundColor":"chartreuse","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/vtBsyJ7rxS3fuaiRE/avatar/1745409470418.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA18","key":"DA18","title":"Rapid Agent Development and Deployment on Vertex AI","description":"This demo will quickly showcase to developers how straightforward it is to begin building and deploying a simple agent using Vertex AI, briefly covering ADK and Agent Engine.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"11:05:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747148700000,"utcEndTimeMilliseconds":1747150500000,"displayStartTime":"11:05 AM","displayEndTime":"11:35 AM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"hiaPjMq8aFsL2cHhv","name":"Ivan Nardini","linkedin":"","jobTitle":"Developer Relations ","company":"Google","avatar":{"backgroundColor":"seagreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/hiaPjMq8aFsL2cHhv/avatar/1747059869601.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA19","key":"DA19","title":"Agentic Coding with Windsur","description":"In this presentation, we explore how to build a RAG-powered chatbot using Windsurf, the first agentic IDE. Retrieval-Augmented Generation (RAG) is revolutionizing chatbot development by combining the strengths of retrieval-based and generative AI models. We will cover the key components of a RAG pipeline and showcase practical techniques for integrating it with large language models (LLMs). Attendees will gain hands-on insights into deploying a chatbot that delivers accurate, context-aware responses while efficiently leveraging external knowledge sources. Whether you're a developer, researcher, or AI enthusiast, this session will equip you with the tools and strategies to build powerful AI-driven conversational agents.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"11:05:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747148700000,"utcEndTimeMilliseconds":1747150500000,"displayStartTime":"11:05 AM","displayEndTime":"11:35 AM","location":"Demo B","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"RsBq9Am4cyN8Zu9h9","name":"Numair Baseer","linkedin":"","jobTitle":"Deployed Engineer","company":"Codeium","avatar":{"backgroundColor":"deeppink","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/RsBq9Am4cyN8Zu9h9/avatar/1746790690016.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA20","key":"DA20","title":"Getting Started with AI Agents","description":"You've probably read and heard a lot about 2025 being the year of AI Agents. AI Agents are indeed transforming the way indivuduals and businesses approach automation, decision-making, and productivity. However, for many, the concept of AI Agents remains abstract, and the process of building them seems complex. In this talk, we'll demistify the process of getting started with AI Agents, focusing on practical and reproducible workflows.\n\nKey takeaways include:\n- A clear understanding of what AI agents are and why they matter.\n- Step-by-step guidance on setting up a basic AI agent using open-source tools.\n- Insights into real-world applications and how to expand functionality.","tags":["AI Agents"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"11:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747150500000,"utcEndTimeMilliseconds":1747154100000,"displayStartTime":"11:35 AM","displayEndTime":"12:35 PM","location":"Room 207","sessionLevel":"Intermediate-Advanced","sessionType":"Tutorial","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"j7Nb5KhjJEkTofEJg","name":"Tony Kipkemboi","linkedin":"","jobTitle":"Senior Developer Advocate","company":"CrewAI","avatar":{"backgroundColor":"mintcream","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/j7Nb5KhjJEkTofEJg/avatar/1745411368714.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA21","key":"DA21","title":"Unleash the power of AI with trusted business data from SAP","description":"Join us for an insightful session on \"SAP Business Data Cloud,\" where we \nexplore the transformative potential of this innovative solution for data-\ndriven enterprises.\nSAP Business Data Cloud is a fully managed SaaS solution that unifies and \ngoverns all SAP data and seamlessly connects with third-party data—giving \nline-of-business leaders context to make even more impactful decisions.\nThe session will delve into the significance and functionalities of SAP \nBusiness Data Cloud, highlighting its pivotal role in enhancing data \nmanagement and analytics.\n \nIn this session, we’ll dive into the following topics:\n \n• Unleashing transformative insights with data products and prebuilt \nanalytical apps across all lines of business\n• Connecting all your SAP and third-party data with zero copies \n• Fueling AI activities with semantically rich data","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"11:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747150800000,"utcEndTimeMilliseconds":1747152600000,"displayStartTime":"11:40 AM","displayEndTime":"12:10 PM","location":"Demo B","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"pCurowoaNakGwgFJX","name":"Phil Jackson","linkedin":"","jobTitle":"Senior Solution Advisor","company":"SAP","avatar":{"backgroundColor":"snow","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/pCurowoaNakGwgFJX/avatar/1747134730623.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA22","key":"DA22","title":"The 2025 Shift to Smaller Models: Why Specialized AI Will Win","description":"The initial excitement surrounding large language models (LLMs) is giving way to a new reality: the era of rapid, disruptive improvements is waning. As enterprises transition from proof-of-concept to production deployments, the spotlight is turning to smaller, specialized models. This presentation argues that fine-tuned and distilled SLMs, optimized for specific tasks and datasets, will constitute the vast majority of deployed generative AI applications. Attendees will learn the critical trends driving this shift, gain practical guidance for building with SLMs, and receive insights into the future of GenAI in the enterprise.","tags":["LLMs"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"11:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747150800000,"utcEndTimeMilliseconds":1747152600000,"displayStartTime":"11:40 AM","displayEndTime":"12:10 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"fSvAbgcx8ykXHJ64R","name":"Ivan Lee","linkedin":"","jobTitle":"CEO","company":"Datasaur","avatar":{"backgroundColor":"dimgrey","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/fSvAbgcx8ykXHJ64R/avatar/1746528481566.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA23","key":"DA23","title":"Starting an AI Startup: Some Thoughts on Where and What to Build","description":"AI has undergone an incredible period of growth in terms of technological capabilities as well as the set of opportunities to disrupt existing software markets. This talk discusses some recent developments with a focus on a few emerging trends in (1) AI Infrastructure and (2) AI Applications.\n\nOn the infrastructure side, Foundation Models have recently begun their graduation from technologies delivered as chatbots or APIs to those that may control browser and mobile device environments. These new settings present exciting capabilities but require an array of novel tooling from web understanding to model compression which we’ll detail in the first portion of the talk.\n\nThe collection of industries that AI is exposed to as application areas continues to grow with those in the physical domain (biotechnology, manufacturing, transportation) as a recent focus. We’ll discuss the trajectory of key enabling technologies for this group of applications including multimodal models, robot learning, and simulation.","tags":["Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"11:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747150800000,"utcEndTimeMilliseconds":1747152600000,"displayStartTime":"11:40 AM","displayEndTime":"12:10 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"3q7GyPWmhkT7rsCq9","name":"Vig Sachidananda, PhD","linkedin":"","jobTitle":"Investor","company":"Gradient","avatar":{"backgroundColor":"olivedrab","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/3q7GyPWmhkT7rsCq9/avatar/1745411411821.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA24","key":"DA24","title":"Building Reliable AI Workflows","description":"Building reliable AI agents is challenging—many teams struggle with bugs, hallucinations, and unpredictable behavior when deploying these systems. At Vellum, we've noticed that companies who adopt test-driven development approaches tend to have better results with their AI implementations.\nIn this practical session, Aaron will share actionable strategies and real world lessons from working with some of the most seasoned teams building AI systems. This session's focus will be to:\nDemonstrate how to adapt TDD principles specifically for AI agents\nShare practical, battle-tested strategies for enhancing system reliability\nBreak down different categories of agentic behavior and their applications\nShowcase what's achievable today and preview emerging innovations in the field\nFor teams working to build dependable AI-powered workflows that deliver consistent results, this session provides essential insights and actionable techniques you can implement immediately.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"11:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747150800000,"utcEndTimeMilliseconds":1747152600000,"displayStartTime":"11:40 AM","displayEndTime":"12:10 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"bHdWPEL3DzkEjnjAt","name":"Noa Flaherty","linkedin":"","jobTitle":"CTO & Founder","company":"Vellum","avatar":{"backgroundColor":"navy","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/bHdWPEL3DzkEjnjAt/avatar/1747065434396.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA25","key":"DA25","title":"Roundtable Discussion: Scaling AI in the Enterprise: Overcoming Deployment, Investment, and Governance Challenges moderated by Sid Probstein","description":"As AI adoption accelerates, executives across industries face significant challenges in deploying AI solutions at scale. This exclusive roundtable brings together AI leaders to discuss strategic approaches to integrating AI, optimizing investments, and addressing key operational and ethical considerations.\nKey Focus Areas:\nScaling AI Solutions – Overcoming deployment challenges for LLMs, AI agents, and retrieval-augmented generation (RAG).\nAI Integration & Adoption – Addressing organizational and cultural barriers to AI implementation.\nAI Ethics & Risk Management – Mitigating bias, ensuring privacy, and aligning AI with regulatory frameworks.\nSecurity in ML Deployment – Navigating the pitfalls of running ML in secured environments, including model protection, data privacy, and compliance with security standards. \nUse Cases and Applications","tags":["Executive RoundTable"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"12:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747152000000,"utcEndTimeMilliseconds":1747155600000,"displayStartTime":"12:00 PM","displayEndTime":"1:00 PM","location":"Room 212","sessionLevel":"All Levels","sessionType":"Round Table Discussion","ticketTypes":["Invited Attendees Only"],"company":"","speakers":[{"key":"poCnDp3WgBbHQzrMz","name":"Sid Probstein","linkedin":"","jobTitle":"CEO\t","company":"SWIRL","avatar":{"backgroundColor":"mistyrose","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/poCnDp3WgBbHQzrMz/avatar/1746534509978.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA26","key":"DA26","title":"The Secret Formula Behind Social Media","description":"We've all used social media and we all know that what we see is shaped by an algorithm. But how does that algorithm actually work? It turns out there's a surprisingly simple math formula behind most social media platforms---I'll explain how this formula leaked, and how you can use it to have a better experience online.\n\nYou'll learn how to better use social media platforms by having more knowledge of the algorithm driving them.","tags":["Machine Learning","Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"12:15:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747152900000,"utcEndTimeMilliseconds":1747154700000,"displayStartTime":"12:15 PM","displayEndTime":"12:45 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"DTqmyQMfmQb3fsLDr","name":"Noah Giansiracusa, PhD","linkedin":"","jobTitle":"Associate Professor of Mathematics and Data Science","company":"Bentley University","avatar":{"backgroundColor":"midnightblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/DTqmyQMfmQb3fsLDr/avatar/1745410734837.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA27","key":"DA27","title":"Enabling Evolutionary Architecture in Data Engineering","description":"The evolution of software engineering has embraced micro-services and modular design, enabling resilience and adaptability in complex systems. However, data engineering remains rooted in monolithic architectures and outdated practices. This talk draws from decades of experience in data and software engineering, advocating for the application of modern software concepts—such as Domain Driven Design and Continuous Integration\\Deployment—to data systems. By embracing modularity, data contracts, and emerging tools like dbt, data professionals can address challenges such as siloed systems, centralized ownership, and inflexible processes. This session will provide practical guidance for shifting toward an anti-monolith architecture and fostering innovation in data engineering.\n\nKey Takeaways\nModularity in Data Engineering: Breaking down monolithic data systems into independent components integrated via data contracts.\nEvolutionary Architecture: Leveraging microservice patterns for low-risk upgrades and adaptability in data systems.\nAdopting Software Principles: Implementing CI/CD, automated testing, and observability in data engineering.\nData Mesh: A socio-technical approach to decentralizing data architecture and enabling interoperability.\nTools and Technologies: Utilizing dbt, automated quality checks, and cross-project references to modernize workflows.\nPractical Next Steps: Incremental actions for embracing anti-monolith design and modernizing data practices.","tags":["Data Engineering"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"12:15:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747152900000,"utcEndTimeMilliseconds":1747154700000,"displayStartTime":"12:15 PM","displayEndTime":"12:45 PM","location":"Room 204","sessionLevel":"Intermediate-Advanced","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"fkZhqwMDFZfTP6gjk","name":"Elliott Cordo","linkedin":"","jobTitle":"Founder, Architect, Builder","company":"Datafutures","avatar":{"backgroundColor":"grey","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/fkZhqwMDFZfTP6gjk/avatar/1745409915687.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA28","key":"DA28","title":"Gurobi Optimization: Transform Predictions into Actionable, Explainable Decisions using Optimization","description":"Organizations have been investing heavily in traditional machine learning (ML), deep learning, and now generative AI (GenAI). However, truly impactful decision intelligence solves the most complex business problems using more than accurate predictions or multimodal content generation—it demands fast, scalable, and explainable decision-making. By integrating mathematical optimization into their AI strategies, businesses can unlock provably unmatched efficiency, with the ability to explain decisions and scalability required for smarter, more reliable outcomes.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"12:15:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747152900000,"utcEndTimeMilliseconds":1747154700000,"displayStartTime":"12:15 PM","displayEndTime":"12:45 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"Sp9h4AfmccHAHM78D","name":"Jennifer Locke","linkedin":"","jobTitle":"Manager of Technical Account Management, Americas, Gurobi Optimization & Summer Purschke, Technical Account Manager, Gurobi","company":"Gurobi","avatar":{"backgroundColor":"plum","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/Sp9h4AfmccHAHM78D/avatar/1746809025777.png"}},{"key":"SAaj5AqF3fDtJt9xL","name":"Summer Purschke","linkedin":"","jobTitle":"Technical Account Manager","company":"Gurobi","avatar":{"backgroundColor":"cornsilk","source":""}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA29","key":"DA29","title":"Building Agentic Flows: From apps and data to agents and knowledge with Hypermode","description":"This session introduces a comprehensive framework for orchestrating tools, models, and context for production-ready AI agents. Today’s AI world requires a fundamental rethinking for organizations to approach the strategic integration of contextual information — which is emerging as the most critical determinant of AI system effectiveness. This is driving how organizations are approaching data quality, model proliferation, and AI expertise.\n\nWe'll explore how senior software engineers and ML practitioners can leverage Hypermode to rapidly build and deploy AI-native architectures that remove toil from critical business processes. Attendees will learn how to construct flows where AI agents and humans collaborate seamlessly, while the system continuously updates with new data and non-deterministic outputs.\n\nKey learning outcomes include:\n\nArchitecting agents that map directly to business processes using an interactive approach and leverage knowledge graphs\nImplementing enterprise-ready observability, security, and integration capabilities missing from existing agent frameworks\nLeveraging model optionality while maintaining consistent business logic across your AI agents\nAccelerating development through pre-built components and simplified system integration\nThis session is particularly valuable for data science and software development teams tasked with building production-ready AI agents within enterprise constraints. Attendees will gain practical knowledge applicable across financial services, travel, media, and other industries currently struggling with the gap between AI capabilities and enterprise requirements.\n\nJoin us to discover how to bridge the gap from traditional development to agentic services where you will orchestrate dozens of models, hundreds of agents and thousands of tools.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"12:15:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747152900000,"utcEndTimeMilliseconds":1747154700000,"displayStartTime":"12:15 PM","displayEndTime":"12:45 PM","location":"Demo B","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"M6rFQPByCLNFXA6bc","name":"Ryan Fox-Tyler","linkedin":"","jobTitle":"Senior Vice President of Products and Engineering","company":"Hypermode","avatar":{"backgroundColor":"beige","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/M6rFQPByCLNFXA6bc/avatar/1746790622925.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA30","key":"DA30","title":"Bring Accelerated Computing to Data Science in Python","description":"As data science continues to evolve, the ever-growing size of datasets poses significant computational challenges. Traditional CPU-based processing often struggles to keep pace with the demands of modern machine learning and data analytics workflows. Accelerated computing with GPUs offers a solution by enabling massive parallelism and significantly reducing processing times for data-heavy tasks.\n\nIn this session, we will explore GPU computing architecture, how it differs from CPUs, and why it is particularly well-suited for data science workloads. We'll cover different approaches to GPU programming, from low-level CUDA coding to high-level Python libraries within RAPIDS such as, CuPy, cuDF, cuGraph, and cuML, making GPU acceleration accessible to data scientists of all skill levels.\n\nThrough real-world use cases, we’ll demonstrate the performance benefits of accelerated data processing, from data wrangling and feature engineering to model training and inference. Attendees will also get hands-on experience in a lab session, walking through an end-to-end machine learning workflow using GPU-accelerated libraries to achieve faster and more efficient data science pipelines.\n\nFinally, we'll provide practical tips on how to best utilize GPUs, optimize resource allocation, and maximize efficiency gains for different types of workloads. Whether you're new to GPU computing or looking to enhance your existing workflows, this session will equip you with the knowledge and tools to supercharge your data science projects with accelerated computing.","tags":["Machine Learning","Data Visualization & Analysis","Data Engineering"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747159200000,"utcEndTimeMilliseconds":1747162800000,"displayStartTime":"2:00 PM","displayEndTime":"3:00 PM","location":"Room 207","sessionLevel":"All Levels","sessionType":"Workshop","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"pYpW3PRjsRrF5tKKr","name":"Kevin Lee","linkedin":"","jobTitle":"Senior Technical Content Developer","company":"NVIDIA","avatar":{"backgroundColor":"papayawhip","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/pYpW3PRjsRrF5tKKr/avatar/1745410330085.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA31","key":"DA31","title":"Beyond Benchmarks: Evaluating AI Agents, Multimodal Systems, and Generative AI in the Real World","description":"As AI systems evolve beyond text-based models into autonomous agents, multimodal AI, and retrieval-augmented generation (RAG) workflows, traditional evaluation methods can fall short. This session explores cutting-edge techniques for assessing AI agents, from tool selection accuracy and decision-making metrics to biases in multi-agent collaboration. We’ll break down multimodal evaluation challenges, ensuring models generate coherent and contextually grounded outputs across text, images, and audio. For RAG pipelines, we’ll tackle precision, recall, and factuality benchmarks that measure how well retrieval enhances generation. Finally, we’ll discuss hallucination detection, trustworthiness scoring, and real-world performance monitoring for AI-driven applications. Attendees will leave with actionable strategies to design evaluation frameworks that go beyond academic benchmarks, ensuring AI systems are measurable, reliable, and ready for deployment at scale.","tags":["LLMs"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:00:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747159200000,"utcEndTimeMilliseconds":1747166400000,"displayStartTime":"2:00 PM","displayEndTime":"4:30 PM","location":"Room 206","sessionLevel":"Intermediate-Advanced","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP"],"company":"","speakers":[{"key":"SS8dBHfGqBfZJKb9J","name":"Sinan Ozdemir","linkedin":"","jobTitle":"AI & LLM Expert | Author | Founder + CTO","company":"LoopGenius","avatar":{"backgroundColor":"gainsboro","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/SS8dBHfGqBfZJKb9J/avatar/1745411164915.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA32","key":"DA32","title":"Getting Started with Computer Vision - a Workshop for Impatient Beginners","description":"While Natural Language Models (LLMs) have lately garnered a huge amount of attention, Computer Vision (CV) AI has been successfully applied in a wide range of applications for at least the last decade.\nI am sure you have played with LLMs at some level. Well you should also be doing the same with CV models. \n\nThe goal of this workshop is to get you grounded in:\n1. What is Computer Vision\n2. Where can you use it - I am sure there are some areas you have not thought of\n3. Then hands on with the flow from data -> training a model -> using the model to do work\n\nI want you to leave with the ability to go home and:\n1. Be grounded in some basic CV terminology and workflows\n2. Have hands on experience with the process of training and using CV models\n3. Be the life of the party and dazzle people with your fascinating knowledge of computer vision\n\nAll the exercises will be done in Github Codespaces so you can revisit them whenever you please. Come get a guided introduction into using AI for more than just a chatbot.","tags":["Machine Learning"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:00:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747159200000,"utcEndTimeMilliseconds":1747166400000,"displayStartTime":"2:00 PM","displayEndTime":"4:30 PM","location":"Room 208","sessionLevel":"All Levels","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"qAdJ4mXssmRwQwpog","name":"Steven Pousty, PhD","linkedin":"","jobTitle":"Principal and Founder ","company":"Tech Raven Consulting","avatar":{"backgroundColor":"deepskyblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/qAdJ4mXssmRwQwpog/avatar/1745411265802.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA33","key":"DA33","title":"AI + Mathematical Optimization: Build Smarter Decision-Making Models","description":"In the world of data science, teams are often deeply familiar with statistical and machine learning techniques. With the rapid rise of AI—especially generative AI—the scope of solvable problems has expanded dramatically. However, one powerful yet often overlooked tool remains crucial for tackling complex decision-making challenges: mathematical optimization.\n\n While AI-driven techniques like deep learning and reinforcement learning have dominated recent advancements, mathematical optimization offers a transparent, robust and highly efficient approach to solving constrained decision problems. Unlike traditional machine learning, which focuses on predictive analytics, mathematical optimization is prescriptive— it enables organizations to make optimal decisions while adhering to business constraints and operational rules. Mathematical optimization has been successfully applied across industries for decades, offering robust solutions where AI and machine learning alone may fall short, yet remains underutilized in modern AI-driven workflows.","tags":["Machine Learning"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747159200000,"utcEndTimeMilliseconds":1747162800000,"displayStartTime":"2:00 PM","displayEndTime":"3:00 PM","location":"Room 209","sessionLevel":"All Levels","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"Ya32gZYqnKK8iherB","name":"Yash Puranik","linkedin":"","jobTitle":"Director of Decision Sciences","company":"Aimpoint","avatar":{"backgroundColor":"gray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/Ya32gZYqnKK8iherB/avatar/1745411531716.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA34","key":"DA34","title":"Democratizing Data: How AI Agents Are Empowering Decision-Making Across Every Team","description":"Data is the new oil, but it’s useless if you can’t access or understand it. In this session, Amit will reveal how AI agents are democratizing data, making it accessible to everyone—not just data scientists—enabling rapid, data-driven decision-making across teams. With his experience building BoostKPI, an AI-powered data analyst, Amit will showcase how AI can automate root-cause analysis, cut down hours of work into minutes, and transform how businesses tackle data problems.\nAttendees will learn how AI agents can act as personal assistants for every team member, offering real-time insights, proactive alerts, and automating complex analysis. This session will also explore how enterprises can embrace AI to break down data silos, accelerate decision-making, and outpace competitors who are still relying on outdated methods.\nBy the end of this talk, attendees will understand how AI is reshaping data workflows and the consequences of falling behind in the AI revolution.","tags":["Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747159200000,"utcEndTimeMilliseconds":1747161000000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"8sGCJBEeEbvwMyq3M","name":"Amit Manjhi, PhD","linkedin":"","jobTitle":"Member of Technical Staff","company":"Inflection AI","avatar":{"backgroundColor":"indigo","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/8sGCJBEeEbvwMyq3M/avatar/1745409308975.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA35","key":"DA35","title":"Building AI Applications the Pydantic Way","description":"AI is becoming an increasingly common part of software development, but best practices for building and maintaining AI-powered applications are still evolving. Many developers are experimenting with LLMs, but figuring out how to structure AI applications effectively—let alone debug and monitor them—can be a challenge.\n\nThe good news? AI development is just software development—with a few unique twists. You don't need to reinvent engineering principles to work with LLMs, but you do need the right design patterns and development tools to build reliable AI applications efficiently.\n\nIn this talk, we'll share an opinionated blueprint for AI development in Python, covering both PydanticAI, an open-source AI agent framework, and Pydantic Logfire, an observability platform that helps you understand and debug your AI applications. You'll learn practical techniques for structuring LLM-powered systems, tracking and evaluating model behavior, and integrating AI features into larger software projects—using familiar tools and proven patterns.\n\nWhether you're already building AI applications or just curious about how best to approach them, this session will give you a clear, pragmatic foundation for writing AI-powered software in Python.\n\nYou'll learn practical techniques for structuring LLM-powered systems, tracking and evaluating model behavior, and integrating AI features into larger software projects—using familiar tools and proven patterns.","tags":["AI Engineering"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747159200000,"utcEndTimeMilliseconds":1747161000000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"9h7du59zz2LS46XnF","name":"Samuel Colvin","linkedin":"","jobTitle":"CEO & Founder","company":"Pydantic","avatar":{"backgroundColor":"papayawhip","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/9h7du59zz2LS46XnF/avatar/1745411106095.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA36","key":"DA36","title":"Reimagining the Sales Funnel: A Laboratory Model for Interactive Sales Analytics with Plotly Dash Enterprise","description":"Sales funnels are the lifeblood of many large organizations—but designing analytics to support them is harder than it looks. Different stages in the funnel often require different tools, perspectives, and levels of granularity. In some cases, context across the entire funnel is critical; in others, drilling deep into one stage is the priority. What’s missing from many analytics stacks is a unified, flexible framework that supports both macro and micro views—while also evolving alongside the organization’s sales strategy. \nThis talk presents a “laboratory” model for sales funnel analytics using Plotly Dash Enterprise as the foundation. We’ll explore how the funnel itself can serve as the central organizing structure for analytics—making dashboards intuitive for sales teams—while still allowing analytic designers to layer in adjacent tools, historical data, and contextual views over time.\nPart case study, part demo, and part strategy conversation, this session will offer concrete lessons learned from managing sales analytics in complex organizations, and introduce a modular approach that bridges traditional funnel reporting and modern data application design.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747159200000,"utcEndTimeMilliseconds":1747161000000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"bKn4KQv3LR6GfXzMw","name":"Basil Cleveland, PhD","linkedin":"","jobTitle":"Chief Innovation Officer, Executive Vice President, and Co-Founder","company":"Shorelight","avatar":{"backgroundColor":"cadetblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/bKn4KQv3LR6GfXzMw/avatar/1746790704406.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA37","key":"DA37","title":"Trusting AI: Is it really possible","description":"Generative AI and machine learning systems are reshaping industries but also introducing new security risks. The reliance on vast data, rapid deployment cycles, and automated pipelines in MLOps has expanded the attack surface, exposing vulnerabilities to data poisoning, adversarial inputs, and pipeline exploitation.\n\nThis session explores the unique security challenges of ML systems in the GenAI era and provides actionable strategies to safeguard them. Learn why traditional approaches fall short and how to fortify your ML lifecycle to stay ahead in an evolving threat landscape.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747159200000,"utcEndTimeMilliseconds":1747161000000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Demo B","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"5MmJZs4ZFjDYDovvP","name":"Hudson Buzby","linkedin":"","jobTitle":"Solutions Architect","company":"JFrog","avatar":{"backgroundColor":"aliceblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/5MmJZs4ZFjDYDovvP/avatar/1746814909966.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA38","key":"DA38","title":"Scaling GenAI & Agentic Workflows for practical solutions with Zerve","description":"Enterprises investing in Generative AI (GenAI) or Agentic Workflows need more than just cutting-edge models—they need scalable, cost-efficient systems that deliver real business impact. In this session we’ll show how Zerve unlocks the full potential of GenAI using its distributed computing engine, The Fleet. You’ll learn how enterprises as advanced as Canal+ and NASA  as well as cutting edge startups are streamlining AI development, reducing infrastructure costs, and transforming GenAI into a scalable, high-impact business solution.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747161300000,"utcEndTimeMilliseconds":1747163100000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"cE4W7E9HFmSRgNanj","name":"Dr. Greg Michaelson","linkedin":"","jobTitle":"Chief Product Officer & Co-Founder \t","company":"Zerve AI","avatar":{"backgroundColor":"mediumseagreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/cE4W7E9HFmSRgNanj/avatar/1747065965758.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA39","key":"DA39","title":"Breaking Free from Pipeline Tyranny: How Immutable Data Streams Are Revolutionizing Data Infrastructure","description":"Traditional data pipelines have created rigid, brittle infrastructures that limit an organization's ability to adapt and innovate. Michael Kowalchik, CEO and Founder of Matterbeam, will reveal how deconstructing these pipelines into immutable data streams creates unprecedented flexibility. By treating data as replayable streams with \"late transforms\" applied at the moment of need, organizations can rapidly deploy new use cases, migrate between systems seamlessly, and unlock new possibilities for AI and analytics. Hear from a Matterbeam customer who transformed their entire business strategy based on this paradigm shift, and discover how this approach solves fundamental challenges in modern data infrastructure.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747161300000,"utcEndTimeMilliseconds":1747163100000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Demo B","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"2oLZWvrcJywCwXTsK","name":"Michael Kowalchik","linkedin":"","jobTitle":"Founder & CEO","company":"Matterbeam","avatar":{"backgroundColor":"red","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/2oLZWvrcJywCwXTsK/avatar/1747066179590.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA40","key":"DA40","title":"What can you do with GenAI using MLflow?","description":"Deploying generative AI (GenAI) models to production demands robust tools for transparency, reproducibility, and systematic evaluation. MLflow, a widely adopted open-source MLOps platform, has expanded its capabilities to address these unique challenges. This talk dives into how MLflow can powerfully streamline your GenAI workflows. This talk will emphasize three key areas:\n\n1) Tracing: Explore how MLflow’s tracing functionalities provide end-to-end visibility into your GenAI applications, allowing developers to monitor prompt-model interactions and pinpoint bottlenecks or inefficiencies quickly.\n2) Evaluation: Learn practical strategies for rigorously assessing generative models at scale, leveraging MLflow Evaluation. We’ll demonstrate how to set up automated GenAI benchmarks, interpret results, and continuously improve model performance with confidence.\n3) Prompt Registry: Prompt management is crucial yet often overlooked in large-scale GenAI systems. Discover how MLflow’s Prompt Registry helps teams systematically catalog, version, and retrieve prompts, enabling seamless collaboration, experimentation, and production-level governance.\n\nJoin us to learn more!","tags":["Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747161300000,"utcEndTimeMilliseconds":1747163100000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Room 204","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"YAPgF4E5fJazywBcp","name":"Michael Berk","linkedin":"","jobTitle":"Sr. Resident Solutions Architect","company":"Databricks","avatar":{"backgroundColor":"turquoise","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/YAPgF4E5fJazywBcp/avatar/1745410663641.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA41","key":"DA41","title":"LLMs in Retail: How DoorDash Powers Personalization and Product Discovery","description":"As DoorDash expands beyond restaurants into groceries, convenience, and retail, the need for intelligent, scalable solutions has never been greater. Large Language Models (LLMs) are transforming how we personalize experiences, optimize search, and structure product catalogs to create a seamless shopping journey.\n\nIn this session, we’ll explore how DoorDash leverages LLMs alongside traditional machine learning techniques to enhance product discovery, improve taxonomy, and streamline order fulfillment. We’ll discuss how LLMs enable rapid basket building, intuitive product substitutions for out-of-stock items, and more accurate search results tailored to individual preferences.\n\nA key challenge in building a high-quality marketplace is ensuring a structured and enriched product catalog. LLMs play a critical role in refining product knowledge graphs, linking related products, and handling ambiguous or incomplete data. By integrating LLMs with existing ML systems, we enhance taxonomy management and create a more robust foundation for search, recommendations, and fulfillment.\n\nBeyond the technical aspects, we’ll share key lessons learned, real-world challenges, and best practices for applying LLMs in dynamic, fast-moving environments. This includes managing data inconsistencies, balancing accuracy with scalability, and ensuring AI-driven decisions align with business goals and customer expectations.\n\nAttendees will gain actionable insights into how LLMs can drive personalization, improve operational efficiency, and power the next generation of e-commerce experiences. Whether you’re an engineer, data scientist, or product leader, this session will provide a practical framework for integrating LLMs into large-scale, real-world applications.","tags":["Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747161300000,"utcEndTimeMilliseconds":1747163100000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Room 211","sessionLevel":"Intermediate-Advanced","sessionType":"GenAi X Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"aXTKvmZxTeuAdD8Z5","name":"Sudeep Das","linkedin":"","jobTitle":"Head of Ai, New Business Verticals","company":"DoorDash Inc","avatar":{"backgroundColor":"azure","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/aXTKvmZxTeuAdD8Z5/avatar/1746529057659.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA42","key":"DA42","title":"Book Signing with Matt Harrison, Author of Effective Pandas : Patterns for Data Manipulation","description":"Book Lovers Alert! Author Session with Free Giveaways!\nJoin us for an exciting session of talented author!  Discuss their work, gain insights into their creative process, and get a chance to get a free copy of their book (limited quantities available).","tags":["Book Signing"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"15:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747162800000,"utcEndTimeMilliseconds":1747164600000,"displayStartTime":"3:00 PM","displayEndTime":"3:30 PM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Book Signing","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"gXXmZokomgFSxxdYo","name":"Matt Harrison","linkedin":"","jobTitle":"Python & Data Science Corporate Trainer | Consultant","company":"MetaSnake","avatar":{"backgroundColor":"lightslategray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/gXXmZokomgFSxxdYo/avatar/1745410640425.png"}}],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA144","key":"DA144","title":"Coffee Break","description":"","tags":["Networking +"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"15:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747162800000,"utcEndTimeMilliseconds":1747164600000,"displayStartTime":"3:00 PM","displayEndTime":"3:30 PM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA43","key":"DA43","title":"On-Brand and On-Policy: Reinforcement Fine-Tuning Reliable AI Agents for Customer Support","description":"Building agentic customer support solutions can be surprisingly difficult. AI agents must consistently follow brand guidelines while adhering to complex support policies across multi-turn conversations—something even frontier models struggle to do consistently.\n\nIn this demo, we’ll show how Adaptive Engine uses synthetic data and reinforcement learning to turn small, open models into specialized AI customer assistants that meet production requirements.\n\nYou’ll see how, in just a few clicks, Adaptive Engine can fine-tune Mistral Small (24B) to outperform GPT-4o in classifying customer intent and adhering to company policies—learning from a combination of verifiable rewards and AI feedback.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"15:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747164600000,"utcEndTimeMilliseconds":1747166400000,"displayStartTime":"3:30 PM","displayEndTime":"4:00 PM","location":"Demo B","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"jJ9nbzoEzeJXaeiJH","name":"Andrew Jardine","linkedin":"","jobTitle":"Head of GTM for Adaptive ML","company":"Adaptive ML","avatar":{"backgroundColor":"darkorchid","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/jJ9nbzoEzeJXaeiJH/avatar/1747066421766.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA44","key":"DA44","title":"Intro to AI Risk Management","description":"AI is transforming business, but it also introduces risks that traditional oversight methods weren’t built to handle. Boards and leadership teams are increasingly tasked with managing AI-driven risks, from compliance challenges to reputational concerns.\n\nIn this session, we’ll break down how to evolve risk management and internal assessment practices to address the unique challenges of AI and generative AI. You’ll learn practical strategies for identifying vulnerabilities, aligning with emerging regulations, and building governance frameworks that enable responsible AI adoption.\n\nThis talk is designed for business executives and data leaders looking to strengthen their AI risk management approach. We’ll cover key audit considerations, evolving standards, and the tools and credentials that can help position you as a trusted advisor in the AI era.","tags":["Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"15:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747164600000,"utcEndTimeMilliseconds":1747166400000,"displayStartTime":"3:30 PM","displayEndTime":"4:00 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"heLe7mtj8GHEZLudj","name":"Cal Al-Dhubaib","linkedin":"","jobTitle":"Head of AI and Data Science","company":"Further","avatar":{"backgroundColor":"mediumblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/heLe7mtj8GHEZLudj/avatar/1745409621622.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA45","key":"DA45","title":"How to Build Impressive AI Apps that Get Millions of Users","description":"In this talk, Hassan will go over how he builds open source AI apps that get millions of users like roomGPT (2.9 million users), restorePhotos (1.1 million users), and LlamaCoder (1.1 million visitors). He'll go over his journey in AI, demo some of the apps that he's built, and dig into his tech stack and code to explain how he builds these apps from scratch. He’ll also go over how to market them and go over his top tips and tricks for building great full-stack AI applications quickly and efficiently.\n\nThis talk will start from first principles and give you a glimpse into Hassan’s workflow of idea -> working app -> many users. Attendees should come out of this session equipped with the resources to build impressive AI applications and understand some of the behind the scenes of how they’re built and marketed. This will hopefully serve as an educational and inspirational talk that encourages builders to go build cool things.","tags":["Ai Agents"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"15:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747164600000,"utcEndTimeMilliseconds":1747166400000,"displayStartTime":"3:30 PM","displayEndTime":"4:00 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"nCcdcLGe8AuYJTPRD","name":"Hassan El Mghari","linkedin":"","jobTitle":"Senior Manager, Developer Relations","company":"Together AI","avatar":{"backgroundColor":"orangered","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/nCcdcLGe8AuYJTPRD/avatar/1745410039564.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA46","key":"DA46","title":"Implementing High-Quality and Cost-Efficient AI Applications with Small Language Models","description":"This session focuses on practical techniques for using small open-source language models (SLMs) for real-life projects. We first highlight the limitations of proprietary models in terms of privacy, compliance, and cost. Then, we explore modern workflows for adapting SLMs with domain-specific pre-training, instruction fine-tuning, and alignment. Along the way, we will introduce and demonstrate open-source Arcee AI SLM, and librairies like DistillKit, Spectrum, and MergeKit, which are critical in achieving task-specific accuracy while optimizing computational costs. Finally, we'll discuss why SLMs are a great fit for advanced scenarios like model routing and agentic workflows. Join us to learn how small, efficient, and adaptable models can transform your AI applications!","tags":["Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"15:30:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747164600000,"utcEndTimeMilliseconds":1747168200000,"displayStartTime":"3:30 PM","displayEndTime":"4:30 PM","location":"Room 207","sessionLevel":"Intermediate-Advanced","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"Sw6FdaCjfoqMMn7QW","name":"Julien Simon","linkedin":"","jobTitle":"Chief Evangelist","company":"Arcee.ai","avatar":{"backgroundColor":"navy","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/Sw6FdaCjfoqMMn7QW/avatar/1745410290326.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA47","key":"DA47","title":"Uncertainty Quantification I: Calibration and Conformal Prediction","description":"Uncertainty Quantification refers to going beyond point predictions and associating probabilities to the entire range of possible outcomes.  This talk will be part 1 of the series and will cover calibration and conformal prediction.  \n\nProbability calibration comes up in classification problems.  Often we want models to assign a probability to the various outcomes, be they binary or multi-class.  For example, a fraud detection algorithm may determine there is a 7% chance that a particular transaction is fraudulent.  But how do we know whether this 7% is reliable?  In other words, how sure are we that if we saw 1000 such transactions, that roughly 70 of them would be fraud.  We will examine how to assess the reliability of models in this sense, and how to apply post-hoc corrections when they are miscalibrated.\n\nConformal prediction gives a framework for predicting intervals with a desired coverage.  Applied primarily to regression problems, it can provide interval predictions such that, say, 90% of the time the target value will be in the predicted interval.  We will cover the theory behind conformal prediction so that these theoretical properties are well understood.  We will also cover techniques like Conformalized Quantile Regression that improve on the standard conformal prediction ideas.","tags":["Machine Learning"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"15:30:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747164600000,"utcEndTimeMilliseconds":1747171800000,"displayStartTime":"3:30 PM","displayEndTime":"5:30 PM","location":"Room 209","sessionLevel":"Intermediate-Advanced","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"SCZHBDjTz8ovRK8Kw","name":"Brian Lucena, PhD","linkedin":"","jobTitle":"Principal Data Scientist","company":"Swish Analytics","avatar":{"backgroundColor":"papayawhip","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/SCZHBDjTz8ovRK8Kw/avatar/1745409594768.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA48","key":"DA48","title":"InsightFinder AI: Holistic Monitoring, Evaluation, and Governance Platform for Reliable and Responsible AI Models","description":"The new end-to-end AI monitoring, evaluation, and governance solution from the InsightFinder AI Observability Platform is now generally available. In this session, InsightFinder AI Founder and CEO Dr. Helen Gu will discuss the key challenges of managing enterprise-scale AI systems—including large language models (LLMs), machine learning (ML) models, composite AI architectures, distributed data pipelines, and the underlying IT infrastructure. The session will also feature a live demonstration of the new InsightFinder AI Observability Platform in action.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"15:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747164600000,"utcEndTimeMilliseconds":1747166400000,"displayStartTime":"3:30 PM","displayEndTime":"4:00 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"oJZHsTjSYZhLzBvXW","name":"Dr Helen Gu","linkedin":"","jobTitle":"Founder and CEO","company":"InsightFinder Inc.","avatar":{"backgroundColor":"teal","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/oJZHsTjSYZhLzBvXW/avatar/1745409819183.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA49","key":"DA49","title":"Agentic MDM: Building the Context Layer for AI and Multi-Agent Systems","description":"As AI agents and LLM-driven applications evolve, data infrastructure must evolve with them. Traditional MDM and ETL pipelines fall short—they lack the agility, context-awareness, and observability required to support autonomous systems. Enter Agentic MDM: a modern, intelligent data foundation purpose-built for the AI-native stack.\nIn this talk, we’ll explore how Agentic MDM enables real-time synchronization, context-aware data sharing, and governed access to support reliable, scalable AI and multi-agent architectures. We’ll cover practical strategies for designing:\n🔁 Real-time data services for LLMs and agents\n🧠 Context layers that minimize hallucinations and enrich reasoning\n🔎 Observability tools to track data drift and agent performance\n🔐 Governance controls for secure, zero-trust data access\n🧩 Composable data products to streamline AI development\nThis session is ideal for AI architects, MLOps engineers, and platform developers rethinking their data layer for agentic infrastructure, Retrieval-Augmented Generation (RAG), and continuous AI integration. Learn how to align your data strategy with the needs of tomorrow’s intelligent systems—starting today.","tags":["AI Expo Talk"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"16:05:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747166700000,"utcEndTimeMilliseconds":1747168500000,"displayStartTime":"4:05 PM","displayEndTime":"4:35 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"ZEBjbQRdWovELDvLi","name":"Jack Smith","linkedin":"","jobTitle":"Principal Solutions Engineer at Syncari","company":"Syncari","avatar":{"backgroundColor":"chartreuse","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/ZEBjbQRdWovELDvLi/avatar/1746790615178.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA50","key":"DA50","title":"Panel Discussion: Agentic AI in the Enterprise: How Businesses Are Leveraging Autonomous Agents","description":"Join this engaging panel discussion to uncover how businesses are harnessing the power of agentic AI to stay competitive in a rapidly evolving landscape and what the future holds for this cutting-edge technology.","tags":["AI Agents","Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"16:05:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747166700000,"utcEndTimeMilliseconds":1747170300000,"displayStartTime":"4:05 PM","displayEndTime":"5:05 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Panel","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"DWu4aeeZRXFoZpzow","name":"Robert Brennan","linkedin":"","jobTitle":"CEO","company":"All Hands AI","avatar":{"backgroundColor":"plum","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/DWu4aeeZRXFoZpzow/avatar/1745411038049.png"}},{"key":"ZhmWb5SzF5rxLJu69","name":"Qingyun Wu, PhD","linkedin":"","jobTitle":"Founder","company":"AG2","avatar":{"backgroundColor":"mistyrose","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/ZhmWb5SzF5rxLJu69/avatar/1745410968939.png"}},{"key":"FtwSRecgh47hBeHSh","name":"Rob Bailey","linkedin":"","jobTitle":"COO & Co-Founder","company":"CrewAI","avatar":{"backgroundColor":"sienna","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/FtwSRecgh47hBeHSh/avatar/1745411024269.png"}},{"key":"NKdsAZr7p2xyffayr","name":"Sandi Besen","linkedin":"","jobTitle":"AI Research Engineer and Ecosystem Lead","company":"IBM Research","avatar":{"backgroundColor":"darkgreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/NKdsAZr7p2xyffayr/avatar/1746529240792.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA51","key":"DA51","title":"Mastering Time Series Analysis with StatsModels: From Decomposition to ARIMA","description":"Time series analysis provides essential tools for modeling and predicting time-dependent data, especially data exhibiting seasonal patterns or serial correlation. This tutorial covers tools in the StatsModels library including seasonal decomposition and ARIMA. As examples, we'll look at weather data and electricity generation from renewable sources in the United States since 2004 -- but the methods we'll cover apply to many kinds of real-world time series data.\n\nOutline\n\nIntroduction to time series\nOverview of the data\nSeasonal decomposition, additive model\nSeasonal decomposition, multiplicative model\nSerial correlation and autoregression\nARIMA\nSeasonal ARIMA","tags":["Machine Learning"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"16:05:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747166700000,"utcEndTimeMilliseconds":1747168500000,"displayStartTime":"4:05 PM","displayEndTime":"4:35 PM","location":"Room 204","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"sCW7xkF9eosM2KMq4","name":"Allen Downey, PhD","linkedin":"","jobTitle":"Principal Data Scientist","company":"PyMC Labs","avatar":{"backgroundColor":"steelblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/sCW7xkF9eosM2KMq4/avatar/1745409283961.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA52","key":"DA52","title":"Build Scalable Workflows for LLM Fine-Tuning with Hugging Face, PEFT, and Union","description":"Training complex AI models at scale requires orchestrating multiple steps into a reproducible workflow and understanding how to optimize resource utilization for efficient fine-tuning. Modern MLOps and LLMOps tools help streamline these processes, improving the efficiency and reliability of your AI pipelines. This workshop will introduce you to the basics of MLOps and best practices for building efficient AI pipelines for large language models (LLMs). \n\nBy completing this workshop, you'll gain hands-on experience structuring scalable and reproducible AI workflows for fine-tuning LLMs using best practices such as caching, versioning, containerized resource utilization, parameter-efficient fine-tuning (PEFT), and more. We'll use Hugging Face for transformers and datasets, PEFT for implementing LoRA and QLoRA, bitandbytes for quantization, and union.ai for scalable workflows, GPUs, and serving our fine-tuned model.","tags":["Generative AI"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"16:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747168500000,"utcEndTimeMilliseconds":1747172100000,"displayStartTime":"4:35 PM","displayEndTime":"5: 35 PM","location":"Room 208","sessionLevel":"Intermediate","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"6WFrQ7hrDKpBrKFky","name":"Sage Elliott","linkedin":"https://www.linkedin.com/in/sageelliott","jobTitle":"Senior Developer Advocate - AI Engineering & MLOps","company":"Union.ai","avatar":{"backgroundColor":"lightgrey","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/6WFrQ7hrDKpBrKFky/avatar/1745411086906.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA53","key":"DA53","title":"Hybrid Text Classification: Labeling with LLMs and Dense Neural Networks","description":"Labeling text data is a foundational step in many machine learning workflows, yet it can be a costly and time-consuming process when relying solely on premium LLMs (Large Language Models). In this workshop, participants will learn how to efficiently combine the power of premium LLMs with open-source tools to create labeled datasets, extract embeddings, and train neural network classifiers.\nBy the end of this session, you will:\n- Understand how to use LLM APIs for initial labeling.\n- Learn techniques to generate vector embeddings of text using open-source models.\n- Train a neural network classifier capable of fast, cost-effective classifications.\n- Apply these techniques to real-world text classification tasks, achieving significant cost savings while maintaining accuracy.","tags":["LLMs"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"16:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747168500000,"utcEndTimeMilliseconds":1747172100000,"displayStartTime":"4:35 PM","displayEndTime":"5: 35  PM","location":"Room 206","sessionLevel":"Intermediate-Advanced","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP"],"company":"","speakers":[{"key":"hMbAWGFb3QdsufXp8","name":"Mohammad Soltanieh-ha, PhD","linkedin":"","jobTitle":"Clinical Assistant Professor","company":"Boston University","avatar":{"backgroundColor":"slategray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/hMbAWGFb3QdsufXp8/avatar/1745410684486.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA54","key":"DA54","title":"Hill Climbing: Best Practices for Evaluating LLM Applications","description":"Evaluation becomes a critical step to get the most out of LLMs. As many of us have discovered, while LLMs have enormous flexibility, they often have shortcomings for many use cases. This tutorial gives you the tools to systematically improve your model.\nThe tutorial covers the most impactful evaluation techniques for LLMs including working with evaluation suites like the EleutherAI LM Evaluation Harness for benchmarking, how best to use the model as a judge approach, and finally incorporating human feedback. Additionally, we’ll discuss methods for modularizing complex tasks and employing unit tests to pinpoint issues and drive iterative enhancements.\nBy the end of this session, you should have a practical roadmap for designing and executing robust LLM evaluation pipelines. You will be provided curated Jupyter notebooks, guidance on the latest evaluation research papers, and tangible best practices for evaluation.","tags":["LLMs"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"16:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747168500000,"utcEndTimeMilliseconds":1747172100000,"displayStartTime":"4:35 PM","displayEndTime":"5: 35 PM","location":"Room 207","sessionLevel":"Intermediate-Advanced","sessionType":"Tutorial","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"Fzax3m2uXuytpnEjG","name":"Rajiv Shah, PhD","linkedin":"","jobTitle":"Machine Learning Engineer","company":"Contextual AI","avatar":{"backgroundColor":"greenyellow","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/Fzax3m2uXuytpnEjG/avatar/1745410979407.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA55","key":"DA55","title":"Pushing the Boundaries of A/B Testing: Insights from B2B Experimentation","description":"B2C giants like Microsoft, Facebook, and Google are the face of A/B testing. They run experiments with millions of users and enjoy overwhelming statistical power. Yet surprisingly, one-third of Statsig's customers are B2B companies. This includes well-known names like Notion and Atlassian, as well as countless smaller B2B companies using experimentation to drive impact.\n\n \n\nB2B experimentation largely follows the same principles as B2C, but it faces unique statistical challenges—small sample sizes, skewed distributions, heterogeneous effects, complex metric selection, and ID mapping. This talk will explore what we’ve learned from our B2B customers, and how advanced techniques like stratified sampling, winsorization, and unit ID resolution can help.\n\n \n\nThese challenges aren’t limited to B2B; they are simply B2C challenges when AB testing is at its limits. That means the solutions we discuss will be broadly useful to anyone working in online experimentation dealing with limits of statistical power. Whether you’re running tests at scale or working with smaller datasets, this talk will help you make better, more reliable decisions with A/B testing.","tags":["Machine Learning","Data Visualization & Data Analysis","Data Engineering"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"16:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747168800000,"utcEndTimeMilliseconds":1747170600000,"displayStartTime":"4:40 PM","displayEndTime":"5:10 PM","location":"Room 204","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"7ChbcdtPa4R4D6Geh","name":"Timothy Chan","linkedin":"","jobTitle":"Head of Data","company":"Statsig","avatar":{"backgroundColor":"darkkhaki","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/7ChbcdtPa4R4D6Geh/avatar/1745411443725.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA56","key":"DA56","title":"VIP&Speaker Networking Reception","description":"Don’t miss out on the vibrant after-session scene at ODSC! Our four evening receptions offer something for everyone. Mingle with fellow attendees and industry leaders at the Welcome Reception (Tuesday). The Main Networking Reception (Wednesday) is a central hub to unwind, share insights, and forge new connections. Wrap up the conference on a high note and solidify the connections that will fuel your AI journey.","tags":["Networking +"],"date":"2025-05-13","milliseconds":1747094400000,"startTime":"17:30:00","timeZone":"America/New_York","duration":90,"utcStartTimeMilliseconds":1747171800000,"utcEndTimeMilliseconds":1747177200000,"displayStartTime":"5:30 PM","displayEndTime":"7:00 PM","location":"Room 213","sessionLevel":"All Levels","sessionType":"Networking +","ticketTypes":["VIP","Speakers"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA57","key":"DA57","title":"Morning 5k Run","description":"5k run to the beautiful Pleasure Bay in South Boston.  \nLocation: Homewood Suites by Hilton Seaport Entrance","tags":["Networking +"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"7:00:00","timeZone":"America/New_York","duration":45,"utcStartTimeMilliseconds":1747220400000,"utcEndTimeMilliseconds":1747223100000,"displayStartTime":"7:00 AM","displayEndTime":"7:45 AM","location":"Homewood Suites by Hilton Seaport","sessionLevel":"All Levels","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA58","key":"DA58","title":"ODSC Keynote:  AI and the Agentic Future: Powering the Next Wave of Enterprise Innovation","description":"At the forefront of innovation for both individuals and organizations is the transformative power of Agentic AI. More than just automation, Agentic AI is becoming the connective tissue of enterprise systems—reshaping how businesses operate, make decisions, and interact with technology. As this technology evolves from isolated task-based tools to dynamic Agent-to-Agent ecosystems, its strategic value will accelerate dramatically. Industry analysts estimate that Agentic AI will unlock over $500 billion in new value across the enterprise software market by 2035, driven by a shift toward intelligent automation and AI-native workflows. Crucial to this growth is access to trusted, contextual enterprise data—the lifeblood that makes these agents not just smart, but truly enterprise-ready. Consider this: 77% of the world’s transactions touch an SAP system. SAP’s AI strategy capitalizes on this footprint by embedding deep business context into every layer of its platform. At the core is Joule, SAP’s AI agent, which brings precision and relevance to enterprise interactions. This is further enhanced by the SAP Business Data Cloud, which doesn’t just unify SAP data—it opens the door to seamless integration with external platforms like Databricks, enabling a broader and richer AI ecosystem.","tags":["All Tracks"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"9:00:00","timeZone":"America/New_York","duration":25,"utcStartTimeMilliseconds":1747227600000,"utcEndTimeMilliseconds":1747229100000,"displayStartTime":"9:00 AM","displayEndTime":"9:25 AM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Keynote","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"TxLTpTX7pKqdxRsZB","name":"Doug Freud","linkedin":"","jobTitle":"Vice President AI & ML","company":"SAP","avatar":{"backgroundColor":"moccasin","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/TxLTpTX7pKqdxRsZB/avatar/1745409810333.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA58","key":"DA58","title":"ODSC Keynote: Solving the Intelligent Agent Puzzle: From Development Hurdles to Collaborative Solutions","description":"Building effective intelligent agents comes with considerable challenges for developers, particularly in terms of complexity, reliability, and the necessity for smooth collaboration. This keynote will explore these key obstacles and examine powerful development tools aimed at simplifying the creation of resilient agent-based applications. We will also discuss the exciting possibilities of agent-to-agent communication for addressing progressively intricate problems. Attendees will gain valuable insights into overcoming development challenges and constructing more interconnected intelligent agents. Lastly, we will briefly cover important aspects for the successful production deployment of these innovative solutions.","tags":["All Tracks"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"09:30:00","timeZone":"America/New_York","duration":25,"utcStartTimeMilliseconds":1747229400000,"utcEndTimeMilliseconds":1747230900000,"displayStartTime":"09:30 AM","displayEndTime":"09:55 AM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Keynote","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA59","key":"DA59","title":"Book Signing with Sinan Ozdemir , Author of Quick Start Guide to Large Language Models","description":"Book Lovers Alert! Author Session with Free Giveaways!\nJoin us for an exciting session of talented author!  Discuss their work, gain insights into their creative process, and get a chance to get a free copy of their book (limited quantities available).","tags":["Book Signing"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747231200000,"utcEndTimeMilliseconds":1747233000000,"displayStartTime":"10:00 AM","displayEndTime":"10:30 AM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Book Signing","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"SS8dBHfGqBfZJKb9J","name":"Sinan Ozdemir","linkedin":"","jobTitle":"AI & LLM Expert | Author | Founder + CTO","company":"LoopGenius","avatar":{"backgroundColor":"gainsboro","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/SS8dBHfGqBfZJKb9J/avatar/1745411164915.png"}}],"isHighlighted":false,"isNetworking":true,"isFavorite":true},{"uniqueId":"DA60","key":"DA60","title":"Women in Analytics: Roundtable & Short Community Talk\n\"AI Literacy: Our Shared Foundation for Trust in AI\"","description":"","tags":["Community Space","Networking +"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747231200000,"utcEndTimeMilliseconds":1747234800000,"displayStartTime":"10:00 AM","displayEndTime":"11:00 AM","location":"Room 212","sessionLevel":"","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"sh9Cr7f6t7bw8rfkx","name":"Lauren Burke-McCarthy","linkedin":"","jobTitle":"Senior AI Strategy Lead","company":"Further","avatar":{"backgroundColor":"darkolivegreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/sh9Cr7f6t7bw8rfkx/avatar/1745410344802.png"}}],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA145","key":"DA145","title":"Coffee Break","description":"","tags":["Networking +"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747231200000,"utcEndTimeMilliseconds":1747233000000,"displayStartTime":"10:00 AM","displayEndTime":"10:30 AM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA61","key":"DA61","title":"Agentic AI in Action: Build Autonomous, Multi-Agent Systems Hands-On in Python","description":"Autonomous AI agents are changing how we solve complex problems by allowing AI to plan, collaborate, and act with minimal human intervention. In this half-day hands-on workshop, you’ll learn exactly what agentic AI is and how to harness it in your own projects. \n\nWe begin by demystifying what AI agents are – and how they differ from traditional ML pipelines – illustrated with real-world examples and an overview of leading agent frameworks (including LangChain, CrewAI, Microsoft Autogen, OpenAI’s Swarm and Hugging Face’s Smolagents). Next, we dive into the architecture of agentic systems, drawing on industry best practices to highlight how to design effective, reliable agents. \n\nThen comes the core of the session: a live coding lab where you’ll build autonomous multi-agent systems from scratch in Python, progressing from a simple agent to a coordinated team of agents solving a complex task. From there, we’ll detail options for production deployments and we’ll wrap up by exploring what’s next for agentic AI – from the possibility of “more agents than humans” in the workforce to key ethical considerations and emerging trends. \n\nBy the end of this workshop, you’ll have both a solid conceptual foundation and practical experience building AI agents, equipping you to deploy autonomous agents in your own applications and stay ahead in this rapidly evolving field.","tags":["AI Agents"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:30:00","timeZone":"America/New_York","duration":240,"utcStartTimeMilliseconds":1747233000000,"utcEndTimeMilliseconds":1747247400000,"displayStartTime":"10:30 AM","displayEndTime":"16:30 PM","location":"Room 206","sessionLevel":"Intermediate","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP"],"company":"","speakers":[{"key":"csSvcEApiwqsRHexf","name":"Dr. Jon Krohn","linkedin":"","jobTitle":"CEO","company":"Y Carrot","avatar":{"backgroundColor":"thistle","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/csSvcEApiwqsRHexf/avatar/1745409875484.png"}},{"key":"3wQkZ4oYmJhgQCXvr","name":"Edward Donner","linkedin":"","jobTitle":"Co-founder and CTO","company":"Nebula.io","avatar":{"backgroundColor":"chartreuse","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/3wQkZ4oYmJhgQCXvr/avatar/1745409896958.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA62","key":"DA62","title":"Building Multimodal AI Agents: Agentic RAG with Vision-Language Models","description":"Discover the transformative potential of Multimodal Agentic Retrieval-Augmented Generation (RAG) in this hands-on workshop. Participants will explore the integration of advanced AI engineering techniques with state-of-the-art (SOTA) multimodal models like Amazon Nova, Claude, and Llama to build Agentic RAG systems that leverage vision-based Large Language Models (LLMs) such as ColPali for retrieval. The session will also cover frameworks like CrewAI/LangGraph for building AI agents.\n\nThis workshop will provide attendees with step-by-step guidance to:\n\nUnderstand Vision Transformers\nDeep dive into ColPali (Efficient Document Retrieval with Vision-Language Models)\nCreate an RAG-based system using ColPali and Nova/Claude/Llama\nBuild multimodal AI agents that process text, images, and video using CrewAI, while developing a custom retrieval knowledge base leveraging ColPali\nDeploy and integrate Multimodal RAG systems seamlessly into enterprise frameworks, enabling innovation in AI-powered solutions\nAttendees will leave with a solid understanding of how to build and deploy Multimodal RAG systems that enhance retrieval and reasoning across multiple modalities.","tags":["Multimodal & Deep Learning"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:30:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747233000000,"utcEndTimeMilliseconds":1747240200000,"displayStartTime":"10:30 AM","displayEndTime":"12:30 PM","location":"Room 208","sessionLevel":"Intermediate","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"BYodYf2KtdEwuNZBr","name":"Suman Debnath","linkedin":"","jobTitle":"Principal AI/ML Advocate","company":"Amazon Web Services","avatar":{"backgroundColor":"lightsalmon","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/BYodYf2KtdEwuNZBr/avatar/1745411312965.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA63","key":"DA63","title":"Machine Learning with CatBoost","description":"This workshop will show how to use CatBoost. It will demonstrate model creation, model tuning, model evaluation, and model interpretation.","tags":["Machine Learning"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:30:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747233000000,"utcEndTimeMilliseconds":1747236600000,"displayStartTime":"10:30 AM","displayEndTime":"11:30 AM","location":"Room 209","sessionLevel":"Intermediate","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[{"key":"gXXmZokomgFSxxdYo","name":"Matt Harrison","linkedin":"","jobTitle":"Python & Data Science Corporate Trainer | Consultant","company":"MetaSnake","avatar":{"backgroundColor":"lightslategray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/gXXmZokomgFSxxdYo/avatar/1745410640425.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA64","key":"DA64","title":"The AI Search Revolution - What’s Next?","description":"Search has undergone a radical transformation, evolving from simple keyword queries to sophisticated AI-driven conversations. In this keynote, Sarah will discuss the role of AI — and more recently generative AI  — in reshaping the way we search and interact with information. GenAI can quickly distill large swaths of data into tailored insights and summaries, enabling knowledge workers to develop strategies and make decisions more quickly. Beyond this, genAI continues to advance with agentic AI, unlocking a new level of autonomy. AI will also become more proactive, going beyond responding to queries to anticipating our needs and delivering tailored solutions proactively. In addition, new deep research capabilities are pushing the boundaries further, enabling professionals to explore complex topics more thoroughly. Sarah will highlight how these advancements will redefine decision-making, unlocking new efficiencies and possibilities across industries. Attendees will gain a forward-looking perspective on the next generation of AI-driven search and what it means for the future of knowledge work.","tags":["Generative AI"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747233000000,"utcEndTimeMilliseconds":1747234800000,"displayStartTime":"10:30 AM","displayEndTime":"11:00 AM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"AnYgqPz8xoX9MDRpf","name":"Sarah Hoffman","linkedin":"","jobTitle":"Director of Research, AI","company":"AlphaSense","avatar":{"backgroundColor":"mediumslateblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/AnYgqPz8xoX9MDRpf/avatar/1745411118805.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA65","key":"DA65","title":"Advanced Techniques for Mastering RAG in Finance","description":"In this presentation we will talk about the challenges and limitations of traditional RAG techniques and explain the various techniques to improve the performance of information retrieval accuracy and relevance of RAG system in Finance domain. Some of the techniques include but are not limited to metadata, contextual RAG, chunking techniques, hybrid search techniques, few-shot, chain of thought query understanding, re-ranking, retrieval augmented reasoning to handle complex questions and finally graph rag technique. The participants will have the opportunity to learn different techniques to enhance RAG and review some sample examples and metrics for each technique to understand its applicability. In conclusion, we will discuss the various metrics used to evaluate RAG and discuss the latest advancements in this field.\n\nLearning objective is to learn different techniques to improve the standard RAG pipeilne in Finance domain. Open source tools like PyMupdf for parsing, search tools like FAISS, Sentence Transformers for ranking, others including LlamaIndex, Langchain, Huggingface. We will also mention good to know tools like Azure Document Intelligence for parsing, Azure AI Search for search techniques.","tags":["LLMs","RAG"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747233000000,"utcEndTimeMilliseconds":1747234800000,"displayStartTime":"10:30 AM","displayEndTime":"11:00 AM","location":"Room 204","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"CKqmnBxxWiHCLmFz3","name":"Himani Rallapalli","linkedin":"","jobTitle":"Senior Applied Scientist","company":"Microsoft","avatar":{"backgroundColor":"gold","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/CKqmnBxxWiHCLmFz3/avatar/1745410191534.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA66","key":"DA66","title":"Agents, APIs, and the AI-First Future: Building the Next Generation of Intelligent Applications","description":"The AI-first era is here — and it's redefining how we build, scale, and interact with software. In this new landscape, intelligent agents are emerging as active collaborators in development, not just tools. Paired with the power and flexibility of APIs, these agents are transforming static applications into adaptive, autonomous systems.\nIn this keynote, we’ll explore how developers can harness the synergy between AI agents and APIs to create next-generation applications.\n\nTopics will include:\nPrototyping in the AI-First World: How to design applications with agents at the core from day one.\nOrchestrating with APIs: Leveraging APIs as the connective tissue that empowers agents to take action, retrieve data, and make decisions\nEquipping Your Agents: Building and integrating the tools your agents need to operate with efficiency and context-awareness.\nAutomation at Scale: Using cloud-based workflows to scale intelligent automation in real-world environments.","tags":["Generative AI","AI Engineering","AI Agents"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747233000000,"utcEndTimeMilliseconds":1747234800000,"displayStartTime":"10:30 AM","displayEndTime":"11:00 AM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Track Keynote","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"cx9AvFRZhGMrgGf8W","name":"Pooja Mistry\t","linkedin":"","jobTitle":"Developer Advocate \t","company":"Postman","avatar":{"backgroundColor":"peru","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/cx9AvFRZhGMrgGf8W/avatar/1746528128551.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA67","key":"DA67","title":"Revolutionize Your Enterprise with Airia AI Platform","description":"Join us for an engaging demo session showcasing the transformative power of the Airia Enterprise AI Platform. Learn how our innovative platform is designed to accelerate AI adoption across your organization by seamlessly integrating advanced models and data sources to automate complex tasks. We'll explore key features such as AI workflow orchestration, security controls, and responsible AI guardrails, demonstrating how they enable your teams to securely build, deploy, and manage AI-driven agents at scale. Experience how Airia can unlock AI's full potential, delivering measurable impact and efficiency across your business operations. Don't miss this opportunity to see Airia in action and explore how it can advance your AI initiatives.","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"10:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747233000000,"utcEndTimeMilliseconds":1747234800000,"displayStartTime":"10:30 AM","displayEndTime":"11:00 AM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"Q8Jz9Q53xLS9t9L4r","name":"Spencer Reagan","linkedin":"","jobTitle":"R&D","company":"Airia","avatar":{"backgroundColor":"darkorange","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/Q8Jz9Q53xLS9t9L4r/avatar/1746790697574.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA68","key":"DA68","title":"Harnessing Scalable Compute and LLMs for Call Center Performance Analytics","description":"Call centers generate vast amounts of conversational audio data, traditionally difficult to analyze at scale due to the time and effort required for manual review. This session presents an innovative approach leveraging scalable compute and Large Language Models (LLMs) to rapidly and effectively evaluate call center performance.\nWe demonstrate an automated pipeline where audio recordings from a synthetic bank call center dataset are transcribed into text using Whisper, an open-source speech-to-text model accessed via OpenAI's API. The resulting transcripts are then analyzed by LLMs, such as GPT-4, to summarize interactions and evaluate agent performance across key metrics, including adherence to scripts, problem resolution effectiveness, and customer sentiment.\nThe session highlights how these AI-driven techniques allow businesses to objectively assess agent interactions, quickly identify training opportunities, and measure customer satisfaction at an unprecedented scale. Additionally, we explore how the Zerve platform's scalable cloud orchestration supports parallel processing, enabling analysis of thousands of audio hours efficiently and cost-effectively.\nAttendees will learn:\nHow to construct an end-to-end analytics pipeline using Whisper and LLMs to turn audio recordings into actionable insights, greatly enhancing operational decision-making.\nTechniques for scaling call analytics workflows using distributed computing platforms like Zerve, facilitating rapid processing of extensive audio data.\nPractical insights from using synthetic voice data to develop, test, and validate performance metrics and AI-driven evaluations without privacy risks associated with real-world data.\nBy integrating advanced speech recognition, powerful LLM summarization, and scalable computing platforms, data science teams can redefine call center analytics, providing comprehensive, timely insights to drive smarter business decisions.","tags":["Generative AI"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747234800000,"utcEndTimeMilliseconds":1747236600000,"displayStartTime":"11:00 AM","displayEndTime":"11:30 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"cE4W7E9HFmSRgNanj","name":"Dr. Greg Michaelson","linkedin":"","jobTitle":"Chief Product Officer & Co-Founder \t","company":"Zerve AI","avatar":{"backgroundColor":"mediumseagreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/cE4W7E9HFmSRgNanj/avatar/1747065965758.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA69","key":"DA69","title":"Preserving Privacy While Fine-tuning your Models, with Tonic Textual","description":"As open source LLMs become increasingly powerful, fine-tuning becomes an increasingly powerful technique for increasing accuracy and reducing costs of LLM inference. However, the risk of model memorization makes it critically important that we carefully prepare our training to preserve privacy, especially in regulated industries such as healthcare or finance. The risk of emitting sensitive information at inference time demands that we carefully remove PII/PHI from training data — a highly nontrivial task for unstructured data. In this demonstration, we will showcase how you can use Tonic Textual to de-identify training data for fine-tuning LLMs, enabling you to fine-tune on high quality data while preserving privacy.","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747234800000,"utcEndTimeMilliseconds":1747236600000,"displayStartTime":"11:00 AM","displayEndTime":"11:30 AM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"YWXeN95tkXKLTtZRC","name":"Ander Steele","linkedin":"","jobTitle":"Head of AI at Tonic AI","company":"Tonic AI","avatar":{"backgroundColor":"darkviolet","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/YWXeN95tkXKLTtZRC/avatar/1745409329265.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA74","key":"DA74","title":"10 Trends in Enterprise Generative AI: Lessons from Real-World Deployments","description":"Generative AI (genAI) has graduated from workbench POCs to critical production systems across most industries.  While progressive enterprises seek to gauge value (and future investment) in fledgling AI applications, conservative organizations are leveraging the expanded capabilities of cloud platforms to catch up. \n\nDuring this session, AI veteran Cameron Turner will share some of his experiences (successes and pitfalls) while leading teams to build and deploy industrial AI systems within Global 1000 companies in the US, EU and UK.  Topics will range from technical to cultural, and include observed trends across multiple industries specific to the adoption of genAI.  Attendees will be left with real-world examples and actionable recommendations/best practices for genAI adoption in their own work.","tags":["Generative AI"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747234800000,"utcEndTimeMilliseconds":1747236600000,"displayStartTime":"11:00 AM","displayEndTime":"11:30 AM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"rSWD4ddyTmF9QfMZ8","name":"Cameron Royce Turner","linkedin":"","jobTitle":"Founder and CEO","company":"TRUIFY.AI","avatar":{"backgroundColor":"lightblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/rSWD4ddyTmF9QfMZ8/avatar/1745409641648.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA73","key":"DA73","title":"The Untapped Potential of Open Data: Igniting a New Era of Societal Prosperity and Innovation","description":"","tags":["Machine Learning"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:05:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747235100000,"utcEndTimeMilliseconds":1747236900000,"displayStartTime":"11:05 AM","displayEndTime":"11:35 AM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Track Keynote","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"eB2uJz4n2uFzZhjFw","name":"Alexandra Ebert","linkedin":"https://www.linkedin.com/in/alexandraebert","jobTitle":"Chief AI & Data Democratization Officer at MOSTLY AI | OECD.AI Expert AI & Privacy | IEEE Synthetic Data Chair | Podcast Host","company":"MOSTLY AI","avatar":{"backgroundColor":"pink","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/eB2uJz4n2uFzZhjFw/avatar/1745409277504.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA70","key":"DA70","title":"Breaking Barriers: How AI Agents Ensure Access to Live Data at Scale","description":"In a world where websites increasingly deploy sophisticated anti-bot defenses, building truly autonomous AI agents requires more than just intelligence — it demands resilience.\nIn this session, Ariel Shulman Bright Data’s CPO will explore how AI agents can enjoy uninterrupted, reliable access to any web resource, no matter the challenge.\nFrom dynamic IP rotation and browser fingerprinting to CAPTCHA bypassing and adaptive session management, we will dive deep into the technical strategies that keep agents unstoppable — even against the most aggressive protection mechanisms.\nLearn how enterprise-grade proxy networks, automated unlockers, and smart orchestration systems make continuous data acquisition not just possible, but scalable and dependable.\nAs part of the session, we will showcase a live demo of Google's brand-new Agent Development Kit (ADK) retrieving real-time information from the web — powered by Bright Data’s infrastructure — demonstrating how next-generation AI agents can access live data streams seamlessly, without being blocked or interrupted.\nWhether you're building AI-driven scrapers, search agents, or autonomous decision-makers, this talk will show you how to turn every obstacle into a gateway.","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747236900000,"utcEndTimeMilliseconds":1747238700000,"displayStartTime":"11:35 AM","displayEndTime":"12:05 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"vtBsyJ7rxS3fuaiRE","name":"Ariel Shulman","linkedin":"","jobTitle":"CPO","company":"Bright Data","avatar":{"backgroundColor":"chartreuse","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/vtBsyJ7rxS3fuaiRE/avatar/1745409470418.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA71","key":"DA71","title":"Building Collaborative AI Agents with ADK","description":"This hands-on workshop teaches the design and implementation of collaborative multi-agent systems. We'll address challenges like task decomposition, agent coordination, state management, and safety. Attendees will progressively build a Local Personal Assistant, learning transferable orchestration patterns (e.g., coordinator/specialist). We'll use Python and the open-source Agent Development Kit (ADK) to illustrate these principles, emphasizing concepts applicable beyond any single tool.","tags":["AI Agents"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747236900000,"utcEndTimeMilliseconds":1747240500000,"displayStartTime":"11:35 AM","displayEndTime":"12:35 PM","location":"Room 209","sessionLevel":"All Levels","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[{"key":"hiaPjMq8aFsL2cHhv","name":"Ivan Nardini","linkedin":"","jobTitle":"Developer Relations ","company":"Google","avatar":{"backgroundColor":"seagreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/hiaPjMq8aFsL2cHhv/avatar/1747059869601.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA72","key":"DA72","title":"Effective AI Decision Support: Overcoming Both Human and AI Fallability","description":"In many contexts, an AI is being to support a human decision maker (rather than making a decision on its own).  For example, an AI may provide a clinician with treatment recommendations for a particular patient.  In these settings, the hope is that human+AI team makes better decisions than either human or AI alone.\n\nHowever, this complementarity is rarely reached.  People will often over rely on AI systems, even when they are wrong; they may also under rely on AI systems when they are right.\n\nIn this short talk, I will cover some principles from our research on building AI systems that provide effective decision support.  I will discuss how the right kinds of explanations can help people determine how to use and trust an AI.  I will also discuss how the right support varies based on the context---not only the person's task, but also factors such as whether the task must be performed quickly.  It also varies based on the qualities of the person, such as their tendency to over rely on AIs.\n\nWhile my work is motivated by applications for decision support in healthcare, these principles apply broadly to many contexts in which an AI is providing information to help a person make a decision.","tags":["AI for Biotech and Pharma","AI Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747237200000,"utcEndTimeMilliseconds":1747239000000,"displayStartTime":"11:40 AM","displayEndTime":"12:10 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"Y8qnSPn3fKpu5iDQ5","name":"Finale Doshi Velez, PhD","linkedin":"","jobTitle":"Professor","company":"Harvard University","avatar":{"backgroundColor":"salmon","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/Y8qnSPn3fKpu5iDQ5/avatar/1745409961052.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA75","key":"DA75","title":"Panel Discussion: The Future of AI in Healthcare: Trends, Challenges, and Opportunities","description":"This panel will bring together industry experts to explore the latest trends, key challenges, and future opportunities in AI-driven healthcare. Join us for an insightful discussion on the evolving landscape, ethical considerations, and real-world applications shaping the future of healthcare innovation.","tags":["AI for Biotech and Pharma"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:40:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747237200000,"utcEndTimeMilliseconds":1747240800000,"displayStartTime":"11:40 AM","displayEndTime":"12:40 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Panel","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"M3kyZtrq69sNFqq8h","name":"Preeti Vaidya","linkedin":"","jobTitle":"VP, Data","company":"Morgan Health","avatar":{"backgroundColor":"maroon","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/M3kyZtrq69sNFqq8h/avatar/1745410958197.png"}},{"key":"EGBSf9HAY2EaNWzfy","name":"Timothy Lauer","linkedin":"","jobTitle":"Associate Director Data Sciences","company":"Amgen","avatar":{"backgroundColor":"darkorange","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/EGBSf9HAY2EaNWzfy/avatar/1746529954180.png"}},{"key":"Th3ZpKivhrouQXoRc","name":"Art Morales, PhD","linkedin":"","jobTitle":"Head of Technology and Data Science","company":"XponentL Data","avatar":{"backgroundColor":"tan","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/Th3ZpKivhrouQXoRc/avatar/1746529941172.png"}},{"key":"rYF2xAvfqQF2xSgxo","name":"Zhen Yang","linkedin":"","jobTitle":"Associate Data Scientist","company":"Moderna","avatar":{"backgroundColor":"rosybrown","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/rYF2xAvfqQF2xSgxo/avatar/1747067921646.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA76","key":"DA76","title":"Achieving Reliable and Responsible Enterprise AI Solutions via Coordinated Monitoring, Evaluation, and Governance","description":"As AI models gain widespread adoption across enterprises, ensuring their reliability and performance becomes increasingly critical. Today’s enterprise-scale AI systems are evolving into what Gartner refers to as “Composite AI”—integrated solutions that combine various traditional machine learning (ML) models and large language models (LLMs)  including open source AI models to create more comprehensive and powerful AI capabilities. These systems not only involve the models themselves but also rely on complex data pipelines and robust IT infrastructure to remain operational and effective.\nIn this talk, I will explore the key challenges in delivering reliable and responsible enterprise AI, particularly in the context of Composite AI architectures. I will introduce a set of intelligent and efficient monitoring, evaluation, and governance schemes designed to meet these challenges. Additionally, I will share real-world case studies that highlight the importance of these techniques and how these techniques enhance trust, accountability, and performance in enterprise AI deployments.","tags":["LLMOps & MLOps","AI Engineering","Data Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"11:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747237200000,"utcEndTimeMilliseconds":1747239000000,"displayStartTime":"11:40 AM","displayEndTime":"12:10 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"oJZHsTjSYZhLzBvXW","name":"Dr Helen Gu","linkedin":"","jobTitle":"Founder and CEO","company":"InsightFinder Inc.","avatar":{"backgroundColor":"teal","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/oJZHsTjSYZhLzBvXW/avatar/1745409819183.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA77","key":"DA77","title":"PyData Boston: Hacking Community Space - Build Your Own X Workshop","description":"Inspired by Codecrafters, this hands-on workshop will involve attendees recreating fundamental software tools from scratch, leading to a deeper practical understanding. Choose your hacking adventure:\nBitTorrent Client: Understanding P2P file sharing.\nGit Version Control: Demystifying Git by rebuilding its core.\nML knowledge through implementation.","tags":["Community Space","Networking +"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"12:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747238400000,"utcEndTimeMilliseconds":1747242000000,"displayStartTime":"12:00 PM","displayEndTime":"1:00 PM","location":"Room 212","sessionLevel":"","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"tNEYLmwAEsM4LEiuC","name":"Bryan Romas","linkedin":"","jobTitle":"Lead Data Scientist - NLP & GenAI","company":"Bose Corporation","avatar":{"backgroundColor":"papayawhip","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/tNEYLmwAEsM4LEiuC/avatar/1746622343943.png"}}],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA78","key":"DA78","title":"Rapid AI Development with lakeFS","description":"AI/ML model development is often hindered by fragmented management of datasets, code, and model versions. Data scientists frequently spend valuable time on infrastructure rather than innovation—searching for correct datasets, ensuring version compatibility, and managing complex dependencies.\nData scientists currently face significant workflow inefficiencies: manually copying and maintaining local dataset replicas, struggling with stale or inconsistent data versions, and juggling separate systems for tracking data, code, and model lineage. These challenges create friction that delays innovation and complicates reproducibility.\nlakeFS brings Git-like version control to data, enabling a unified approach to managing the entire ML development lifecycle. It streamlines model development through three key benefits: versioning data alongside models to reduce overhead, automating dataset tracking to simplify team collaboration, and ensuring model versions remain perfectly in sync with their corresponding data.\nIn this demo, you'll come away with data version control best practices that will help you accelerate your ML pipeline from experimentation to production. We'll demonstrate how lakeFS helps transform ML experimentation, simplifies team collaboration and ensures reproducible results using Git-like operations - ultimately reducing time-to-market for your AI initiatives.\nFor your convenience, I also mapped it out as \"problem / solution / outcomes\"","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"12:10:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747239000000,"utcEndTimeMilliseconds":1747240800000,"displayStartTime":"12:10 PM","displayEndTime":"12:40 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"dud3TxcYkpY57ofwp","name":"Oz Katz","linkedin":"","jobTitle":"CTO and Co-Founder","company":"lakeFs","avatar":{"backgroundColor":"lavenderblush","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/dud3TxcYkpY57ofwp/avatar/1747068196031.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA79","key":"DA79","title":"Beyond Productivity: Reimagining Your Innovation Pipeline in the AI Era","description":"As AI-powered tools reshape the landscape of software development, engineering managers and team leads must rethink how they allocate resources, prioritize projects, and structure their innovation pipelines. This talk provides a practical framework for navigating an AI-transformed development environment—one where efficiency gains are no longer the end goal but a launchpad for bolder, more strategic innovation.\n\nAttendees will learn methodologies for reassessing roadmaps, shifting from incremental improvements to long-term bets, and fostering a culture that balances execution discipline with ambitious experimentation. We’ll explore best practices for identifying high-impact projects that AI-enabled workflows can accelerate, while ensuring teams remain focused on complex, forward-looking challenges.\n\nUsing real-world case studies and reproducible techniques, this session will provide actionable insights into refining innovation strategies, reallocating cognitive effort, and making data-driven decisions about where AI-driven efficiencies can unlock transformative possibilities. By the end, participants will have a roadmap for ensuring their AI-enhanced teams are not just working faster—but working on the right things to drive future success.\n\tAttendees will learn how AI-driven productivity gains are reshaping innovation pipelines, enabling organizations to shift from incremental improvements to bold, long-term bets. They will gain a framework for reassessing project roadmaps, reallocating resources freed up by AI, and fostering a culture that balances execution with experimentation. The session will provide best practices for redefining collaboration and decision-making within engineering teams, ensuring that AI is not just automating workflows but also unlocking new opportunities for transformative innovation. By the end, participants will have actionable strategies to refine their innovation pipeline, prioritize high-impact projects, and navigate the evolving role of AI in software development.","tags":["AI Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"12:15:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747239300000,"utcEndTimeMilliseconds":1747241100000,"displayStartTime":"12:15 PM","displayEndTime":"12:45 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"RsBq9Am4cyN8Zu9h9","name":"Numair Baseer","linkedin":"","jobTitle":"Deployed Engineer","company":"Codeium","avatar":{"backgroundColor":"deeppink","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/RsBq9Am4cyN8Zu9h9/avatar/1746790690016.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA80","key":"DA80","title":"Data and a Dash of Python","description":"In today's world, people need to be able to quickly deploy sophisticated data applications. Speed is important, but there are tradeoffs between speed and complexity: fast, easy-to-use solutions tend to not offer as much customization, while building complex custom applications from scratch takes considerable time and effort.\n\nDuring this talk, we'll discuss how to get the best of both worlds by using Plotly Dash, an open-source Python-based framework that's easy to learn, flexible, and offers deep customization. In addition to discussing Dash and how it differs from other ways of building analytic applications, we'll discuss the fundamentals of how to build a Dash application from scratch.\n\nWhether you're a seasoned application developer or someone who's never built an app before, this session will have something for you!","tags":["Machine Learning"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"12:15:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747239300000,"utcEndTimeMilliseconds":1747241100000,"displayStartTime":"12:15 PM","displayEndTime":"12:45 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"eHTGfMM23BGsTbyL5","name":"Mingo Sanchez","linkedin":"","jobTitle":"Senior Sales Engineer","company":"Plot.Ly","avatar":{"backgroundColor":"red","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/eHTGfMM23BGsTbyL5/avatar/1747153340280.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA146","key":"DA146","title":"Lunch","description":"Lunch is available for purchase downstairs near the entrance! Grab some food and join us in the Expo Hall for seating.","tags":["Networking +"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"13:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747242000000,"utcEndTimeMilliseconds":1747245600000,"displayStartTime":"1:00 PM","displayEndTime":"2:00 PM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA81","key":"DA81","title":"AI Unraveled: Navigating the Risks, Rewards, and Reality of Artificial Intelligence","description":"Artificial intelligence is no longer some futuristic technology with limited scope and esoteric abilities; it has become a strategic imperative and an existential threat in every business. Yet, despite the massive investments in AI, most organizations fail to extract real business value. At best, it is a beautiful deck or stunning proof-of-concept running on someone’s laptop. Despite more than a decade of practice, studies consistently reveal that most machine learning projects fail to transition from pilot to production, with only 32% of such deployments moving successfully to operational use. However, companies that get it right are seeing game-changing results—according to IDC, the top performers in generative AI are achieving 10X ROI. So, what separates AI initiatives that thrive from those that stall? How can you ensure your business does not fall behind and suffer the same fate as Blockbuster, Polaroid, and Nokia?\n\nIn this talk, Jason Goth Chief Technology Officer at Credera and co-author of The Intelligent Enterprise, will share his proven AI playbook that has helped companies unlock over $100 million in incremental revenue. These strategies have enabled wet-lab R&D scientists to cut research time by 87%, decreased the time to first FDA submission by 77%, and have been battle-tested at industry leaders like Uber, Microsoft, and GE. With over 93% of AI initiatives delivering positive ROI, this framework provides a repeatable approach to AI success.\n\nAttendees will gain:\n        •        A practical AI ROI framework—how to assess, prioritize, and scale AI projects effectively.\n        •        Key drivers of AI success—why so many ML projects fail and how to fix them.\n        •        Implementation of best practices—leveraging modular AI architectures, MLOps, and modern data governance (ML-driven) to maximize impact.\n        •        Real-world case studies—how global enterprises have turned AI into a competitive advantage.\n\nWhether you’re an executive, data leader, or AI practitioner, this session will provide a roadmap for moving beyond AI experimentation to real business transformation. The AI revolution is here—are you ready to capitalize on it?","tags":["Generative AI","AI for Biotech and Pharma"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747245600000,"utcEndTimeMilliseconds":1747247400000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Room 211","sessionLevel":"Beginner-Intermediate","sessionType":"GenAi X Talk","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"SiXxPyLWwc5dwouRb","name":"Jason Goth ","linkedin":"","jobTitle":"Chief Technology Officer","company":"Credera","avatar":{"backgroundColor":"navy","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/SiXxPyLWwc5dwouRb/avatar/1747068506781.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA82","key":"DA82","title":"Beyond ChatBots: Unleashing Human Creativity with Cognitive Cartography, Glass-Box AI, and Visual Data Science in Mantis","description":"Artificial intelligence is reshaping how we work, reason, and learn. But current chatbot frameworks are excluding humans from the creative process, underutilizing the extraordinary acuity of human visual cognition, hiding away necessary complexity, and providing over-confident and over-simplified answers to complex questions, resulting in reduced human creativity and ingenuity. Mantis provides a new paradigm for human-AI collaboration that extends human conceptual reach, insight, and speed, by blending natural language, structured data, and visual reasoning into an interactive canvas for exploration and discovery. At its core, Mantis constructs maps of meaning, latent landscapes representing ideas, documents, emails, collaborators, molecules, genes, or patients, laid out by their conceptual organization. Our cartography reveals semantically-grounded gradients, learned from natural language, quantitative data, knowledge graphs, geometric structures, and latent embeddings. Users engage not just with dashboards, but with navigable knowledge spaces, selecting, clustering, annotating, and guiding AI agents that evolve through interaction. We apply Mantis to data science, where text and numbers converge, prompts become filters, paragraphs become vectors, and hypotheses become trajectories, enabling interactive workflows where language and data continuously refine each other. In business analytics, our maps capture enterprise data, contracts, decisions, customer journeys, financial decisions, legal constraints, operational insights, unexpected outliers, and corporate insights. In healthcare, our cartography helps clinicians and analysts understand patient trajectories across multimodal health records, linking symptoms to diagnostics, interventions to outcomes, and best-next-action predictions. In biology and chemistry, we map structure-to-function relationships for proteins, drugs, and their interactions, enabling novel insights and unmatched creativity guiding drug development through cellular biology. Each tool in Mantis is an autonomous reasoning agent, capable of performing tasks, communicating, reasoning, and learning, coordinated by an orchestrator agent that interprets user goals, decomposes tasks, sequences agent execution, and enables coordination across workflows. And users guide this coordinated execution with the support of a growing community of transparent, adaptive, transparent, interpretable, eager, and extraordinarily capable assistants. Mantis is not a chatbot. It’s a shift in how humans and machines think and create together, an interactive platform for seeing the invisible, reasoning through complexity, and navigating knowledge itself.","tags":["Generative AI","LLMs","AI for Biotech and Pharma"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747245600000,"utcEndTimeMilliseconds":1747247400000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Track Keynote","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"7h9u3yTja2uEFoCxH","name":"Manolis Kellis","linkedin":"https://www.linkedin.com/in/manolis-kellis/","jobTitle":"Professor of AI and Computer Science","company":"MIT, AI, CS, CSAIL, Broad","avatar":{"backgroundColor":"cadetblue","source":"https://prod-virtual-conf-nv-backend.s3.amazonaws.com/mobile/users/7h9u3yTja2uEFoCxH/avatar/1747051714573.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA83","key":"DA83","title":"Explainable AI for Decision-Making Applications","description":"In today's rapidly evolving AI landscape, data scientists play pivotal roles in ensuring innovation and accountability. This workshop on explainable AI (XAI) equips data and ML professionals with essential skills to navigate this rapidly expanding complex terrain. Participants will gain hands-on experience exploring compliance considerations derived from real-world applications across diverse sectors. By merging technical expertise with compliance insights, this course empowers individuals to drive impactful, transparent AI solutions in their respective domains, fostering innovation and integrity.\n\nThis workshop explores XAI, covering essential background definitions and concepts, explainable feature engineering, the diverse ecosystem of XAI models, and post-hoc explanation methods. Some of the featured topics in this workshop on explainable AI (XAI) include:\n\n• The fANOVA framework\n• Monotonic GBMs\n• Surrogate model approaches\n• Explainable feature engineering\n• LOCO, LOFO, and pertubation\n• SHAP: The good, bad, and ugly\n• Security and bias considerations\n\nBackground information and definitions are sourced from Machine Learning for High Risk Applications, National Institute for Standards and Technology (NIST), the National Academies, and other authoritative sources. The instructor teaches technical subjects with Python examples based on his real-world experience in consumer finance, employment, and other regulated applications of ML. \n\nThis workshop is designed primarily for data scientists and ML engineers. Technical risk executives or risk managers may find this workshop helpful in providing an updated overview of newer ML approaches suited for high-stakes applications. This course may interest others too. Materials may help regulators or policy professionals gain insights into the current state of ML technologies that can be used to comply with laws, regulations, or standards. If you're coming to ML from physics, econometrics, or psychometrics, this course can help you learn how to blend newer ML techniques with established domain expertise and notions of validity or causality.\n\n(Note: The instructor is not an attorney.)","tags":["Machine Learning"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:00:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747245600000,"utcEndTimeMilliseconds":1747252800000,"displayStartTime":"2:00 PM","displayEndTime":"4:30 PM","location":"Room 208","sessionLevel":"Intermediate-Advanced","sessionType":"Training","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"YyS3nHjFGAX8EBrDt","name":"Patrick Hall","linkedin":"","jobTitle":"Assistant Professor | Principal Scientist","company":"GWSB | HallResearch.ai","avatar":{"backgroundColor":"gray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/YyS3nHjFGAX8EBrDt/avatar/1745410929200.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA84","key":"DA84","title":"Building Agentic APIs With LLM Tool Use & Knowledge Graphs","description":"The true power of LLMs isn’t in building chatbots, but rather leveraging AI models for implementing agentic workflows in the applications we build, adding features to our apps powered by LLMs that interact with APIs and data sources directly. This talk will introduce the building blocks of adding LLM backed agentic features to your app and demonstrate how we can use them together to add AI backed intelligent features chaining data and LLMs together, leveraging LLM function calling and tool use, and knowledge graph RAG.","tags":["AI Agents"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747245600000,"utcEndTimeMilliseconds":1747249200000,"displayStartTime":"2:00 PM","displayEndTime":"3:00 PM","location":"Room 209","sessionLevel":"Intermediate","sessionType":"Tutorial","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"dnYWdd7MiHNRRfFYr","name":"William Lyon","linkedin":"https://linkedin.com/in/lyonwj","jobTitle":"Developer Experience","company":"Hypermode","avatar":{"backgroundColor":"blanchedalmond","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/dnYWdd7MiHNRRfFYr/avatar/1745411503293.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA85","key":"DA85","title":"SLMs vs LLMs for Token Classification: Do Smaller Models Still Outperform LLMs?","description":"In 2018, BERT revolutionized NLP by providing a general encoding model that could be fine-tuned for a wide variety of NLP tasks. Five years later, Large Language Models (LLMs) seem poised to replace BERT for many NLP problems. In this talk, we compare the performance of Small Language Models (SLMs) like BERT with LLMs on a classic NLP task: Named Entity Recognition (NER). We explore when it makes sense to choose an SLM versus an LLM and whether in-context learning with LLMs can significantly reduce or even eliminate the need for task-specific training data. We highlight key challenges in leveraging LLMs for NER by comparing accuracy and throughput of both model types on several benchmarks. Finally, we offer practical guidance for developing effective NER models using both SLMs and LLMs","tags":["LLMs","Generative AI"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747245600000,"utcEndTimeMilliseconds":1747247400000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Room 204","sessionLevel":"Beginner-Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"YWXeN95tkXKLTtZRC","name":"Ander Steele","linkedin":"","jobTitle":"Head of AI at Tonic AI","company":"Tonic AI","avatar":{"backgroundColor":"darkviolet","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/YWXeN95tkXKLTtZRC/avatar/1745409329265.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA86","key":"DA86","title":"Women in Data Science Ignite: Sharing Insights and Networking Session moderated by Hema Seshadri\n1. A Value Playbook for Sustainable Data Science Adoption\n2. Know Better, Do Better: Bridging Data Literacy and Responsible AI\n3. Unpacking Representation: Cultural Nuances and Real-World Impacts of LLM Bias","description":"Hema Seshadri, PhD - Principal Consulting AI & Data Engineer | Akamai Technologies - moderator\n\n1. Lauren Burke-McCarthy - Senior AI Strategy Lead | Further\nA Value Playbook for Sustainable Data Science Adoption        \nPioneering data science adoption within an organization comes with challenges and opportunities. This session will introduce practical strategies and frameworks for setting expectations, framing problems that align value with organizational needs, and delivering communication and user-focused documentation that improves transparency.\nDiscover how to increase buy-in and enable quick wins with practical approaches to stakeholder engagement, like the road trip method. Attendees will learn to invest in the right use cases, scope projects effectively, and demystify the process while delivering incremental value. \nThis session will highlight best practices for value-first, impact-aligned communication and explore how design thinking fosters successful data science projects.\n\n2. Angelica Spratley - Manager of Academic Data | Senior Technical Curriculum Developer - KIPP NC | The Marcy Lab School\nKnow Better, Do Better: Bridging Data Literacy and Responsible AI        \nThis session will highlight the critical importance of data literacy as a foundational element of responsible AI practices. By understanding data interpretation, bias recognition, and the implications of data-driven decision-making, participants will be better equipped to contribute to AI projects responsibly. The talk will offer a comprehensive strategy for implementing a data literacy program within an organization, making it relevant for data teams, business leaders, and data stewards alike.  This talk will utilize an audience QR polling system with emojis for ongoing interactivity!\nThree Main Objectives:\nUnderstanding Data Literacy's Role in Responsible AI:\nParticipants will learn how data literacy enhances the effectiveness of AI initiatives and promotes ethical decision-making. This segment will cover key concepts in data interpretation and statistics, emphasizing the necessity of a data-literate workforce in mitigating risks associated with AI bias.\nIdentifying Bias in Data and AI Systems:\nThe second objective will focus on recognizing various forms of bias and their potential impact on AI outcomes. Participants will engage in discussions about real-world examples where lack of data literacy led to biased AI systems, reinforcing the need for awareness and data literacy.\nDeveloping a Comprehensive Data Literacy Program:\nParticipants will leave with a clear, actionable strategy for building a data literacy program within their organization (bringing the first 2 points together). This will include a step-by-step timeline, identifying key stakeholders, and outlining necessary resources to ensure successful implementation.\n\n3. Shiran Dudy - Research Scientist | Northeastern University\nUnpacking Representation: Cultural Nuances and Real-World Impacts of LLM Bias        \nLarge Language Models (LLMs) are trained on extensive text corpora sourced from the internet, enabling them to engage in multilingual communication and demonstrate knowledge across a wide range of topics. However, their training data inherently reflects the biases and limitations of the content available online. This often results in a skewed perspective of the world, where certain life experiences, cultures, and viewpoints are overrepresented, while others remain marginalized or entirely absent.\nIn this talk, we will delve into two case studies that critically examine the representation of diverse identities, cultures, and experiences in Large Language Models (LLMs). These case studies aim to unpack the complexities of how LLMs encode and reflect cultural nuances, as well as the practical implications of their outputs on real-world scenarios.\nThe first case study investigates how LLMs capture and generate culturally specific knowledge and emotions. By replicating a human-subject study that revealed differences in emotional expression and perception between collectivistic and individualistic societies, we analyze whether and how LLMs mirror these cultural distinctions. This study not only highlights discrepancies in LLM responses across different languages and regions but also probes the extent to which these systems align with or deviate from established cultural norms and values.\nThe second case study explores the downstream impacts of representational biases on everyday users. Specifically, we examine LLMs’ recommendations for locations across various domains—such as relocation, tourism, and business opportunities—under diverse constraints. This analysis uncovers patterns in how the LLM prioritizes certain locations and de-emphasizes others, potentially influencing decision-making, access to opportunities, and even regional economic dynamics. By identifying overrepresented and underrepresented areas, this study sheds light on the ripple effects of bias in AI-driven guidance on broader societal structures.\nThrough these investigations, we aim to shed light on the broader implications of representation in AI systems, emphasizing how current limitations can reinforce systemic biases, perpetuate inequities, and marginalize underrepresented communities. By identifying these challenges, we also seek to spark critical discussions on the ethical responsibilities of AI developers and researchers in addressing these issues.","tags":[],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747245600000,"utcEndTimeMilliseconds":1747249200000,"displayStartTime":"2:00 PM","displayEndTime":"3:00 PM","location":"Room 212","sessionLevel":"","sessionType":"Women in DS","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"fjgALAF2gAZhJ5TvD","name":"Hema Seshadri, PhD","linkedin":"","jobTitle":"Principal Consulting AI & Data Engineer","company":"Akamai Technologies","avatar":{"backgroundColor":"floralwhite","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/fjgALAF2gAZhJ5TvD/avatar/1745410177004.png"}},{"key":"sh9Cr7f6t7bw8rfkx","name":"Lauren Burke-McCarthy","linkedin":"","jobTitle":"Senior AI Strategy Lead","company":"Further","avatar":{"backgroundColor":"darkolivegreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/sh9Cr7f6t7bw8rfkx/avatar/1745410344802.png"}},{"key":"hs5ugbpekuP8yHQz2","name":"Angelica Spratley","linkedin":"","jobTitle":"Manager of Academic Data & Technical Curriculum Developer","company":"KIPP NC & Marcy Lab School","avatar":{"backgroundColor":"slategray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/hs5ugbpekuP8yHQz2/avatar/1745409454691.png"}},{"key":"b3hoEjE95TknFzZpe","name":"Shiran Dudy","linkedin":"","jobTitle":"Research Scientist","company":"Northeastern University","avatar":{"backgroundColor":"rosybrown","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/b3hoEjE95TknFzZpe/avatar/1745411153783.png"}}],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA87","key":"DA87","title":"Building Reliable AI Agents: Evaluation Strategies for Production","description":"To ensure successful AI agent deployment and achieve reliable production performance, a comprehensive evaluation strategy is essential. This session covers practical, engineering-driven strategies to do just that: build a set of test cases, break down agent steps, create evaluators for each step, experiment, and iterate. Learn how observability platforms can provide real-time feedback and streamline experiment management. Equip yourself with the tools and strategies to confidently deploy high-performing AI agents at scale.","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747245600000,"utcEndTimeMilliseconds":1747247400000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"NmT4HGXanCpWKFPrA","name":"John Gilhuly","linkedin":"","jobTitle":"Head of Developer Relations","company":"Arize AI","avatar":{"backgroundColor":"deeppink","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/NmT4HGXanCpWKFPrA/avatar/1746790675531.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA88","key":"DA88","title":"Agentic AI Safety for Enterprises","description":"Join AutoAlign’s CEO, Dan Adamson, to explore how to keep agentic AI systems safe across a variety of enterprise applications and frameworks.\n\nWe’ll look at the additional risks that agentic systems impose, and how traditional AI safety approaches like guardrails are not sufficient.  We’ll then look at how an AI supervisor model can help ensure compliance, security and robustness. This session will highlight cutting-edge advancements in Agentic AI and look at how to keep common agentic frameworks safe.\n\nPeek into the future of enterprise Agentic AI with Dan Adamson as he shares how two decades of experience in AI security led to the development of supervisor systems—ensuring agentic AI systems remain safe and reliable.","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747247700000,"utcEndTimeMilliseconds":1747249500000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"w7CjDMcFciQEv8y2y","name":"Dan Adamson","linkedin":"","jobTitle":"CEO of AutoAlign","company":"AutoAlign AI","avatar":{"backgroundColor":"paleturquoise","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/w7CjDMcFciQEv8y2y/avatar/1746790649469.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA89","key":"DA89","title":"Building State-of-the-Art, Open-Source Embedding Models","description":"Deep learning-powered retrieval systems are the backbone of modern LLM applications, enabling efficient semantic search, recommendation, and knowledge retrieval. This talk unpacks the journey behind building, training, and scaling the Nomic Embed model series—one of the most widely used open-source, multilingual, multimodal embedding families on Hugging Face, with over 35M+ downloads. We’ll explore the data curation pipeline, training infrastructure, and inference-time objectives that make these models state-of-the-art, including innovations like Matryoshka resizability, quantization, and sparse mixture-of-experts training. Additionally, we'll discuss the unique challenges of pushing applied deep learning forward in an industry lab, where real-world constraints drive cutting-edge advancements in embedding model design.","tags":["LLMs","RAG","AI Agents","Data Visualization & Analysis"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747247700000,"utcEndTimeMilliseconds":1747249500000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"PK68E46nYgtJsbnhb","name":"Max Cembalest","linkedin":"","jobTitle":"Developer Advocate\t","company":"Nomic AI","avatar":{"backgroundColor":"darkslategrey","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/PK68E46nYgtJsbnhb/avatar/1747125042535.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA90","key":"DA90","title":"Reproducible AI with Langchain and lakeFS","description":"Langchain has become one of the most popular frameworks for anyone building custom, Generative AI-driven apps powered by LLMs, that leverage RAG (Retrieval-Augmented Generation) for the most enhanced results. But like all data products, these applications are really only as good as the organizational data fed into them––and as many fellow practitioners have learned the hard way, data is oftentimes far from perfect.In this talk you’ll learn how to build a reproducible AI application pipeline with Langchain and lakeFS, widely adopted OSS tools in the ML & GenAI stack.\nBy learning how to build a RAG chatbot, while iteratively tuning it for best results leveraging lakeFS’s temporal versions, you’ll come away with improved methods for data reproducibility for your custom AI apps, that provide better data quality, alongside an improved user experience for your application users.\n\nProblem -\nData is oftentimes far from perfect and like all data products, applications are only as good as the organizational data fed into them.\n\nSolution -\nLangchain has become one of the most popular frameworks for anyone building custom, Generative AI-driven apps powered by LLMs, that leverage RAG (Retrieval-Augmented Generation) for the most enhanced results. In this tutorial, you’ll learn how to build a reproducible AI application pipeline with Langchain and lakeFS, widely adopted OSS tools in the ML & GenAI stack.\n\nTools -\nLangchain, lakeFS, other OSS tools\n\nLearning Outcomes -\nBy learning how to build a RAG chatbot, while iteratively tuning it for best results leveraging lakeFS’s temporal versions, you’ll come away with improved methods for data reproducibility for your custom AI apps, that provide better data quality, alongside an improved user experience for your application users.","tags":["LLMs","LLMOps & MLOps","Data Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747247700000,"utcEndTimeMilliseconds":1747249500000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Room 204","sessionLevel":"","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"dud3TxcYkpY57ofwp","name":"Oz Katz","linkedin":"","jobTitle":"CTO and Co-Founder","company":"lakeFs","avatar":{"backgroundColor":"lavenderblush","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/dud3TxcYkpY57ofwp/avatar/1747068196031.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA91","key":"DA91","title":"Modern AI Strategy: Navigating Innovation, Ethics, and Enterprise Impact","description":"This section will elevate your end-to-end understanding of AI with a deeper than usual vision that will help to have a better understanding of the opportunities, risks and future trends. We will go a bit deeper into emerging technology, like agents, and where they are headed so you can prepare your organization in advance. \nAI Strategy \nExplore different options for your AI strategy to navigate opportunities and risks in a post-GPT world. We will also provide insights  \nIn this section, we will discuss the opportunities that the market provides, how to successfully engage with internal and external client  \n \nMaster innovation \nThis section will be focused on how to infuse innovation in your organization, upskill your workforce and set-up for success. \n \nInteractive discussions \nBring your business specific questions, thoughts and concerns about AI application, and gain valuable insights to accelerate your organization.","tags":["Generative AI"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747247700000,"utcEndTimeMilliseconds":1747249500000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"t6bsFC6TLeQYGmXJT","name":"Leonardo De Marchi","linkedin":"","jobTitle":"VP of Labs","company":"Thomson Reuters","avatar":{"backgroundColor":"darkslateblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/t6bsFC6TLeQYGmXJT/avatar/1746530295153.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA92","key":"DA92","title":"Book Signing with Jason Goth , Author of The Intelligent Enterprise","description":"Book Lovers Alert! Author Session with Free Giveaways!\nJoin us for an exciting session of talented author!  Discuss their work, gain insights into their creative process, and get a chance to get a free copy of their book (limited quantities available).","tags":[],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"15:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747249200000,"utcEndTimeMilliseconds":1747251000000,"displayStartTime":"3:00 PM","displayEndTime":"3:30 PM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Book Signing","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"SiXxPyLWwc5dwouRb","name":"Jason Goth ","linkedin":"","jobTitle":"Chief Technology Officer","company":"Credera","avatar":{"backgroundColor":"navy","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/SiXxPyLWwc5dwouRb/avatar/1747068506781.png"}}],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA147","key":"DA147","title":"Coffee Break","description":"","tags":["Networking +"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"15:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747249200000,"utcEndTimeMilliseconds":1747251000000,"displayStartTime":"3:00 PM","displayEndTime":"3:30 PM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA93","key":"DA93","title":"Trust Your LLMs: Evaluating AI with RAGMetrics","description":"Let Your AI Judge Itself. Most teams deploy LLMs without ever properly testing if they work. Hallucinations go live. QA is manual. And trust is low.\nAt RAGMetrics, we remove the human bottleneck by making the LLM itself the judge — at human-level accuracy.","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"15:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747251000000,"utcEndTimeMilliseconds":1747252800000,"displayStartTime":"3:30 PM","displayEndTime":"4:00 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"AsREB3zve8GTbDm6Y","name":"Olivier Cohen","linkedin":"","jobTitle":"Chief Business Officer","company":"Ragmetrics.ai","avatar":{"backgroundColor":"cornsilk","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/AsREB3zve8GTbDm6Y/avatar/1746790664564.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA94","key":"DA94","title":"Session is Cancelled: The AI Storyteller: How Generative AI Is Reinventing Brand Messaging and Safe Storytelling at Scale","description":"Generative AI is revolutionizing the way businesses communicate, create content, and build brand narratives. However, many professionals struggle to harness its full potential while maintaining authenticity and human creativity.\n\nIn this session, we’ll explore on how Generative AI is transforming brand storytelling with a practical lens - showing real-world frameworks and a quick demo of how we’re currently building brand-safe, AI-generated narratives that resonate. \n\nWe’ll also showcase Edge & Echo’s Story Studio, where we leverage AI to craft cinematic, high-impact brand stories that combine visual storytelling, AI-generated narratives, and data-driven decision-making.\n\nWhether you're a business leader, marketer, or AI practitioner, this session will provide practical takeaways and strategic insights on how to integrate AI into your content strategy effectively. Attendees will leave with a roadmap for using AI as an enabler of creativity—not a replacement for human ingenuity.","tags":["Generative AI"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"15:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747251000000,"utcEndTimeMilliseconds":1747252800000,"displayStartTime":"3:30 PM","displayEndTime":"4:00 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Talk","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"h4uz6sxsMeMYoYjBu","name":"Adam Rochon","linkedin":"","jobTitle":"Director of Strategic Growth & Stakeholder Relations","company":"Edge and Echo","avatar":{"backgroundColor":"darkgray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/h4uz6sxsMeMYoYjBu/avatar/1745409226271.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA95","key":"DA95","title":"Adaptive RAG Systems with Knowledge Graphs: Building Reinforcement-Learning-Driven AI Applications","description":"This workshop will dive into building an adaptive retrieval-augmented generation (RAG) system using graph databases, designed to continuously improve its performance through reinforcement learning. By combining the rich, interconnected structure of knowledge graphs with a feedback-driven RL loop, this approach enables AI applications that evolve in real-time, leveraging both historical and dynamic insights for smarter, more relevant responses.\n\nThis session will focus on how to construct and deploy a knowledge graph-based RAG system that learns from regular feedback. Using open-source graph databases, attendees will gain practical experience in capturing information to used for retraining the model with positive feedback data. This workshop emphasizes the importance of continuous adaptation for production AI applications, teaching participants how to integrate reinforcement signals that fine-tune responses and enhance the overall relevance and accuracy of LLM-powered applications.\n\nBy the end of the workshop, attendees will gain a solid understanding of knowledge graphs in RAG applications, including how to build, query, and maintain these systems to support reinforcement learning. Participants will also walk away with practical skills in implementing feedback loops and conducting periodic retraining, enabling them to build adaptive AI solutions capable of meeting evolving data requirements. Ideal for AI developers and data scientists, this workshop will equip attendees with techniques and best practices to deploy high-performance, self-improving AI applications.","tags":["LLMs","RAG"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"15:30:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747251000000,"utcEndTimeMilliseconds":1747254600000,"displayStartTime":"3:30 PM","displayEndTime":"4:30 PM","location":"Room 209","sessionLevel":"Intermediate","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA96","key":"DA96","title":"High-Performance Data Visualization: A Local-First Approach","description":"","tags":["Data Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"15:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747251000000,"utcEndTimeMilliseconds":1747252800000,"displayStartTime":"3:30 PM","displayEndTime":"4:00 PM","location":"Room 204","sessionLevel":"","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"3fEEbXdFyHGmn94pL","name":"Andrew Stein","linkedin":"","jobTitle":"CTO","company":"Prospective","avatar":{"backgroundColor":"palegoldenrod","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/3fEEbXdFyHGmn94pL/avatar/1745409432087.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA97","key":"DA97","title":"Graph Inflection Point: New Strategies for Connected Intelligence","description":"In my decade following the graph technology landscape, I've never witnessed such rapid transformation as we're seeing now. The intersection of AI, new frameworks, and evolving use cases has created a perfect storm of innovation that's reshaping how we think about connected data. In this talk, we'll dive into recent market shifts and graph technology innovations that are changing the way organizations can now tackle and incorporate more connected intelligence.\nIn the last year, we've seen graph awareness explode, but adoption remains with very focused production uses rather than broad application. In addition, everyone is looking to make developing and using graphs more intuitive, from query languages and developer tools to dashboarding and graph BI.\nPerhaps most disruptive is how AI and LLMs have fundamentally changed expectations around what's possible with graph technologies:\nKnowledge graphs are increasingly serving as critical context for AI systems\nAgentic workflows are automating graph creation while also potentially introducing risks of ill-defined graph structures\nLLMs are making graphs more human-friendly than ever before\nAnd the industry overall is lowering the barrier to entry for organizations across sectors\nIn addition, we'll look at how companies are evolving traditional graph database applications towards more specialized frameworks and a mix of different frameworks within a single environment. We'll also explore emerging use cases and applications across industries, examining how legal document processing, manufacturing processes, and digital twins are leveraging graph technologies in novel ways.\nWe'll also cover emerging innovations like graph-vector hybrid models, multimodal GraphRAG, and temporal graphs. We'll lightly touch on advanced graph concepts like hypergraphs, and neuromorphic approaches that are pushing the boundaries of what's possible.","tags":["LLMs","RAG"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"15:30:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747251000000,"utcEndTimeMilliseconds":1747252800000,"displayStartTime":"3:30 PM","displayEndTime":"4:00 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"2tDGhu2LNq4Ejh46H","name":"Amy Hodler","linkedin":"","jobTitle":"Executive Director","company":"GraphGeeks.org","avatar":{"backgroundColor":"azure","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/2tDGhu2LNq4Ejh46H/avatar/1745409318469.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA98","key":"DA98","title":"Data Review is the New Code Review - An Example with dbt","description":"Code-first approaches to data systems have brought version control and testing to data work, but code review practices haven't fully transferred to the data domain. Without early stakeholder involvement in reviews, teams face increased rework, misaligned business logic, and costly downstream errors that undermine trust.\n\nThis hands-on session demonstrates implementing effective data review using dbt. Just as code review improves software quality, data review transforms collaboration on data assets by bringing stakeholders in earlier. Learn practical techniques for reviewing transformations, validating business logic, and ensuring data quality before production. You'll leave with actionable strategies to enhance your team's data quality through systematic data review processes, whether you're already using dbt or just considering it.","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:05:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747253100000,"utcEndTimeMilliseconds":1747254900000,"displayStartTime":"4:05 PM","displayEndTime":"4:35 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"CRKeyL96wKCqMKFr5","name":"Karen Hsieh","linkedin":"","jobTitle":"Product Manager","company":"Recce","avatar":{"backgroundColor":"darkturquoise","source":""}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA99","key":"DA99","title":"Beyond the Prompt: Architecting Reliable Enterprise LLM Agents","description":"Building scalable, safe and seamless LLM agents for enterprise is a difficult task despite recent improvements in model tool-calling capabilities. Enterprise usecases have strict accuracy and safety requirements that necessitate complex orchestration and strategic selection across a panacea of frameworks, tools, models and evaluation criteria. In this talk we walk you through the critical decision making process in setting up enterprise agents focusing on a customer support usecase. Specifically, we discuss the frameworks we love, how we define robust tools and ensure safety via human-in-the-loop, highlight our evaluation criteria and importantly, discuss how we improve model capabilities with synthetic training data.","tags":["AI Agents","AI Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:05:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747253100000,"utcEndTimeMilliseconds":1747254900000,"displayStartTime":"4:05 PM","displayEndTime":"4:35 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"m5xEcoRNzsCM3Sb8M","name":"Vivek Muppalla","linkedin":"","jobTitle":"Director of AI Engineering","company":"Cohere","avatar":{"backgroundColor":"thistle","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/m5xEcoRNzsCM3Sb8M/avatar/1745411421664.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA100","key":"DA100","title":"Panel Discussion: Investing in the Future: What’s Next for AI and Tech Startups?","description":"In this panel discussion, seasoned experts, investors, and visionaries will come together to shed light on the emerging trends, ecosystems, and disruptive technologies that are fostering the growth of the next generation of AI startups. Discover the secrets to recognizing innovation, and gain insights into the unique qualities that set these startups on a path to success. Be part of the conversation that’s shaping the future of AI entrepreneurship and innovation.","tags":["Generative AI"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:05:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747253100000,"utcEndTimeMilliseconds":1747256700000,"displayStartTime":"4:05 PM","displayEndTime":"5:05 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"GenAi X Panel","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"rSWD4ddyTmF9QfMZ8","name":"Cameron Royce Turner","linkedin":"","jobTitle":"Founder and CEO","company":"TRUIFY.AI","avatar":{"backgroundColor":"lightblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/rSWD4ddyTmF9QfMZ8/avatar/1745409641648.png"}},{"key":"jL6ZD9huvfnoGZH4j","name":"Jennifer Jordan","linkedin":"","jobTitle":"Operating Partner","company":"iGlobe Partners","avatar":{"backgroundColor":"darkred","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/jL6ZD9huvfnoGZH4j/avatar/1745410249694.png"}},{"key":"wcaFCMnyedJQdApkD","name":"barbara widholm","linkedin":"","jobTitle":"VP","company":"State Street","avatar":{"backgroundColor":"dimgrey","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/wcaFCMnyedJQdApkD/avatar/1747251859964.png"}},{"key":"DPzzJcLXvo7FekHdT","name":"Mike Obolonskyi ","linkedin":"","jobTitle":"Principal","company":"Cortical Ventures","avatar":{"backgroundColor":"lawngreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/DPzzJcLXvo7FekHdT/avatar/1747251842692.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA101","key":"DA101","title":"Securing AI/ML Development in the Age of Hugging Face","description":"","tags":["LLMOps & MLOps","AI Engineering","Data Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:05:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747253100000,"utcEndTimeMilliseconds":1747256700000,"displayStartTime":"4:05 PM","displayEndTime":"4:35 PM","location":"Room 204","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"5MmJZs4ZFjDYDovvP","name":"Hudson Buzby","linkedin":"","jobTitle":"Solutions Architect","company":"JFrog","avatar":{"backgroundColor":"aliceblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/5MmJZs4ZFjDYDovvP/avatar/1746814909966.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA102","key":"DA102","title":"Advancing GraphRAG: Text, Images, and Audio for Multimodal Intelligence","description":"Let's face it—vector searches alone just don’t cut it anymore and integrating graphs with RAG processes has demonstrated clear benefits in improving the accuracy and explainability of GenAI.  By enhancing vector searches with global enrichment and domain-specific grounding, graphs provide a powerful framework for tackling messy data. So it’s no surprise that the GraphRAG bandwagon is getting pretty crowded these days—from academic papers to GitHub repos that multiply like rabbits, everyone's jumping on board. However, as anyone who’s worked with graphs knows, they require careful iteration and refinement to deliver the best results.\n\nWhile the current GraphRAG crowd is obsessing over text and lexical graphs, they're missing the elephant in the room—all that juicy non-text data just sitting there untapped. Images and audio are rich with latent signals that are often ignored, despite their ability to add significant context to AI workflows. The next big leap for GraphRAG lies in fully integrating these multimodal data sources, creating a more comprehensive and explainable approach.\n\nIn this session, we’ll introduce Multimodal GraphRAG (mmGraphRAG)—a cutting-edge framework that combines the semantic richness of images, audio, and text with the contextual reasoning power of graphs. This transformative approach enables an associative intelligence that moves search and analytics closer to the way humans abstract concepts and connect ideas. \n\nWe’ll guide you through the high-level architecture of mmGraphRAG and explore how associative intelligence drives its capabilities. By the end of this session, you'll either be a mmGraphRAG convert or you'll have at least collected enough buzzwords to sound impressive at your next team meeting—either way, it's a win!\n\nJoin us to explore how integrating multimodal data into GraphRAG can transform the way we approach search, analytics, and AI-driven insights.","tags":["LLMs"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747254900000,"utcEndTimeMilliseconds":1747258500000,"displayStartTime":"4:35 PM","displayEndTime":"5: 35 PM","location":"Room 208","sessionLevel":"Intermediate","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[{"key":"2tDGhu2LNq4Ejh46H","name":"Amy Hodler","linkedin":"","jobTitle":"Executive Director","company":"GraphGeeks.org","avatar":{"backgroundColor":"azure","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/2tDGhu2LNq4Ejh46H/avatar/1745409318469.png"}},{"key":"hKmEsvSuEhSQ89H4o","name":"David Hughes","linkedin":"","jobTitle":"Principal Data & AI Solution Architect","company":"Enterprise Knowledge","avatar":{"backgroundColor":"slategray","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/hKmEsvSuEhSQ89H4o/avatar/1747053400042.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA103","key":"DA103","title":"Basic Theory and Practice of Fine-Tuning LLMs with PPO and GRPO","description":"This session will be a mixture of the practical and the theoretical. Practically, we will use common libraries for fine tuning LLMs - primarily the libraries from the transformers ecosystem, such as datasets, peft, and trl - to improve a pre-trained and instruction-tuned model’s ability to correctly answer questions on a dataset commonly used as a benchmark of chatbots’ reasoning ability. We’ll also cover how the reinforcement learning-based algorithms we use for this fine-tuning - PPO and GRPO - work under the hood, covering how the paradigm of reinforcement learning is applied to fine-tuning LLMs along the way. Finally, the presenter will share some best practices for conducting such experiments in a Google Colab environment.","tags":["LLMs"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747254900000,"utcEndTimeMilliseconds":1747258500000,"displayStartTime":"4:35 PM","displayEndTime":"5: 35  PM","location":"Room 209","sessionLevel":"Intermediate","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[{"key":"AqD7qE3tHiEDpprB2","name":"Seth Weidman","linkedin":"","jobTitle":"Principal Product Manager","company":"SentiLink","avatar":{"backgroundColor":"lightpink","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/AqD7qE3tHiEDpprB2/avatar/1745411141888.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA104","key":"DA104","title":"Filling Data Gaps with the Synthetic Data SDK","description":"In this hands-on tutorial, we'll explore how to address missing data challenges using synthetic data generation with MOSTLY AI's open-source Synthetic Data SDK. We'll start with an introduction to the SDK, covering both LOCAL and CLIENT modes for training and generating synthetic data.\n\nThen, we'll continue on to advanced techniques such as data rebalancing, smart imputation of missing values, and conditional generation to upsample sparse data areas of interest. These methods help improve dataset completeness, correct imbalances, and boost the performance of downstream models.\n\nThrough practical examples and live demonstrations, you'll gain the skills to generate high-quality synthetic data, train GenAI models on enhanced datasets, and integrate synthetic data into your existing workflows.\n\nThis session is designed for data scientists, ML engineers, and analytics practitioners across a range of industries - from finance and healthcare to e-commerce and mobility. By the end, you’ll be equipped with actionable techniques to fill data gaps, improve data utility, and make better use of the data you already have.","tags":["AI for Biotech and Pharma","Generative AI","Machine Learning","Deep Learning","Data Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747254900000,"utcEndTimeMilliseconds":1747258500000,"displayStartTime":"4:35 PM","displayEndTime":"5: 35  PM","location":"Room 206","sessionLevel":"Intermediate","sessionType":"Workshop","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"ehLXT6wYiEvQgcSat","name":"Michael Platzer","linkedin":"","jobTitle":"Co-Founder & CTO | DL","company":"Mostly AI ","avatar":{"backgroundColor":"lightgoldenrodyellow","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/ehLXT6wYiEvQgcSat/avatar/1746608676695.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA105","key":"DA105","title":"Harmonizing Multi-Agent Intelligence","description":"The ability to coordinate multiple AI agents effectively has become a cornerstone for building robust, scalable, and dynamic systems. This presentation will provide a comprehensive overview of multi-agent orchestration techniques, emphasizing the integration of diverse AI systems into a unified framework that amplifies overall performance while mitigating the complexities inherent in such setups.\n\nAttendees will gain insights into the architectural principles that underpin successful multi-agent orchestration, including communication protocols, task delegation strategies, and the role of centralized versus decentralized control mechanisms. Through practical examples and case studies drawn from both industry and research, the talk will illustrate how these methods can be applied to solve real-world challenges such as automating complex decision-making processes, optimizing workflows in dynamic environments, and improving data analysis accuracy across varied domains.","tags":["Generative AI","LLMs","AI Agents","Data Visualization & Analysis"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747255200000,"utcEndTimeMilliseconds":1747257000000,"displayStartTime":"4:40 PM","displayEndTime":"5: 10 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA106","key":"DA106","title":"Building with Vana: An Open Network for User Owned Data","description":"Join Anna Kazlaus, Creator of Vana and CEO of Open Data Labs for an introduction to Vana protocol - developed at MIT as a groundbreaking solution to the data scarcity challenge in AI. This talk is designed for researchers, developers, data scientists, AI engineers and businesses and will guide participants through:\n\n1. Vana’s open source approach to data sovereignty and data portability and why this matters\n\n2. Recent product launches on Vana to accelerate more innovative and efficient global data markets.\n\n3. How to contribute, monetize and access high quality user-owned data on the Vana network.","tags":["AI Expo Talk"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747255200000,"utcEndTimeMilliseconds":1747257000000,"displayStartTime":"4:40 PM","displayEndTime":"5:10 PM","location":"Demo A","sessionLevel":"All Levels","sessionType":"AI Expo Talk","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"jET2CyuDMrv6jEDoY","name":"Anna Kazlauskas ","linkedin":"","jobTitle":"Creator of Vana, CEO of Open Data Labs","company":"Vana","avatar":{"backgroundColor":"cornsilk","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/jET2CyuDMrv6jEDoY/avatar/1747081981336.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA107","key":"DA107","title":"Building the Backbone: Scalable LLMOps & MLOps to Enable AI Integration Across Teams","description":"As AI becomes an essential part of competitive business strategies, companies need efficient ways to integrate it into their products and workflwos. At The Fitch Group, the Emerging Technology team has developed a scalable approach to LLMOps and MLOps, creating a \"\"backbone\"\" of reusable AI components that multiple teams can readily integrate with support from our AI Implementation team. This approach significantly reduces the time and resources needed to deploy and manage AI at scale, making the technology accessible across the organization without major increases in headcount.\n\nThis session will provide senior leaders a business-focused overview of how scalable AI operations can be implemented within enterprise financial services. We’ll discuss our structured approach to manage intake of AI integration requests, prioritize them efficiently, and ensure effective governance for rapid deployment. By focusing on clear yet adaptable processes, our team enables quick implementation of reusable components across departments, making AI integration achievable without the need for deep technical expertise in every team.\n\nKey takeaways from this talk will include insights on structuring teams for efficient AI deployment, strategies to achieve rapid AI scalability, and a discussion of which reusable Ops components empower non-specialist teams to incorporate AI into their work. The presentation will appeal to senior leaders who have a fundamental understanding of MLOps & LLMOps technical aspects and want to understand the business impact of different operational strategies for enterprise-level AI integration.","tags":["LLMOps & MLOps","AI Engineering","Data Engineering"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"16:40:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747255200000,"utcEndTimeMilliseconds":1747257000000,"displayStartTime":"4:40 PM","displayEndTime":"5: 10 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"gH4TsLrswcwbB4zuv","name":"Pablo Vega-Behar","linkedin":"","jobTitle":"Director of Machine Learning Engineering","company":"Fitch Group","avatar":{"backgroundColor":"cornsilk","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/gH4TsLrswcwbB4zuv/avatar/1745410894362.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA108","key":"DA108","title":"Main Networking Reception","description":"Connect with your fellow attendees over small bites and drinks during the Main Networking Reception. Share insights and learn about the experience and expertise of data and AI professionals from a wide range of industries.","tags":["Networking +"],"date":"2025-05-14","milliseconds":1747180800000,"startTime":"17:00:00","timeZone":"America/New_York","duration":90,"utcStartTimeMilliseconds":1747256400000,"utcEndTimeMilliseconds":1747261800000,"displayStartTime":"5:00 PM","displayEndTime":"7:00 PM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":true,"isFavorite":false},{"uniqueId":"DA110","key":"DA110","title":"ODSC Keynote : Rethinking Healthcare with AI: Solving Old Mysteries with Modern Tools","description":"High uncertainty is inherent to disease treatment and diagnosis.  Despite significant advances in basic biology and clinical science, we still cannot predict which individuals are likely to get sick, whether their disease will be treatable and what side effects they will experience during and post their treatment.  AI models have potential to transform this centuries-old status quo due to their uncanny capacity to predict future outcomes. In this talk, I will explain how these models make their predictions and illustrate it with specific examples in the area of risk assessment and cancer diagnosis.   In the second part of my talk, I will focus on AI based methods for drug discovery, including generative models for drug design and mechanism of action elucidation.","tags":["AI for Biotech and Pharma"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"09:15:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747314900000,"utcEndTimeMilliseconds":1747316700000,"displayStartTime":"09:15 AM","displayEndTime":"9:45 AM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Keynote","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"HsetfhRNKeemFJoip","name":"Regina Barzilay, PhD","linkedin":"","jobTitle":"Distinguished Professor, AI and Health","company":"MIT","avatar":{"backgroundColor":"salmon","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/HsetfhRNKeemFJoip/avatar/1745410990963.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA111","key":"DA111","title":"ODSC Keynote :  AI Agents: Taking Stock and Looking Ahead","description":"I will present my team's research on rigorously evaluating AI agents. Our findings help explain the gap between the hopes around AI agents and their underwhelming real-world impact so far. I will identify key engineering challenges that need to be solved to deploy agents more successfully. Looking ahead, I will present a framework for thinking about the medium-long term impact of agents on businesses and discuss the steps that can be taken to steer this impact in a beneficial direction.","tags":["AI Agents"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"10:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747317600000,"utcEndTimeMilliseconds":1747319400000,"displayStartTime":"9:50 AM","displayEndTime":"10:20 AM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Keynote","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"hDr2wz7ZSDgKPoJhb","name":"Arvind Narayanan, PhD","linkedin":"","jobTitle":"Professor","company":"Princeton University","avatar":{"backgroundColor":"darkolivegreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/hDr2wz7ZSDgKPoJhb/avatar/1745409481013.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA113","key":"DA113","title":"Causal AI: from Data to Action","description":"In this session, we will explore and demystify th world of Causal AI for data science practitioners, with a focus on understand cause-and-effect relationships within data to drive optimal decisions. In this talk, we will focus on:\n\n* from shapley to DAGs: the dangers of using post-hoc explainability methods as tools for decision making, and how tranditional ML isn't suited in situations where want to perform interventions on the system.\n* discovering causality: how do we figure out what is causal and what isn't, with a brief introduction to methods of structure learning and causal discovery\n* optimal decision making: by understanding causality, we now can accurately estimate the impact we can make on our system - how to use this knowledge to derive the best possible actions to make?\n\nThis talk is aimed at both data scientists and industry practitioners who have a working knowledge of traditional statistics and basic ML. This talk will also be practical: we will provide you with guidance to immediately start implementing some of these concepts in your daily work.","tags":["Machine Learning"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:10:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747321800000,"utcEndTimeMilliseconds":1747325400000,"displayStartTime":"11:10 AM","displayEndTime":"12:10 PM","location":"Room 206","sessionLevel":"Beginner-Intermediate","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[{"key":"NtDd48kRfe37jmGcy","name":"Dr. Andre Franca","linkedin":"","jobTitle":"CTO","company":"Ergodic","avatar":{"backgroundColor":"coral","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/NtDd48kRfe37jmGcy/avatar/1747053366108.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA114","key":"DA114","title":"Harvesting Trust: How to Make Trustworthy Specialist Conversational AI Agents","description":"In an era where AI is transforming every aspect of every industry, the creation of trustworthy systems is not just beneficial—it's essential. This session will dissect the necessity of Quality Assistance (QA) and testing in developing trustworthy AI systems, drawing parallels with established practices in other fields, and focusing on a practical application through an agricultural chatbot for farmers. Here's what we'll cover:\n- AI's Evaluation Challenge: Explore the unique challenges in evaluating AI, particularly LLMs, due to their inherent complexity and unpredictability\n- Case Study Farmer’s Friend: Dive into an agricultural use case with a chatbot designed for farmers, detailing the requirements for delivering relevant, timely, and actionable information, supported by real-world examples.\n- Metrics that Matter: Conclude with a robust evaluation framework, discussing metrics that assess every facet of the AI workflow—ensuring consistency and robustness, thereby underscoring the mantra, \"\"You cannot improve what you do not measure!\"\"\nThis talk aims to bridge the gap between theoretical AI development and practical, reliable applications, with a sharp focus on enhancing user trust through effective QA.","tags":["Generative AI"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:10:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747321800000,"utcEndTimeMilliseconds":1747323600000,"displayStartTime":"11:10 AM","displayEndTime":"11:40 AM","location":"Room 204","sessionLevel":"","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"3zfKRboDvkhCJreM8","name":"Serg Masis","linkedin":"","jobTitle":"Principal AI Scientist","company":"Syngenta","avatar":{"backgroundColor":"grey","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/3zfKRboDvkhCJreM8/avatar/1745411130577.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA115","key":"DA115","title":"TestCadia: Train for Tests Like an Athlete—with AI, Game Mechanics, and Practice","description":"TestCadia is an AI-powered test prep platform that blends the intensity of sports training with the engagement of gaming to revolutionize how students prepare for standardized exams. Just like in sports, you can't master a test by simply watching or reading. You need to train by doing. TestCadia uses personalized AI coaches to build dynamic expertise profiles and generate real-time practice tests tailored to each student’s needs. By tracking progress, identifying weaknesses, and gamifying improvement, TestCadia turns test prep from what students need to do into an active, motivating experience students actually want to do.","tags":["AI Startup Showcase"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:10:00","timeZone":"America/New_York","duration":15,"utcStartTimeMilliseconds":1747321800000,"utcEndTimeMilliseconds":1747322700000,"displayStartTime":"11:10 AM","displayEndTime":"11:25 AM","location":"Room 211","sessionLevel":"All Levels","sessionType":"AI Startup Showcase","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"cEaQm9NJFWDwuHFTL","name":"Venkat Kolluri, PhD","linkedin":"","jobTitle":"CEO","company":"Cidewalk.com","avatar":{"backgroundColor":"darkblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/cEaQm9NJFWDwuHFTL/avatar/1745411391064.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA122","key":"DA122","title":"Making Big Data Feel Small: A Systems Perspective on Modern OLAP at Scale","description":"When we started thinking about modern OLAP architectures, many folks in the industry said “You’re not a real database unless you’re distributed!”  Of course, most “real databases” are then by definition overly complex in a world where you can get machines with hundreds of cores and 25TB of RAM.\n\nWhy do data engineers feel they need distributed databases?  They want scale, and they think scale requires a distributed database.  This isn’t true for 95% of all use cases, but “scale anxiety” exists for evaluators of databases in much the same way as “range anxiety” exists for buyers of electric cars.\n\nTo be a truly modern OLAP provider, we think it’s extremely important that the 95% of use cases are simple, and the other 5% of use cases are possible.  So, we want an in-process analytics database for the 95% cases for simplicity.  How do we then make the other 5% of workloads possible?\n\nThis talk will explore a variety of architectures to enable high-scale analytics with an in-process analytics database like DuckDB, while making every day work more delightful. We’ll cover capabilities, ergonomics and scalability of these architectures and how they’re being used in the real world.\n\nThanks!","tags":["Data Engineering"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:10:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747321800000,"utcEndTimeMilliseconds":1747323600000,"displayStartTime":"11:10 AM","displayEndTime":"11:40 AM","location":"Room 208","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"H4CrP3TnaRuv96PL3","name":"Ryan Boyd","linkedin":"","jobTitle":"Co-founder","company":"MotherDuck","avatar":{"backgroundColor":"darkturquoise","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/H4CrP3TnaRuv96PL3/avatar/1745411049887.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA123","key":"DA123","title":"From LLM Calls to Planning and Orchestration AI Systems - Build Reliable Agentic AI Applications","description":"Current approaches to agentic systems can be broadly categorized into two groups: Static Chaining, or Prompt & Pray. Both approaches have their own flaws. Static chaining based systems are rigid and can only be applied to narrow solutions. It is also labor-intensive in development and ongoing maintenance. Prompt & Pray is an alternative which gives more decision power to LLM, but it often leads to unreliable results, especially related to tool calling. The lack of accuracy, consistency, robustness plus low maturities of available tools, especially complex context retrieval, are some of the other issues of today’s agentic systems.\nAI21 develops Maestro which presents a new paradigm for developing reliable agentic AI systems. It is built with dynamic task planning and multi-path execution capabilities. Users are able to define desired guardrails and constraints for the agent’s behavior. There are many other innovative features such as budget limiting as well as flexible choice of models, tools and output schema. All the execution steps are traceable and a structured validation report will be generated at the end of each run. The constraints can be described in natural language and will be automatically translated into verifiable codes.\nWith customer examples, offline simulation can be run to improve the execution strategy and to optimize cost and performance of the planner at run-time. \nMaestro is model agnostic and can be used together with other agentic frameworks.","tags":["AI Agents"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:10:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747321800000,"utcEndTimeMilliseconds":1747323600000,"displayStartTime":"11:10 AM","displayEndTime":"11:40 AM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"NmaaWoARb6PF72GHy","name":"Chen Wang, PhD","linkedin":"","jobTitle":"Lead Alliance Solution Architect","company":"AI21 Labs","avatar":{"backgroundColor":"blueviolet","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/NmaaWoARb6PF72GHy/avatar/1745409666478.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA116","key":"DA116","title":"Introducing NanoBalm- Data Rx: The Wellness Institute and Labs","description":"NanoBalm, developed by DataRx, is a post-exposure prophylactic cream that potentially prevents the aggregation of cancer cells. More specifically, the data suggests that it destabilizes and stops cancer cells before it starts. Nanobalm is a member of a suite of potential therapeutic cosmetics and cleanser from DataRx, the Wellness Institute and Labs. For this endeavor, our team has come together to promote health and wellness through the application of data-driven tools. Our hope is to amplify our suite of resources to connect people and organizations to the most current and useful therapeutic approaches.","tags":["AI Startup Showcase"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:30:00","timeZone":"America/New_York","duration":15,"utcStartTimeMilliseconds":1747323000000,"utcEndTimeMilliseconds":1747323900000,"displayStartTime":"11:30 AM","displayEndTime":"11:45 AM","location":"Room 211","sessionLevel":"All Levels","sessionType":"AI Startup Showcase","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"k5ayZhu9j7i8JYfE3","name":"Kela Roberts","linkedin":"","jobTitle":"Founder and MIT Researcher\tData Rx","company":" The Wellness Institute and Labs","avatar":{"backgroundColor":"darkslategrey","source":""}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA117","key":"DA117","title":"Powering Generative AI with Openly Licensed Data","description":"Many AI companies rely on data crawled from the web to train foundation models, frequently without the explicit permission of copyright holders. While some jurisdictions like the EU and Japan permit this under specific conditions, the legal landscape in the United States remains murky. As a result, copyright owners are filing lawsuits, which pushes the field towards secretive dataset practices—stifling transparency and accountability and limiting innovation. Last summer, EleutherAI and Mozilla held the “Dataset Convening\"\", in which thirty leading scholars and practitioners from prominent open source AI startups, nonprofit AI labs, and civil society organizations met to discuss best practices for developing ethical and openly licensed training datasets. The meeting helped identify key gaps where better tooling can improve people’s ability to do data work at scale. \n\n\nIn this talk, Stella will give a frank discussion of the technical, social, and political challenges in open data development. She will present key learnings from the Dataset Convening, as well as her personal experience leading the development of the world’s first fully openly licensed dataset. She will walk attendees through case studies illustrating the challenges that can arise in identifying data provenance, how they can be ameliorated, and what key decision-making factors are in determining if data is licensed for use in AI systems. Finally, she will discuss key open source tooling developed by EleutherAI and others, which empower people to build their own datasets, and identify areas where new tools are needed.","tags":["LLMs","Data Engineering"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:45:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747323900000,"utcEndTimeMilliseconds":1747325700000,"displayStartTime":"11:45 AM","displayEndTime":"12:15 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"J5vnjidBC3cttTNNS","name":"Stella Biderman","linkedin":"","jobTitle":"Executive Director, AI and NLP Researcher |  Lead Scientist - Mathematician","company":"Eleuther AI | Booz Allen Hamilton","avatar":{"backgroundColor":"aliceblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/J5vnjidBC3cttTNNS/avatar/1745411243221.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA118","key":"DA118","title":"Building AI Governance into Your Agents","description":"As AI agents become more capable and complex, ensuring secure, observable, and scalable deployment is no longer optional—it’s foundational. In this session, we’ll explore how open-source tools like Unity Catalog AI (OSS) and MLflow can powerfully support AI agent development with built-in governance and observability.\n\nWe’ll cover:\n\nBuilding agentic systems using LLMs, tool/function calling, with OSS orchestration libraries \n\nApplying access controls, function registration, and sandbox execution using Unity Catalog AI OSS\n\nAdding observability to agents with MLflow Tracing: capturing prompt logic, tool usage, and execution metadata\n\nAddressing production-readiness with strategies for fallback logic, trace debugging, and reproducible agent behavior\n\nBy the end of this talk, attendees will understand how to build governed, transparent, and production-ready AI agents—entirely with open-source tools.","tags":["LLMs"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:45:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747323900000,"utcEndTimeMilliseconds":1747325700000,"displayStartTime":"11:45 AM","displayEndTime":"12:15 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"t8HaqqiZ8FNtFQpx4","name":"Amber Roberts","linkedin":"","jobTitle":"Staff Technical Marketing Manager","company":"Databricks","avatar":{"backgroundColor":"seagreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/t8HaqqiZ8FNtFQpx4/avatar/1745409299107.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA119","key":"DA119","title":"Real Time Delivery of Impressions at Scale","description":"At Netflix, we generate approximately 18 billion impressions daily. These impressions, essential for powering video ranker algorithms and computing adaptive pages, significantly influence a viewer's browsing experience. With the evolution of user interfaces to be more responsive to in-session interactions, coupled with the growing demand for real-time adaptive recommendations, it has become highly imperative that these impressions are provided on a near real time basis. This talk will delve into the creative solutions Netflix deploys to manage this high-volume, real-time data requirement while balancing scalability and cost.\n\nAt Netflix, the impressions are represented numerically using exponential moving average counts. Historically, the exponential moving average counts (EMA) have been used to represent continuous streams that favor recent events, and it serves as a perfect representation of impressions for our use case. These EMAs are calculated using different window sizes, varying from 2 hours to 365 days, to cater to diverse needs.\n\nComputing longer window size emas is computationally really heavy for an online service, so a batch job is used to compute these emas offline, followed by a transport job that transfers these EMAs to a Key Value data store. Further, these emas counts are also updated to reflect any impressions that might have occurred between the last time batch job was run and request time by talking to a Time Series data store, and computing these offsets. Shorter window size emas are computed on the fly at request time. Finally, these emas are exposed via an online service with a guaranteed response time of less than one second and near real time updates.\n\nHaving a hybrid architecture of batch jobs and a service backed by Key Value datastore helps us solve most of the requirements needed by this service, but it also introduces complexity of managing two systems, and complicating the formula used for computation. Also, providing a longer range window ema count means that we need a supplementary batch job that makes it lose flexibility. Due to the immense size of impressions, it is a challenge to operate the transport job that populates Key Value data store.  Despite these complexities and the operational challenges of managing the immense volume of impressions, this hybrid approach has enabled Netflix to deliver impressions near real-time at scale. This talk will provide an insightful exploration into how Netflix successfully navigates these challenges.","tags":["Data Engineering"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:45:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747323900000,"utcEndTimeMilliseconds":1747325700000,"displayStartTime":"11:45 AM","displayEndTime":"12:15 PM","location":"Room 208","sessionLevel":"Beginner-Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"m7LNNosxiDpp5ejcH","name":"Tulika Bhatt","linkedin":"","jobTitle":"Senior Software Engineer","company":"Netflix","avatar":{"backgroundColor":"lawngreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/m7LNNosxiDpp5ejcH/avatar/1745411380263.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA120","key":"DA120","title":"Unlocking AI's Full Potential with Unframe's Managed AI Delivery Platform","description":"Unframe’s Enterprise AI Platform enables businesses to bring any unique AI use case to life in days, and offers building them for you at no additional cost. Through its Blueprint Approach, Unframe collaborates with large enterprises globally to implement solutions across observability, data abstraction, intelligent agents, and modernization. Unframe securely integrates with any SaaS, API, database or file and ensures that customers never need to share their data outside their secure environment. Unframe is LLM agnostic and doesn't require fine-tuning or training.","tags":["AI Startup Showcase"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"11:50:00","timeZone":"America/New_York","duration":15,"utcStartTimeMilliseconds":1747324200000,"utcEndTimeMilliseconds":1747325100000,"displayStartTime":"11:50 AM","displayEndTime":"12:05 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"AI Startup Showcase","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"b2z5KqXk5N7fFTnFd","name":"Alex Ansted","linkedin":"","jobTitle":"Director Enterprise Sales","company":"unframe.ai","avatar":{"backgroundColor":"indigo","source":""}},{"key":"xtGmpaBHuNRaMpLkB","name":"Adi Azarya","linkedin":"","jobTitle":"VP R&D","company":"Unframe","avatar":{"backgroundColor":"whitesmoke","source":""}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA124","key":"DA124","title":"No more ETL Bulls@?#!","description":"Companies are investing billions in AI but facing a fundamental roadblock: rigid, one-way data pipelines consuming excessive engineering resources. Michael Kowalchik, CEO of Matterbeam, reveals how treating data as immutable streams creates unprecedented flexibility and efficiency. Learn how Matterbeam's approach eliminates brittle point-to-point connections, enabling teams to spin up new use cases in minutes rather than months. Since last year's ODSC, Matterbeam has seen customer deployments grow fivefold, with mid-market companies rapidly freeing their data from pipeline constraints. Join this showcase session to discover how immutable streams are transforming data architecture and unlocking AI's true potential.","tags":["AI Startup Showcase"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"12:10:00","timeZone":"America/New_York","duration":15,"utcStartTimeMilliseconds":1747325400000,"utcEndTimeMilliseconds":1747326300000,"displayStartTime":"12:10 PM","displayEndTime":"12:25 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"AI Startup Showcase","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"2oLZWvrcJywCwXTsK","name":"Michael Kowalchik","linkedin":"","jobTitle":"Founder & CEO","company":"Matterbeam","avatar":{"backgroundColor":"red","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/2oLZWvrcJywCwXTsK/avatar/1747066179590.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA121","key":"DA121","title":"Reinforcement Learning in Practice: From Bandits to LLMs","description":"In this workshop, we will see how it’s possible to use Reinforcement Learning to solve real-world problems. Reinforcement Learning recently had incredible progress in the industry and established itself as one of the best techniques for sequential decision-making and control policies. In particular, we will see how Reinforcement Learning with Human feedback and other techniques improved the performance of LLMs.\n\nWe are now just scratching the surface of its applications.\n\nIn this session, we will start by exploring its fundamentals, like Q-learning, and we will end with Deep Reinforcement Learning algorithms, like Actor-Critic models and how to use these techniques to improve LLMs.","tags":["LLMs"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"12:15:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747325700000,"utcEndTimeMilliseconds":1747329300000,"displayStartTime":"12:15 PM","displayEndTime":"1:15 PM","location":"Room 206","sessionLevel":"Intermediate - Advanced","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[{"key":"t6bsFC6TLeQYGmXJT","name":"Leonardo De Marchi","linkedin":"","jobTitle":"VP of Labs","company":"Thomson Reuters","avatar":{"backgroundColor":"darkslateblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/t6bsFC6TLeQYGmXJT/avatar/1746530295153.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA112","key":"DA112","title":"AI Software Engineering Agents: What Works and What Doesn’t","description":"The adoption of AI into software development has been bumpy. While autocomplete tools like Copilot have gone mainstream, autonomous agents like Devin and OpenHands have generated both enthusiasm and skepticism. Some engineers claim they generate a 10x productivity boost; others that they just create noise and tech debt.\n\nThe difference between the enthusiasts and the skeptics is that the enthusiasts have reasonable expectations for what these agents can do, and have both practical and intuitive knowledge for how to use them effectively.\n\nIn this session, we'll talk about what tasks are appropriate for today's software agents, what tasks they might start to succeed at in 2025, and what tasks are best left to humans no matter how good they get.","tags":["AI Agents"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"12:20:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747326000000,"utcEndTimeMilliseconds":1747327800000,"displayStartTime":"12:20 PM","displayEndTime":"12:50 PM","location":"Room 205","sessionLevel":"Intermediate-Advanced","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"DWu4aeeZRXFoZpzow","name":"Robert Brennan","linkedin":"","jobTitle":"CEO","company":"All Hands AI","avatar":{"backgroundColor":"plum","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/DWu4aeeZRXFoZpzow/avatar/1745411038049.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA125","key":"DA125","title":"Guardrails in Generative AI Workflows via Orchestration","description":"With the increase in generative AI language model use and server implementations, there is a growing concern of how models can divulge information or how they can generate inappropriate content. This concern is leading to the development of technologies to “guardrail” user interactions with models, from screening user prompts for inappropriate asks, to checking model outputs to restrict unwanted responses. Examples include but are not limited to models presenting biases and model reveal of personal or proprietary business information. \n\nThis talk highlights an open-sourced guardrails orchestrator component which is designed to orchestrate calls and responses to generative model servers and detector servers, helping users easily apply guardrails to their generative AI workflows. We also share our defined taxonomy of detectors that provides a more intuitive organization of capabilities. This component can be easily supported on various AI platforms and is designed to work with popular model runtimes. Users can bring their own implementations of any generation model and detector servers. The orchestrator component can also help guardrail streaming content, enabling a more interactive user experience where users can receive detections along with streaming model-generated content.\n\nWe will discuss how we considered several important factors like performance, scalability, extensibility, and maintainability in the architectural design to make the solution production-ready. We will also share examples of use cases enabled, from those with simple lightweight detectors to more sophisticated LLM detectors, and how we adapted for multiple modalities. \n\nJoin us in exploring how you can incorporate diverse guardrails in your generative model workflow.","tags":["Generative AI"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"12:20:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747326000000,"utcEndTimeMilliseconds":1747327800000,"displayStartTime":"12:20 PM","displayEndTime":"12:50 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"3CchpN7JBZXkeeARt","name":"Evaline Ju","linkedin":"","jobTitle":"Senior Software Engineer","company":"IBM","avatar":{"backgroundColor":"skyblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/3CchpN7JBZXkeeARt/avatar/1745409938421.png"}},{"key":"SmqvNb8XaePkLRY5N","name":"Gaurav Kumbhat","linkedin":"","jobTitle":"Software Architect","company":"IBM","avatar":{"backgroundColor":"mediumslateblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/SmqvNb8XaePkLRY5N/avatar/1745410029436.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA126","key":"DA126","title":"Class in Session: AI Tutors Redefining Higher Education","description":"The increasing demand for personalized and scalable teaching in higher education institutions poses a significant challenge, as educators require additional resources and tools to support students, making it hard to duplicate the golden standard of learning provided by one-on-one tutoring, as Bloom demonstrated in the 2-Sigma problem.\r\n\r\nHowever, thanks to recent advances in generative artificial intelligence (AI) we can now complement traditional teaching and improve learning outcomes, potentially delivering high-quality one-on-one tutoring.\r\nBuilding on these technological developments, this talk will review the implementation of AI-driven tutoring solutions at Harvard Business School (HBS), focusing specifically on their integration into the MBA core curriculum. Throughout the academic year, students integrate these tools into their coursework, engaging directly with case studies as they set and monitor their learning goals. At the same time, these systems offer educators fresh perspectives that enable them to refine their instructional materials, ultimately elevating the overall quality of the course.\r\n\r\nNext, we will discuss how the HBS AI tutor integrates a wide array of business documents, syllabi information, and other frequently asked questions and answers specific to graduate courses, along with data from quizzes and bubble questions, with the content of pre-trained LLMs. This integration expands the tutor system's knowledge base through an optimized retrieval-augmented generative (RAG) system and multiple agentic steps, ensuring that responses remain closely aligned with course content rather than relying solely on the parametric memory of the underlying model.\r\n\r\nFinally, we will explore recent evaluation frameworks and metrics used to estimate the quality of student conversations with AI tutors. Attendees will discover how AI can be applied in real-world classroom settings, examine the evolving role of advanced tutoring systems in higher education, and learn about key innovations that make these systems particularly suitable for higher-level academic demands.","tags":["Generative AI","LLMs","RAG","AI Agents"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"12:20:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747326000000,"utcEndTimeMilliseconds":1747327800000,"displayStartTime":"12:20 PM","displayEndTime":"12:50 PM","location":"Room 208","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA127","key":"DA127","title":"Mozilla AI Blueprints: Accelerating Open-Source AI Development","description":"Mozilla AI Blueprints provide open source building blocks that accelerate the development and deployment of practical AI solutions. Discover how these community driven templates empower data scientists and developers to collaboratively innovate and build real world AI applications.","tags":["AI Startup Showcase"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"12:45:00","timeZone":"America/New_York","duration":15,"utcStartTimeMilliseconds":1747327500000,"utcEndTimeMilliseconds":1747328400000,"displayStartTime":"12:30 PM","displayEndTime":"12:45 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"AI Startup Showcase","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"zvF7spBQcTWK7mNvm","name":"Alex Meckes","linkedin":"","jobTitle":"Program Manager, AI 360","company":"MozillaAi","avatar":{"backgroundColor":"linen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/zvF7spBQcTWK7mNvm/avatar/1747085285391.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA128","key":"DA128","title":"Entity-Resolved Knowledge Graphs: Taking your Retrieval-Augmented Generation to the Next Level","description":"Building applications powered by large language models (LLMs) is a relatively straightforward task.  Despite this, creating performant applications that meet high standards of accuracy and reliability can be tricky.  One of the primary challenges faced by LLM applications is mitigating hallucinations.  To address this issue, retrieval-augmented generation (RAG) has become a widely adopted approach, enhancing LLM performance by augmenting its knowledge with additional sources of information such as documents and other auxiliary data sets, which can be represented in one of several different formats.  One of the most common formats is as a vector database.  However, recent work has shown that the accuracy of the RAG can be significantly improved through representing the data in a graph format such as a knowledge graph (KG).\n\nDespite their potential, many KG implementations fail to deliver optimal performance due to difficulties in resolving multiple entities from the source information into a single entity – a technique called entity resolution (ER).  LLMs relying on RAG assume that the data they are accessing is in some way unique and so having different nodes for things like \"My Company Inc.\" versus \"My Company, Inc.\" can decrease accuracy.  This appears to be a straight-forward case that could be resolved with basic string matching and regex, but as the data gets more complicated, this is no longer possible.  For example, consider more complex variations such as \"Liz Smith,\" \"Elizabeth Conner-Smith,\" and \"Dr. L. Conner-Smith,” which would be very difficult to resolve with simple regex.  \n\nIt is possible to use more sophisticated ER techniques that incorporate multiple disparate data sources to obtain more accurate entities.  The end result is the creation of an entity-resolved knowledge graph (ERKG) whereby multiple duplicate entities such as those shown above are collapsed into a single entity while maintaining all information on that entity.  In this way ERKGs enhance both basic graph queries and LLM-driven applications by consolidating and clarifying relationships within the data. This talk will showcase the transformative impact of ER on KGs, using real-world data to highlight improvements in both graph data science tasks and LLM accuracy.  Attendees will gain practical insights into implementing ERKGs, demonstrating the significant advantages of applying ER to KGs in RAG systems.","tags":["LLMs"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747332000000,"utcEndTimeMilliseconds":1747333800000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Room 205","sessionLevel":"Beginner-Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"XyLZg9WcPJ2rpXr3R","name":"Dr. Clair Sullivan","linkedin":"https://www.linkedin.com/in/dr-clair-sullivan","jobTitle":"Founder and CEO","company":"Clair Sullivan & Associates, LLC","avatar":{"backgroundColor":"sienna","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/XyLZg9WcPJ2rpXr3R/avatar/1745409861375.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA129","key":"DA129","title":"Structuring the Unstructured: Advanced Document Parsing for AI Workflows","description":"Modern organizations generate vast amounts of data stored in diverse and often unstructured formats, such as PDFs, scanned documents, and proprietary file types. For engineers working with AI, the challenge isn’t simply extracting text—it’s preserving the structure, context, and relationships within the data. Whether fine-tuning models or building retrieval-augmented generation (RAG) pipelines, effective document processing is essential to powering actionable insights.\n\nThis session dives into the techniques and open source tools needed to transform unstructured documents into structured formats like JSON or Markdown, ready for AI workflows. You’ll learn how to handle challenges like multi-page tables, image-heavy layouts, and scanned documents using context-aware methods. Join this session as we explore how to efficiently bridge the gap between unstructured data and AI-powered applications, and help you achieve better results in your AI projects.","tags":["Data Engineering"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:00:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747332000000,"utcEndTimeMilliseconds":1747333800000,"displayStartTime":"2:00 PM","displayEndTime":"2:30 PM","location":"Room 208","sessionLevel":"Beginner-Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"zSNdnmrTjarLeaQHd","name":"Cedric Clyburn","linkedin":"","jobTitle":"Senior Developer Advocate","company":"Red Hat","avatar":{"backgroundColor":"darkviolet","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/zSNdnmrTjarLeaQHd/avatar/1745409650330.png"}},{"key":"WneGMRS9azbQvXQKJ","name":"William Caban","linkedin":"www.linkedin.com/in/williamcaban","jobTitle":"Technical Product Manager - Generative AI","company":"Red Hat","avatar":{"backgroundColor":"burlywood","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/WneGMRS9azbQvXQKJ/avatar/1745411577289.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA130","key":"DA130","title":"Optimizing LLM Inference: Speeding Up AI for Real-World Applications","description":"Imagine your favorite AI assistant taking 30 seconds to respond to each message - frustrating, right? That's the challenge we're tackling in LLM inference optimization. Just like a Formula 1 pit crew fine-tunes every aspect of their car for peak performance, we're optimizing every millisecond of language model inference.\n\nIn this deep-dive session, you'll learn how to transform large language models into speed demons through practical, production-tested techniques. We'll explore how KV caching acts as a \"memory bank\" to slash repeated computations, why attention calculations are the hidden bottleneck eating up your GPU memory, and how quantization compresses models from full precision to 4-bit racing machines!\n\nBy the end of this session, you'll understand cutting-edge techniques like speculative decoding - imagine having a \"prediction engine\" that can guess the next few words while your main model is still thinking. Through real-world examples and interactive demonstrations, you'll learn to identify performance bottlenecks, implement optimization strategies, and make informed decisions about trade-offs between model size, speed, and accuracy.\n\nWhether you're running models on a beefy server or squeezing performance out of edge devices, you'll walk away with actionable knowledge to understand what really happens behind every API call to a LLM. Join me for a fast-paced journey through the world of LLM inference optimization.","tags":["LLMs"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747332000000,"utcEndTimeMilliseconds":1747335600000,"displayStartTime":"2:00 PM","displayEndTime":"3:00 PM","location":"Room 206","sessionLevel":"Intermediate","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[{"key":"NkraHdLMa7jG9svob","name":"Zain Hasan, PhD","linkedin":"","jobTitle":"Senior AI/ML DevRel Engineer","company":"Together AI","avatar":{"backgroundColor":"limegreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/NkraHdLMa7jG9svob/avatar/1745411555536.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA131","key":"DA131","title":"ODSC LIGHTNING TALKS: \n1. AI in the Trenches: Lessons from a Small Team’s Experimentation with AI\n2. Biomedical Semantic Search with Local LLMs\n3. Transform Notebooks into Scalable Pipelines","description":"1. Venkat Kolluri, PhD - CEO | Cidewalk.com\nAI in the Trenches: Lessons from a Small Team’s Experimentation with AI\nWhat happens when a small team with limited resources decides to integrate AI into its operations? I will share how our small marketing company tested AI tools to automate workflows, streamline content creation, and enhance customer engagement—and what we learned along the way.\nIn particular, I will focus on:\n1) What worked – How AI-powered automation saved time, improved efficiency, and freed up human effort for high-value tasks.\n2) What didn’t – Where AI fell short, the risks of over-automation, and the unexpected challenges we encountered.\n3) What’s next – How we are planning on refining our AI strategy, make smarter choices, and avoid common pitfalls. \nWhile my experience comes from the world of marketing, the lessons learned, I hope will apply to any small company, startup, or organization looking to test the waters with AI. Whether you’re a business leader, entrepreneur, or AI enthusiast, in this talk I will give you a candid, no-fluff look at how AI can (and can’t, in my opnion) help small teams work smarter—and what to consider before diving in. Ofcourse I will also share some of the issues, fresh wounds on my back, I am currently trying my best to figure out as we, like the rest of the world are still scrambling to learn how to swim in this AI ocean.\n\n2. Thomas Charlon, PhD - Research Associate | Harvard Medical School\nBiomedical Semantic Search with Local LLMs\nAre hallucinations fundamental limitation of large language models (LLMs) ? At the CELEHS laboratory, we are curious about the answer, but in the meantime, we often use LLM-based embeddings instead of generative artificial intelligence (AI) to help us in our analyses. In clinical and biomedical settings, one hallucination may be enough to trigger a catastrophic failure, and this is why we are particularly interested by LLM-based embeddings as BGE and BERT, which enable us to compute cosine similarities between a query and elements of our databases, thus making sure our results will not suffer from hallucinations. One example of how we use them is to suggest variables of interest to a specific study, for example if a clinician studies bipolar disease, we would suggest to have a look at the use of lithium, which is an often used medication.\nAs the number of embeddings models increases, we want to have methods to compare the clinical usefulness of these models. In our case, we found that BGE embeddings had very satisfying performance although showed some limitations, e.g. relating schizophrenia to leukemia and bacteria. Another promising model for clinicial use is SAPBERT, which however focuses more on identifying synonyms, while BGE focuses more on \"\"relatedness\"\" (as the relationship between a disease and a medication). The question that thus arises is, how can we efficiently compare BGE and SAPBERT ? We have clinician-curated databases that compile \"\"known pairs\"\", i.e. two concepts that are related. These known pairs can be synonyms, parent-child relationships (e.g. bipolar disorder \"\"is a\"\" mental health disorder), or relatedness (e.g. lithium \"\"may treat\"\" bipolar disorder). These known pairs can function as \"\"true positives\"\" with which we can compute area under the operating curve (AUC) and positive predictive value (PPV) performance scores. However, depending on the clinical study, we might in one case want to prefer finding synonyms, and in another related terms.\nThese reasons are why we have built R / Python pipelines for biomedical LLM semantic search apps, leveraging Python's GPU indexing capabilities, while using R for data management and evaluation purposes. While some R packages exist to leverage GPU capabilities, Pytorch is by far more used for these purposes, which brings with it more stability and optimizations. On the other hand, R is well-known to be very efficient for data management, evaluation and visualization, thanks in part to its large network of collaborating researchers. How should one go about to build reproducible and trustworthy pipelines incorporating the best of both worlds ? My answer is well-designed pipelines with Docker and Makefile.\nIn this talk I will show my design approaches on how to build such pipelines. While R and Python both have capabilities to natively interact with each other, building Docker images that can run both a R/Shiny server and Pytorch CUDA can prove challenging. Thus I chose to isolate the two environments, each one relying on an independent Docker image, and having an Elasticsearch database as the intermediary. The evaluation database (i.e. the known pairs acting as true positives) is first built and written using R, then Python reads the output and indexes it in the Elasticsearch database, and finally R is spun up again to read the indexed embeddings from the Elasticsearch database and evaluate the performance. Docker Compose enables to have each R and Python environments communicate seamlessly with the Elasticsearch image, and Makefile is used to order sequentially the components. With this approach, we can easily update any component when needed, as well as index the database on a GPU-capable machine before exporting the indexed database to a non-GPU online server as Amazon Web Services.\nAs the number of embeddings models increases, we will probably soon need to distinguish the best models for specific tasks, as finding synonyms or related pairs, and these case-by-case cross-examined studies can be efficiently implemented with R's capabilities, while Python can perform the GPU-related computations without needing to reimplement all the optimizations in R. To me, the future of open source AI and applied science will leverage a broad spectrum of capabilities, and a core question will be how to make these different environments communicate seamlessly while making them robust, isolated, and reproducible. In this talk I would like to showcase my own design approaches to such challenges.\n\n\n3. Kevin Gunn, PhD, Lead Data Scientist | Plymouth Rock Assurance\nTransform Notebooks into Scalable Pipelines\nRapid cloud adoption has pushed data scientists beyond traditional roles, requiring them to orchestrate pipelines that work effectively in cloud environments. When Plymouth Rock Assurance launched its first cloud environment in Amazon Web Services (AWS), challenges arose in operationalizing notebook code for model development and deployment. Since most data scientists prefer working in Jupyter notebooks, the initial strategy was to replicate that environment in AWS SageMaker. However, this approach resulted in suboptimal runtime performance, inefficiency, higher costs, and complex management. \nTo address these issues, our team transitioned to using machine learning (ML) pipelines structured as Directed Acyclic Graphs (DAGs). A DAG represents a series of interconnected steps in an ML workflow, where each node corresponds to a specific task—such as data preprocessing, model training, or deployment—and the directed edges define task dependencies. This modular and reproducible approach enhances debugging capabilities while optimizing resource-intensive computations. \nML pipelines, implemented as independently executable workflows, are now supported across platforms like Azure, Google Cloud Vertex AI, and AWS. By chaining multiple steps into a DAG, users can create sophisticated workflows that automate processes, manage package dependencies, and streamline operational efficiency. Features such as automatic shutdown upon task completion significantly reduce costs, while scheduling capabilities allow jobs to run on a set cadence. This enables data scientists to focus on quality assurance, brainstorming, and strategic planning while pipelines are executed in the background. \nOur team leverages the Amazon SageMaker Python SDK to build ML pipelines. SageMaker provides pre-built Docker images optimized for popular frameworks like TensorFlow, PyTorch, and Scikit-learn. These images come pre-configured with essential libraries and dependencies, enabling quick starts for model training and deployment. For more tailored solutions, custom Docker images ensure fast, reproducible pipeline designs aligned with specific business needs. \nThis talk will demonstrate how to programmatically set up pipelines for notebook jobs. It will also highlight the transformation of Jupyter notebooks from a development tool into a key component of scalable, automated workflows in cloud-based ML environments. Attendees will learn about the core functionalities of pipelines as DAGs, notebook jobs, and how these approaches optimize performance, reduce costs, and enhance efficiency in production workflows.","tags":["Generative AI","Data Engineering","AI for Biotech and Pharma","LLMOps & MLOps","AI Engineering","LLMs"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:00:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747332000000,"utcEndTimeMilliseconds":1747335600000,"displayStartTime":"2:00 PM","displayEndTime":"3:00 PM","location":"Room 204","sessionLevel":"All Levels","sessionType":"Lightning Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"cEaQm9NJFWDwuHFTL","name":"Venkat Kolluri, PhD","linkedin":"","jobTitle":"CEO","company":"Cidewalk.com","avatar":{"backgroundColor":"darkblue","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/cEaQm9NJFWDwuHFTL/avatar/1745411391064.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA132","key":"DA132","title":"Moved to Virtual Session - Bridging the Divide: Translating Complexity into Clarity","description":"SynchrotronAI is built on a simple belief: you don’t need to be a genius to create\nsomething extraordinary, you just need an idea. Whether it’s a dream, a spark of\ncuriosity, or a creative vision, our platform empowers both technical and non-technical\nusers to bring their ideas to life. With intuitive AI-driven tools, SynchrotronAI empowers\nanyone to build, explore, and innovate whether that involves booking a flight, creating a\nvideo game, or modeling complex concepts to gain a deeper understanding of the\nuniverse. This session will demonstrate how users can harness the platform’s power to\nturn imagination into reality no coding background required. From automating everyday\ntasks to exploring advanced creative projects, SynchrotronAI is more than a tool, it’s a\n\ngateway for dreamers, builders, and thinkers alike. Discover how accessible and\nlimitless AI can be when innovation is placed in everyone’s hands.","tags":["AI Startup Showcase"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:00:00","timeZone":"America/New_York","duration":15,"utcStartTimeMilliseconds":1747332000000,"utcEndTimeMilliseconds":1747332900000,"displayStartTime":"2:00 PM","displayEndTime":"2:15 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"AI Startup Showcase","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA133","key":"DA133","title":"You Code. AI Agents Test. Rethinking Software Quality in the Age of Generative Code","description":"As generative AI tools boost developer productivity, the volume of code being shipped has skyrocketed but quality hasn’t scaled with it. Manual testing can't keep up, and traditional  automation tools weren't built for this pace. In this session, we’ll explore how collaborative AI agents for testing are emerging as a viable solution to ensure code quality, and fast deliver in the age of fast, AI-generated development.","tags":["AI Startup Showcase"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:00:00","timeZone":"America/New_York","duration":15,"utcStartTimeMilliseconds":1747332000000,"utcEndTimeMilliseconds":1747332900000,"displayStartTime":"2:00 PM","displayEndTime":"2:15 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"AI Startup Showcase","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"F9v3YjJpifL9dfoWL","name":"Sharon Barr","linkedin":"","jobTitle":"Co-founder and CEO ","company":"startearly.ai","avatar":{"backgroundColor":"lightgreen","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/F9v3YjJpifL9dfoWL/avatar/1747053538610.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA134","key":"DA134","title":"How to equip your marketing team with data-driven, self-serve Creative insights—so you can focus on the bigger questions","description":"Digital marketers waste over $100 billion each year on ineffective ad creative—and too often, data scientists are pulled in to diagnose the mess. With targeting precision fading under new privacy constraints, creative content is now the most powerful lever for improving ad performance—but it's also the hardest to quantify and optimize.\n\nThis session introduces a practical solution: how Purposely.ai uses causal inference, creative lift modeling, and generative AI to help marketing teams self-serve performance insights and iterate high-impact ad content—without leaning on data science for every question. You’ll see real-world examples of how we model creative effectiveness, fine-tune generative tools, and close the feedback loop between data and design teams.\n\nFor data scientists, it’s not just about better ads—it’s about fewer ad-hoc requests, more bandwidth for high-leverage work, and a smarter way to scale your influence across the org.","tags":["AI Startup Showcase"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:35:00","timeZone":"America/New_York","duration":15,"utcStartTimeMilliseconds":1747334100000,"utcEndTimeMilliseconds":1747335000000,"displayStartTime":"2:20 PM","displayEndTime":"2:35 PM","location":"Room 211","sessionLevel":"All Levels","sessionType":"AI Startup Showcase","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"9TTYHRnuwMM5ZrTxM","name":"Alex Kennedy","linkedin":"","jobTitle":"Co-Founder and CEO \t","company":"Purposely.ai","avatar":{"backgroundColor":"lightpink","source":""}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA135","key":"DA135","title":"Automating Bayesian Marketing Mix Modeling with an AI-Powered Assistant","description":"Bayesian Marketing Mix Modeling (MMM) is crucial for understanding the impact of different marketing activities on sales and revenue, especially with the decline of third-party cookies. However, Bayesian MMM analysis is complex and requires expertise in various areas, including Bayesian statistics, media attribution, and computational modeling. This complexity often involves manual data processing and model development, making it inaccessible to many practitioners. To address this, we present an AI-powered Assistant that automates Bayesian MMM analysis. This system utilizes multi-agent collaboration, retrieval-augmented generation (RAG), tool calling, and sandboxed code execution. The multi-agent architecture employs specialized AI agents to manage different aspects of the analysis, such as data exploration, data validation, Bayesian model execution, and statistical interpretation. This approach ensures a modular, scalable, and reliable MMM development process. In this presentation, we will discuss the development of this system, including an overview of the architecture and technology stack. We will also share our future plans for this AI assistant – from a copilot that helps practitioners build, fit, and interpret Bayesian MMMs to a digital coworker capable of understanding abstract business goals and acting autonomously and proactively to help achieve them.","tags":["Data Visualization & Analysis"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:35:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747334100000,"utcEndTimeMilliseconds":1747335900000,"displayStartTime":"2:35 PM","displayEndTime":"3:05 PM","location":"Room 205","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"RPLnEinjye4qy7M6Q","name":"Thomas Wiecki, PhD","linkedin":"","jobTitle":"Chief Executive Officer","company":"PyMC Labs","avatar":{"backgroundColor":"floralwhite","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/RPLnEinjye4qy7M6Q/avatar/1745411346850.png"}},{"key":"wyTiAvbYaoamZXbR5","name":"Andrew Heusser, PhD","linkedin":"","jobTitle":"Principal Data Scientist","company":"PyMC Labs","avatar":{"backgroundColor":"mediumorchid","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/wyTiAvbYaoamZXbR5/avatar/1745409422421.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA136","key":"DA136","title":"Accelerate and Automate Your Data Science Workflows with AI and GPUs","description":"The demand for faster and more efficient data science workflows has never been higher. Traditional approaches to data analysis, model development, and experimentation are often slow and resource-intensive, limiting the pace of innovation. This session will explore how AI-powered automation and GPU acceleration can 10x the speed at which data scientists develop, analyze, and extract insights.\n\nWe will start by tackling AI-driven code generation and execution using an intelligent AI editor that seamlessly integrates generative AI to assist with writing and running code for data-driven decision making. From automatic data preprocessing to exploratory analysis, we will take advantage of generative AI tools to reduce friction in the development process, allowing data scientists to focus on high-value tasks rather than repetitive scripting.\n\nBeyond automation, we will take a technical look into the power of self-hosted custom LLMs and how they can be optimized for data-intensive workloads. Whether fine-tuning models on proprietary datasets or running inference at scale, hosting LLMs on GPU-powered infrastructure unlocks performance and efficiency with the best open-source LLM models. We’ll also cover best practices for provisioning GPU servers across multiple cloud providers, ensuring that AI workflows remain both scalable and cost-effective. General compute and cloud GPUs will be provided to attendees.\n\nAttendees will gain practical insights into how they can supercharge their workflows by leveraging AI and GPUs to dramatically accelerate their time-to-insight. Whether you’re a data scientist, ML engineer, or AI practitioner, this hands-on workshop will provide actionable strategies to optimize your workflow and maximize computational efficiency.","tags":["Machine Learning"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"14:35:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747334100000,"utcEndTimeMilliseconds":1747337700000,"displayStartTime":"2:35 PM","displayEndTime":"3:35 PM","location":"Room 208","sessionLevel":"All Levels","sessionType":"Workshop","ticketTypes":["Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Gold"],"company":"","speakers":[{"key":"KzCYKabKrp2eCRjzK","name":"Andrew Chang","linkedin":"","jobTitle":"Founder CEO\t","company":"American Data Science Inc.","avatar":{"backgroundColor":"plum","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/KzCYKabKrp2eCRjzK/avatar/1747315978478.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA137","key":"DA137","title":"Grading the Graders: Benchmarking an LLM Judge Using Human Grading Patterns","description":"When implementing technology solutions such as fancy new LLM Agents, a critical question arises: “How do we confirm its effectiveness and value?”. This can be straightforward with ample numeric data and well-established metrics. However, with LLM Agents that produce free-text summaries or answers to questions, figuring out how to quickly assess the performance is challenging because reasonable humans can disagree on the outcomes. Evaluating these AI tools quickly is essential to select optimal solutions that align with organizational goals and enhance decision-making.  It’s also crucial to minimize risks and maintain consistent performance over time, which fosters trust in these solutions.\n\nSince this is so important, we conducted an adequately powered study to understand more about how humans rate the free-text answers from an LLM-based RAG system. This system helps human call agents quickly navigate and answer questions about Humana’s health insurance benefit policies, getting answers to complicated questions more quickly to our members. The goals of this study are to understand the potential inter-rater ambiguity that might exist when interpreting free-text answers to questions posed and whether an auto-grader LLM Judge is similar in capability to human graders. Ideally, the feedback from achieving the first goal should help improve the performance of the auto-grader LLM.\n\nWe plan to share a detailed review of the human variability analysis and key conclusions we were able to derive from it.  We also plan to share a walkthrough of how we use the auto-grader LLM Judge, the baseline performance, the prompt engineering we were able to apply to make improvements, and the results of the new prompt we will use going forward.  Lastly, we will discuss pitfalls, limitations, and important things to consider when attempting to conduct a study like this. We hope this will empower more people to think about this critical process when developing LLM Judges, understanding that we aren’t ready to take humans out of the loop just yet.","tags":["LLMs","Generative AI","AI for Biotech and Pharma"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"15:05:00","timeZone":"America/New_York","duration":60,"utcStartTimeMilliseconds":1747335900000,"utcEndTimeMilliseconds":1747339500000,"displayStartTime":"3:05 PM","displayEndTime":"4:05 PM","location":"Room 206","sessionLevel":"Intermediate","sessionType":"Tutorial","ticketTypes":["Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[{"key":"oLuDij23rqv7MekSa","name":"David Mack, PhD","linkedin":"","jobTitle":"Principal Data Scientist","company":"Humana","avatar":{"backgroundColor":"moccasin","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/oLuDij23rqv7MekSa/avatar/1745409788178.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA138","key":"DA138","title":"True Multi Table AutoML with Kurve and Graphs","description":"AutoML still requires the availability of single tables with independent and dependent variables, but data in data lakes and data warehouses is spread across many tables and not ready for ML and AI out of the box.  Most predictive AI problems depend on many disparate tables, yet to take advantage of hyper parameter sweeps or AutoML engines one must merge the data into a single \"ML ready\" table.  In this session we'll show how to leverage Kurve and graphs to automate the entire process of building ML ready datasets on raw data lakes about which you know little or nothing to achieve true multi table AutoML.","tags":["Machine Learning","LLMOps & MLOps","Data Engineering","Predictive AI"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"15:10:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747336200000,"utcEndTimeMilliseconds":1747338000000,"displayStartTime":"3:10 PM","displayEndTime":"3:40 PM","location":"Room 204","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"vx49avxXfxJTgCrRQ","name":"Wes Madrigal","linkedin":"","jobTitle":"CEO / Co-Founder","company":"Kurve, Inc.","avatar":{"backgroundColor":"aqua","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/vx49avxXfxJTgCrRQ/avatar/1747053179057.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA139","key":"DA139","title":"10 Most Neglected Data Engineering Tasks","description":"Every organization faces a constant balance between delivering approved projects (the top-of-mind, important tasks that management wants to launch) and fixing urgent problems (the ones that break systems in unexpected ways.) But there's a third bucket of issues—the long-languishing, forgotten, often boring tasks that turn into technical debt.\nTake a step back from the Top Ten lists and join Veronika Durgin as she digs through the most neglected data engineering tasks that will come back to haunt you. This \"forgotten bucket\" can always be deferred, but the more you wait, the more time you'll spend on unplanned activities. She will cover the elusive “definition of done”, discuss the value of Data SLAs, and expose hidden costs of build vs buy.","tags":["Data Engineering"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"15:10:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747336200000,"utcEndTimeMilliseconds":1747338000000,"displayStartTime":"3:10 PM","displayEndTime":"3:40 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"y7j23oJe9cvzB9B5f","name":"Veronika Durgin","linkedin":"","jobTitle":"VP, Data","company":"Saks","avatar":{"backgroundColor":"wheat","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/y7j23oJe9cvzB9B5f/avatar/1745411401098.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA140","key":"DA140","title":"Extracting Insights from Public Datasets with NLP & LLMs: Lessons from ClinicalTrials.gov","description":"The FDA’s Clinicaltrials.gov site is one of several public resources for understanding medical clinical trials.  All US trials are now required to submit information to this website.  The trial data includes information of the inclusion, exclusion, and outcomes being studied. It includes recruitment information and, after the study has been completed, includes the summarized results. This information is a gold mine for understanding the competitive intelligence for each disease, how the trials were conducted, recruitment statistics and more. For completed studies, the site summarizes the outcomes across arms as well as the adverse events observed.\n\nThis talk covers multiple approaches that we’ve applied to the Clinicaltrials.gov site to unlock its value. The web site offers semi-structured data ranging from free text fields through similar tables that must be aligned.  We will discuss the use of traditional Natural Language Processing (NLP) approaches as well as Large Language Models (LLM). In addition, we will discuss approaches for better search and challenging clustering problems to unlock the value of the site.","tags":["AI for Biotech and Pharma","LLMs"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"15:45:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747338300000,"utcEndTimeMilliseconds":1747340100000,"displayStartTime":"3:45 PM","displayEndTime":"4:15 PM","location":"Room 205","sessionLevel":"All Levels","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"2tFN9LEyj3Hgd48Kq","name":"Peter Henstock, PhD","linkedin":"","jobTitle":"Senior Machine Learning Engineer","company":"Incyte","avatar":{"backgroundColor":"paleturquoise","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/2tFN9LEyj3Hgd48Kq/avatar/1745410944403.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":true},{"uniqueId":"DA141","key":"DA141","title":"GenAI at Scale: Building and Measuring Responsible AI Solutions","description":"In the rapidly evolving landscape of generative AI, business and tech leaders need to ensure that their AI systems are not generating errors or adding information that isn’t substantiated in the application’s data sources, which can erode user trust. \n\nIn this session, Francesca will present scalable Responsible AI tools for generative AI app developers: \n\nPrompt Shields to detect and block prompt injection attacks, including a new model for identifying indirect prompt attacks before they impact your model.\nGroundedness detection to detect “hallucinations” in model outputs.\nSafety system messages to steer your model’s behavior toward safe, responsible outputs.\nSafety evaluations to assess an application’s vulnerability to jailbreak attacks and to generating content risks.\nRisk and safety monitoring to understand what model inputs, outputs, and end users are triggering content filters to inform mitigations","tags":["Generative AI"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"15:45:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747338300000,"utcEndTimeMilliseconds":1747340100000,"displayStartTime":"3:45 PM","displayEndTime":"4:15 PM","location":"Room 204","sessionLevel":"Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[{"key":"kCc87DunodE4ozQKE","name":"Francesca Lazzeri, PhD","linkedin":"","jobTitle":"Principal Director, AI Engineering","company":"Microsoft","avatar":{"backgroundColor":"burlywood","source":"https://d24ldg1t3xolr9.cloudfront.net/mobile/users/kCc87DunodE4ozQKE/avatar/1745409995244.png"}}],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA142","key":"DA142","title":"Unleashing the Power of Open-Source for Large-Scale AI: A Comprehensive LLMOps and MLOps Platform on Kubernetes","description":"In the rapidly evolving landscape of artificial intelligence (AI), effective operations management for machine learning (ML) and large language models (LLMs) is critical. While new models and methods improve LLMs and agentic systems, few platform-agnostic tools exist for unified system evaluation. We integrate our tools with widely used cloud services and choose open-source tools for portability. We offer a complete open-source LLMOps and MLOps platform for efficient Kubernetes deployment, streamlining AI workflow integration and management at scale.\n\nOur platform promotes accelerated innovation by enabling faster experimentation and iteration cycles. Through enhanced productivity, teams can automate and streamline their end-to-end ML lifecycle processes, from data ingestion to model deployment. With improved decision-making facilitated by robust model monitoring and evaluation tools, stakeholders can gain deeper insights and make more informed choices. Additionally, our open-source approach opens up new opportunities for collaboration and customization, allowing organizations to tailor solutions to their unique needs.\n\nCentral to our modular architecture is an intuitive user interface that ushers users through the entire end-to-end MLOps cycle. Our platform integrates tools for AI asset discovery, registration, validation, evaluation, monitoring, and assessment to facilitate centralized ML management. Behind this UI is our platform-agnostic Kubernetes environment, allowing users to easily manage new datasets with LakeFS, run dataset and model validation pipelines with Kubeflow, and collect training and deployment metrics with MLFlow. To cover staging and deployment, our monitoring tools, coupled with KServe’s inference server and the Kubeflow training operator, complete a centralized end-to-end ML development and deployment ecosystem. \n\nAttendees will learn the ease with which AI centralization can be achieved via the discovery and registration of datasets and models as they deploy this distribution via our GitHub repository. We’ll dive into our data and model monitoring ecosystems. Attendees will get experience with our data provenance tools like LakeFS and transparency-enhancing monitoring tools such as MLFlow and AIM.  Join us if you are interested in using open-source technologies to build a strong, cost-effective MLOps and LLMOps infrastructure.","tags":["LLMOps & MLOps","Data Engineering"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"15:45:00","timeZone":"America/New_York","duration":30,"utcStartTimeMilliseconds":1747338300000,"utcEndTimeMilliseconds":1747340100000,"displayStartTime":"3:45 PM","displayEndTime":"4:15 PM","location":"Room 208","sessionLevel":"Beginner-Intermediate","sessionType":"Talk","ticketTypes":["Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business","Silver"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":false,"isFavorite":false},{"uniqueId":"DA143","key":"DA143","title":"End of Day Happy Hour","description":"Wrap up your day with our End of Day Happy Hour! Join us for a relaxed, casual gathering to unwind, enjoy drinks, and connect with fellow attendees. Thank you for joining us – let's toast to a successful day of learning and networking!","tags":["Networking +"],"date":"2025-05-15","milliseconds":1747267200000,"startTime":"16:30:00","timeZone":"America/New_York","duration":120,"utcStartTimeMilliseconds":1747341000000,"utcEndTimeMilliseconds":1747348200000,"displayStartTime":"4:30 PM","displayEndTime":"6:30 PM","location":"Expo Hall - Room 210","sessionLevel":"All Levels","sessionType":"Networking +","ticketTypes":["Expo","Silver","Gold","Platinum","Bootcamp","VIP","2-Day Business","3-Day Business"],"company":"","speakers":[],"isHighlighted":false,"isNetworking":true,"isFavorite":false}],"tags":[{"key":"AI Agents","value":"AI Agents","isSelected":false},{"key":"Generative AI","value":"Generative AI","isSelected":false},{"key":"LLMs","value":"LLMs","isSelected":false},{"key":"Machine Learning","value":"Machine Learning","isSelected":false},{"key":"AI Engineering","value":"AI Engineering","isSelected":false},{"key":"Book Signing","value":"Book Signing","isSelected":false},{"key":"LLMOps & MLOps","value":"LLMOps & MLOps","isSelected":false},{"key":"Data Engineering","value":"Data Engineering","isSelected":false},{"key":"GenAi X Panel","value":"GenAi X Panel","isSelected":false},{"key":"RAG","value":"RAG","isSelected":false},{"key":"AI Expo Talk","value":"AI Expo Talk","isSelected":false},{"key":"Executive RoundTable","value":"Executive RoundTable","isSelected":false},{"key":"Data Visualization & Analysis","value":"Data Visualization & Analysis","isSelected":false},{"key":"Networking +","value":"Networking +","isSelected":false},{"key":"Ai Agents","value":"Ai Agents","isSelected":false},{"key":"Data Visualization & Data Analysis","value":"Data Visualization & Data Analysis","isSelected":false},{"key":"All Tracks","value":"All Tracks","isSelected":false},{"key":"Community Space","value":"Community Space","isSelected":false},{"key":"Multimodal & Deep Learning","value":"Multimodal & Deep Learning","isSelected":false},{"key":"AI for Biotech and Pharma","value":"AI for Biotech and Pharma","isSelected":false},{"key":"Deep Learning","value":"Deep Learning","isSelected":false},{"key":"AI Startup Showcase","value":"AI Startup Showcase","isSelected":false},{"key":"Predictive AI","value":"Predictive AI","isSelected":false}],"sessionLevels":[{"key":"All Levels","value":"All Levels","isSelected":false},{"key":"Beginner","value":"Beginner","isSelected":false},{"key":"Intermediate","value":"Intermediate","isSelected":false},{"key":"Intermediate-Advanced","value":"Intermediate-Advanced","isSelected":false},{"key":"Beginner-Intermediate","value":"Beginner-Intermediate","isSelected":false},{"key":"","value":"","isSelected":false},{"key":"Intermediate - Advanced","value":"Intermediate - Advanced","isSelected":false}],"ticketTypes":[{"key":"Expo","value":"Expo","isSelected":true},{"key":"Gold","value":"Gold","isSelected":true},{"key":"Platinum","value":"Platinum","isSelected":true},{"key":"Bootcamp","value":"Bootcamp","isSelected":true},{"key":"VIP","value":"VIP","isSelected":true},{"key":"2-Day Business","value":"2-Day Business","isSelected":true},{"key":"3-Day Business","value":"3-Day Business","isSelected":true},{"key":"Silver","value":"Silver","isSelected":true},{"key":"Invited Attendees Only","value":"Invited Attendees Only","isSelected":true},{"key":"Speakers","value":"Speakers","isSelected":true}],"sessionTypes":[{"key":"GenAi X Keynote","value":"GenAi X Keynote","isSelected":true},{"key":"Tutorial","value":"Tutorial","isSelected":true},{"key":"Training","value":"Training","isSelected":true},{"key":"GenAi X Talk","value":"GenAi X Talk","isSelected":true},{"key":"Talk","value":"Talk","isSelected":true},{"key":"Book Signing","value":"Book Signing","isSelected":true},{"key":"GenAi X Panel","value":"GenAi X Panel","isSelected":true},{"key":"AI Expo Talk","value":"AI Expo Talk","isSelected":true},{"key":"Round Table Discussion","value":"Round Table Discussion","isSelected":true},{"key":"Workshop","value":"Workshop","isSelected":true},{"key":"Networking +","value":"Networking +","isSelected":true},{"key":"Keynote","value":"Keynote","isSelected":true},{"key":"Track Keynote","value":"Track Keynote","isSelected":true},{"key":"Women in DS","value":"Women in DS","isSelected":true},{"key":"AI Startup Showcase","value":"AI Startup Showcase","isSelected":true},{"key":"Lightning Talk","value":"Lightning Talk","isSelected":true}],"dates":[{"key":"2025-05-13","milliseconds":1747094400000,"month":"May","date":13,"day":"Tue"},{"key":"2025-05-14","milliseconds":1747180800000,"month":"May","date":14,"day":"Wed"},{"key":"2025-05-15","milliseconds":1747267200000,"month":"May","date":15,"day":"Thu"}],"dateIndex":2,"liveUpdateDelay":60000}}